[
  {
    "id": 1,
    "filename": "Impossibly Easy Triple Cheese Pie.pdf",
    "file_path": "recipes/001_Impossibly_Easy_Triple_Cheese_Pie.pdf",
    "type": "pdf",
    "content": "Recipes  | Everyday Meals  | Special Occasions  | Betty's Kitchen  | How-To  | Products  | Coupons  | In-Store Sales \nImpossibly Easy Triple Cheese Pie View Recipe \nSay cheese! This pie with its delicious \nblend of cottage, mozzarella and Cheddar \ncheeses will delight the cheese lover in \nyou. \nPrep Time \n15 min Total Time \n50 min Servings \n6\n1/2 \n1/2 \n1/2 \n1/2 \n1/2 \n1\n2\n1/2 cup small curd creamed cottage cheese \ncup shredded mozzarella cheese (2 ounces) \ncup shredded Cheddar cheese (2 ounces) \ncup chopped green bell pepper, if desired \ncup Original Bisquick™ mix \ncup milk \neggs \ncup French-fried onions \nHeat oven to 400ºF. Grease 9-inch pie plate. Stir t ogether cheeses and bell pepper; spread in pie plat e. 1. \nStir Bisquick mix, milk and eggs until blended. Pou r into pie plate; sprinkle with onions. 2. \nBake about 35 minutes or until golden brown and kni fe inserted in center comes out clean. Cool 5 \nminutes. 3. \nImpossibly Easy Triple-Cheese Pie makes a great lig ht dinner. Simply serve this rich and cheesy pie wi th \nsteamed asparagus and red grapes. \nSavor this delicious dish again! Cover and refriger ate any remaining pie, and reheat slices in the mic rowave. \nSavory Impossibly Easy Pies can be covered and refr igerated up to 24 hours before baking. You may need  to \nbake a bit longer than the recipe directs since you ’ll be starting with a cold pie. Watch carefully fo r doneness. \nNutrition Information \nServing Size: 1 Serving  Calories 200 ( Calories from Fat 110 ), % Daily Value  T otal Fat 12 g 12 % (Saturated Fat 5\ng, 5 % ), Cholesterol 90 mg 90 %; Sodium 400 mg 400 %; T otal Carbohydrate 11 g 11 % (Dietary Fiber 0g 0% ), \nProtein 12 g 12 % ; % Daily Value*:  Vitamin A 6%; Vitamin C 0%; Calcium 20%; Iron 4%; Exchanges: 1 Starch; Impossibly Easy Triple Cheese Pie http://www.bettycrocker.com/recipes/impossibly-easy -triple-cheese-pie/... \n1 of 2 10/1/2014 5:14 PM\n©2014 ®/TM General Mills All Rights Reserved *Percent Daily Values are based on a 2,000 calorie diet. Impossibly Easy Triple Cheese Pie http://www.bettycrocker.com/recipes/impossibly-easy -triple-cheese-pie/... \n2 of 2 10/1/2014 5:14 PM",
    "preview": "Recipes | Everyday Meals | Special Occasions | Betty's Kitchen | How-To | Products | Coupons | In-Store Sales Impossibly Easy Triple Cheese Pie View Recipe Say cheese! This pie with its delicious...",
    "size": 118257
  },
  {
    "id": 2,
    "filename": "Corn Tortilla Quesadilla Recipe_ A Quick Meal.pdf",
    "file_path": "recipes/002_Corn_Tortilla_Quesadilla_Recipe__A_Quick_Meal.pdf",
    "type": "pdf",
    "content": "3/17/24, 12:44 PM Corn Tortilla Quesadilla Recipe: A Quick Meal\nﬁle:///home/jfg/Mount/box 25GB/Recipes/Corn Tortilla Quesadilla Recipe A Quick Meal.htm 1/3HubPages\nSearch search\nexplore\ntopics\nhubs\nanswers\nforums\nsign in\njoin now\nflag\nExplore »\nFood and Cooking  (30,680) »\nQuick and Easy Recipes  (2,674) »\nQuick and Easy Dinners  (325)\nMelissa Ray Davis profile image\nby Melissa Ray Davis\n471 Followers\nCorn Tortilla Quesadilla Recipe: A Quick Meal\ncorn tortilla quesadilla with pepper jack cheese, zucchini, onion, mushrooms, and red bell pepper\ncorn tortilla quesadilla with pepper jack cheese, zucchini, onion, mushrooms, and red bell pepper\nSometimes the best recipes come from those nights when I realize that something is about to go bad if I don't use it. This forces me to get creative\nwith what I can find on hand. A while ago, I realized that the mushrooms, baby zucchinis, and corn tortillas that I'd used for various other meals were\ngoing to have to be thrown away if they didn't get used. I dug around and found some pepper jack cheese, onion, and red pepper and realized that I\nhad the makings for a great meal.\nQuesadillas are traditionally made with flour tortillas, but when I found the corn tortillas in my fridge I figured it was worth experimenting. I'm glad I\ndid! These corn tortilla quesadillas were delicious, warm and spicy with that distinctive crunch of a fried corn tortilla. Perfect! It turns out people do\nuse corn tortillas for quesadillas sometimes, I'd just never had the pleasure of trying one.\nCorn Tortilla Quesadilla Recipe\nserves as many as you want to make\nIngredients:\ncorn tortillas\ncheese *\nbaby zucchini\nbaby bella mushrooms (or white mushrooms)\nonion\nred bell pepper\njalapeno (optional)\n* I used pepper jack cheese, but if you want something milder , use Monterey Jack or Mozerella.\nFeel free to substitute your favorite vegetables for any of those above!\nToppings (all optional):\nsalsa\nsour cream\nguacamole (recipe here )\nPreparation Instructions:\n1). Prepare your vegetables, using as much as you want to make for the amount of people you will be feeding. Wash the zucchini, mushrooms, red\nbell pepper , and jalapeno if you are using it. Slice the zucchini and jalapeno into rounds, the mushroom into bite-sized slices, and the red pepper into\nthin strips. Peel the onion and cut it into thin strips.\n2). Grate your cheese, enough to cover as many quesadillas as you plan to make.\n3/17/24, 12:44 PM Corn Tortilla Quesadilla Recipe: A Quick Meal\nﬁle:///home/jfg/Mount/box 25GB/Recipes/Corn Tortilla Quesadilla Recipe A Quick Meal.htm 2/3Loading...3). Add some butter or mar garine to a cast iron skillet or non-stick pan and heat over medium (medium-low on a gas range) until the butter has\nmelted.\n4). Take one corn tortilla and cover it lightly in grated cheese. Place various vegetables across it, and then sprinkle a little more cheese over those.\nCover in another corn tortilla, then carefully transfer it to the skillet.\n5). Once the cheese has started to melt and the bottom has turned golden brown, flip the quesadilla to the other side until it too is golden brown.\nRemove from the skillet.\n6). Cut into quarters and serve! These taste excellent with a little salsa dribbled over them. You can also add sour cream and guacamole if you want to\n(Great guacamole recipe here ).\nThis Hub was last updated on February 1, 2008\nUseful  {3} • Funny   • Awesome   • Beautiful   • Interesting  \nprevious\nAsian Roasted Peanut Noodles with Vegetables Recipe  Asian Roasted Peanut Noodles with Vegetables Recipe\nnext\nHomemade Macaroni and Cheese Recipe  Homemade Macaroni and Cheese Recipe\nDiscover More Hubs\nOven baked Fusilli  Oven baked Fusilli\nA Poor Man's Steak and Cheese Recipe  A Poor Man's Steak and Cheese Recipe\nTater Tots 'n Cheese Recipe  Tater Tots 'n Cheese Recipe\nQuick and Easy Recipe for Mexican Cinnamon Sugar Tortilla Chips  Quick and Easy Recipe for Mexican Cinnamon Sugar Tortilla Chips\nHow to make vegetarian fish and chips using Halloumi cheese.Recipe.  How to make vegetarian fish and chips using Halloumi\ncheese.Recipe.\nPizza Macaroni and Cheese Recipe. A Satisfying 2-in1 Dish  Pizza Macaroni and Cheese Recipe. A Satisfying 2-in1 Dish\nComments 3 comments\nGo to last comment\nJaime Sanchez 19 months ago\nquesadillas began with corn tortillas. soft corn torillas were folded in half around a piece of cheese, epazote herb, peppers, potatpes and chorizo then\nplace on a griddle to melt the cheese or fried until golden. You are just used to going to resturants and being served gringo quesadillas, especially\nthose chicken quesadillas. Flour tortillas are a \"T ex-Mex\" creation due to the introduction of trigo 'wheat' for flour . Just to set the record straight.\nMelissa Ray Davis profile image\nMelissa Ray Davis  17 months ago from Swannanoa, NC Hub Author\nThanks Jaime, that makes sense. Perhaps what I should have said is \"flour tortillas are traditionally used in American Mexican restaurants.\" ;-)\nAunt B 5 months ago\nJaime, Thank you for that information! It gives me ammonition when people tease me for using Corn Tortillas. I cannot eat Wheat Flour and Corn\nTortillas are a staple for me!\nThanks again!\nSign in  or sign up  and post using a HubPages account.\n8192  characters left.\nPost Comment\nNo HTML  is allowed in comments, but URLs will be hyperlinked. Comments are not for promoting your Hubs or other sites.",
    "preview": "3/17/24, 12:44 PM Corn Tortilla Quesadilla Recipe: A Quick Meal ﬁle:///home/jfg/Mount/box 25GB/Recipes/Corn Tortilla Quesadilla Recipe A Quick Meal.htm 1/3HubPages Search search explore topics hubs...",
    "size": 165131
  },
  {
    "id": 3,
    "filename": "Mushroom Gravy - RecipeTin Eats.pdf",
    "file_path": "recipes/003_Mushroom_Gravy_-_RecipeTin_Eats.pdf",
    "type": "pdf",
    "content": "3/6/24, 3:55 PM Salisbury Steak with Mushroom Gravy - RecipeTin Eats\nhttps://www.recipetineats.com/wprm_print/23384 1/2Salisbury Steak with Mushroom Gravy\nRecipe VIDEO abo ve. Salisbur y steak is a t otally scrumptious wa y to transform\nthe humble gr ound beef / mince int o something amazing! The onion gr ating /\nsoaking br eadcrumbs will mak e your patties extr a tasty and tender , and the\nMushr oom Gr avy is made extr a delicious b y cooking the Salisbur y Steaks IN\nthe gr avy.\nAnd next time - tr y Salisbur y Steak Meatballs !\n15 mins 15 mins 30 mins\nDinner Western Salisbur y Steak  5 286cal\nNagi | RecipeTin Eats\nIngredients\nSalisbur y Steak\nGravy\nInstructions\nSalisbur y Steaks\nPrep Time\nCook Time\nTotal Time\nCourse: \nCuisine: \nKeywor d: \nServings: \nCalories: \nAuthor: 1/2 onion  \n(white, br own or y ellow)\n1/2 cup panko br eadcrumbs  \n(or 1/3 cup or dinar y breadcrumbs)\n1 lb/500g ground beef (mince)\n1 garlic clo ve \n, minced\n1 egg\n2 tbsp  ketchup\n1 beef bouillon cube  \n, crumbled\n1/2 tsp Worcestershir e sauce\n3 tsp dijon mustar d \nOR 2 tsp dr y mustar d powder\n1 tbsp  olive oil\n2 garlic clo ves \n, minced\n1/2 onion  \n, ﬁnely chopped\n5 oz/150g mushr ooms  \n, sliced\n30g / 2 tbsp  unsalted butter\n3 tbsp  ﬂour  \n(all purpose / plain)\n2 cups  beef br oth / st ock \n, low sodium\n1/2 cup water\n2 tsp dijon mustar d\n2 tsp Worcestershir e sauce\nSalt and pepper\n1. Onion gr ating - Place br eadcrumbs in a bowl. Use a bo x grater and gr ate the onion o ver the\nbreadcrumbs. Mix with ﬁngers, lea ve to soak for a f ew minutes. \n2. Mix - Add r emaining Salisbur y Steak ingr edients int o the lar ge bowl. Use y our hands t o mix until\njust combined. Mix well for a couple of minutes until the mixtur e becomes a bit \" pasty \" which\nwill ensur e your patties hold t ogether well.\n3. Form patties - Divide int o 5 and pat v ery ﬁrmly int o oval patties ar ound 3/4\" / 1 2/3 cm thick.\n4.92  from 498 votes\n3/6/24, 3:55 PM Salisbury Steak with Mushroom Gravy - RecipeTin Eats\nhttps://www.recipetineats.com/wprm_print/23384 2/2Cooking and Gr avy\nNotes\n1. Recipe originally published December 2015. Cooking steps str eamlined t o mak e it mor e eﬃcient.\nIngredients ha ve remained the same. If y ou ar e determined t o continue using the original r ecipe,  here\nis a PDF v ersion .\n2. Nutrition below is per ser ving for the Salisbur y Steak + gr avy, no sides.\nNutrition\nServing: 316g | Calories: 286cal | Carbohy drates: 15g | Protein: 25g | Fat: 13g | Satur ated F at: 5g |\nCholester ol: 101mg | Sodium: 651mg | Potassium: 678mg | Fiber: 1g | Sugar: 4g | Vitamin A: 225IU |\nVitamin C: 3.2mg | Calcium: 42mg | Iron: 3.4mg\nAnother gr eat r ecipe b y recipetineats.com1. Brown patties - Heat oil in a skillet o ver high heat. Add the steaks and cook the ﬁrst side for 1\nminute or until br owned, then gently ﬂip and br own the other side (the y will still be r aw inside).\nRemo ve ont o plate.\n2. Cook ar omatics - If skillet is looking dr y, add a t ouch mor e oil. Add chopped onion and garlic\nand cook for 2 minute until onions ar e a bit tr anslucent.\n3. Cook mushr ooms - Add the mushr ooms int o the skillet and cook for 2 - 3 minutes until golden.\n4. Mak e gravy roux - Turn heat down t o medium. Add butter . Once melted, add ﬂour and cook for\n30 seconds, stirring constantly .\n5. Gravy - Gradually add in beef br oth, stirring as y ou go. Once mostly lump fr ee, whisk in\nremaining Gr avy ingr edients. \n\u0000. Finish cooking steaks - Add steaks along with the juices on the plate. Cook for 5 - 7 minutes, or\nuntil gr avy is thick ened, stirring occasionally ar ound the steaks. If the gr avy thick ens t oo quickly ,\nadd mor e water .\n7. Season gr avy - Remo ve steaks ont o a plate. Taste gr avy and adjust salt and pepper t o taste.\n\u0000. Serve salisbur y steaks t opped with the mushr oom gr avy - o ver mashed potat o is ideal! Sprinkle\nwith a bit of parsle y if desir ed.",
    "preview": "3/6/24, 3:55 PM Salisbury Steak with Mushroom Gravy - RecipeTin Eats https://www.recipetineats.com/wprm_print/23384 1/2Salisbury Steak with Mushroom Gravy Recipe VIDEO abo ve. Salisbur y steak is a t...",
    "size": 1203184
  },
  {
    "id": 4,
    "filename": "broccoli_hoisin_stirfry.txt",
    "file_path": "recipes/004_broccoli_hoisin_stirfry.txt",
    "type": "text",
    "content": "INGREDIENTS:\n\n    * 3 tbsp hoisin sauce\n    * 1 tbsp sesame oil+ 2 tbsp\n    * 2 tbsp soy sauce + 2 tbsp\n    * 1 tbsp rice vinegar\n    * 2 tbsp sugar or liquid sweetener\n    * 3/4 cup vegetable broth\n    * 2 cloves garlic, minced\n    * 1 tsp fresh ginger, minced\n    * 1 tbsp corn starch\n    * approx. 1 cup seitan, chopped into 1 inch pieces\n    * 3-4 green onions, chopped\n    * 1 red or yellow bell pepper\n    * approx 2 cups broccoli, chopped\n\nPREPARATION:\nIn a small saucepan, whisk together hoisin sauce, 1 tbsp sesame oil, 2 tbsp soy sauce, rice vinegar, sugar, broth, garlic, ginger and corn starch over medium heat. Allow to simmer until mixture thickens, about 5-7 minutes, then remove from heat and set aside.\n\nIn a large wok or skillet, stir-fry seitan in 2 tbsp sesame oil and 2 tbsp soy sauce until lightly browned, about 3 minutes. Add onions, pepper and broccoli and stir-fry another 2-3 minutes.\n\nAdd sauce mixture to the stir-fry and combine well, allowing to cook another 2-3 minutes, until broccoli is done cooking.",
    "preview": "INGREDIENTS: * 3 tbsp hoisin sauce * 1 tbsp sesame oil+ 2 tbsp * 2 tbsp soy sauce + 2 tbsp * 1 tbsp rice vinegar * 2 tbsp sugar or liquid sweetener * 3/4 cup vegetable broth * 2 cloves garlic, minced...",
    "size": 1055
  },
  {
    "id": 5,
    "filename": "Homemade Salisbury Steak - Valerie's Kitchen.pdf",
    "file_path": "recipes/005_Homemade_Salisbury_Steak_-_Valerie's_Kitchen.pdf",
    "type": "pdf",
    "content": "3/6/24, 4:02 PM Homemade Salisbury Steak - Valerie's Kitchen\nhttps://www.fromvalerieskitchen.com/wprm_print/84522 1/2Homemade Salisbury Steak\nThis Homemade Salisbur y Steak r ecipe with rich and silky mushr oom gr avy\nis made completely fr om scr atch in just 30 minutes. Ser ve it o ver mashed\npotat oes for a comfor ting, nostalgic meal.\n15 mins 15 mins 30 mins\nMain Course American  4\n486kcal  Valerie Brunmeier\nIngredients\nFor the Salisbur y Steak P atties\nFor the Mushr oom Onion Gr avy\nInstructions\nSalisbur y Steak P atties\nMushr oom Onion Gr avy\nPrep Time\nCook Time\nTotal Time\nCourse: \nCuisine: \nServings: \nCalories: \nAuthor: 1 egg\n½ cup Italian seasoned P anko br eadcrumbs\n1 tablespoon  ketchup or t omat o paste\n2 teaspoons  Dijon mustar d\n2 teaspoons  Worcestershir e sauce\n¼ teaspoon  salt\nfreshly gr ound black pepper  \nto taste\n1 ½ pounds  85% t o 90% lean gr ound beef\n2 tablespoon  olive oil \nor as needed, divided\n1 small sweet y ellow onion  \nhalved and thinly sliced\n8 ounce  cremini mushr ooms  \nsliced\n2 cups  low sodium beef br oth\n1 tablespoon  ketchup or t omat o paste\n1 tablespoon  low sodium so y sauce\n1 teaspoon  Worcestershir e sauce\n1 teaspoon  Dijon mustar d\n2 teaspoons  cornstar ch\n2 teaspoons  water\nbrowning sauce lik e Kitchen Bouquet  \na few dr ops for color (optional)\nsalt and fr eshly gr ound black pepper  \nto taste\nfresh Italian parsle y \nor other fr esh herbs (optional garnish)\n1. In a lar ge bowl, whisk the egg with a fork. Stir in the br ead crumbs, k etchup (or t omat o paste),\nDijon, W orcestershir e sauce, salt and pepper . Add the gr ound beef and mix well. F orm int o 4 t o 6\noval patties no mor e than ½-inch thick.\n2. Add 1 tablespoon oil t o a lar ge, deep nonstick skillet or sauté pan and place it o ver MEDIUM-\nHIGH heat. Add the patties and cook until br owned on both sides and cook ed thr ough with an\ninternal temper ature of 150 t o 155 degr ees F . Transf er the patties t o a plate and set aside.\n1. Pour off any gr ease fr om the skillet and place it o ver MEDIUM heat (wipe out any big burned bits\nwith a paper t owel). Add the sliced onions and cook until softened and just beginning t o get\n5 from 49 votes\n3/6/24, 4:02 PM Homemade Salisbury Steak - Valerie's Kitchen\nhttps://www.fromvalerieskitchen.com/wprm_print/84522 2/2Notes\nVariations\nReplace up t o half of the gr ound beef with lean gr ound pork or turk ey for a slightly diff erent\nﬂavor pr oﬁle.\nEliminate the onions fr om the gr avy if y ou ha ve ﬁnicky eaters.\nAdd a t ouch of hea vy cr eam or half and half t o the gr avy for a rich, v elvety ﬁnish.\nSprinkle the ﬁnished dish with fr esh herbs lik e parsle y or thyme for a fr esh boost of ﬂa vor.\nFreezer Instructions\nTo freeze for a futur e meal, place the uncook ed patties on a par chment paper lined baking sheet and\nfreeze for about two hours or until solid. Transf er the fr ozen patties t o a fr eezer saf e plastic st orage\nbag and the pr epar ed gr avy to a separ ate fr eezer saf e container and fr eeze for up t o 2 t o 3 months.\nThaw the fr ozen patties and gr avy overnight in the r efriger ator befor e cooking as dir ected in the\nrecipe.\nTo freeze left overs, allow them t o cool completely befor e transf erring t o a fr eezer saf e air tight\ncontainer and tr ansf er them t o the fr eezer. Once thawed, the y can be r eheated gently in a skillet on\nthe st ove or in the micr owave.\nNutrition\nCalories: 486kcal | Carbohy drates: 20g | Protein: 42g | Fat: 26g | Satur ated F at: 8g | Polyunsatur ated\nFat: 2g | Monounsatur ated F at: 13g | Trans F at: 1g | Cholester ol: 152mg | Sodium: 986mg |\nPotassium: 1202 mg | Fiber: 2g | Sugar: 5g | Vitamin A: 134IU | Vitamin C: 3mg | Calcium: 80mg | Iron:\n5mgbrown ar ound the edges, about 3 t o 4 minutes. Add the mushr ooms and cook for a f ew mor e\nminutes until the mushr ooms ar e softened. Season with a pinch of black pepper .\n2. Add the beef br oth, k etchup (or t omat o paste), so y sauce, W orcestershir e sauce, and mustar d\nand stir t o combine. In a small bowl whisk the cornstar ch with water and add the slurr y to the\nskillet. Stir for a minute or two until the sauce thick ens. F or richer color and deeper ﬂa vor, add a\nfew dr ops of br owning sauce. Taste and season with additional salt and pepper , only if needed\n3. Add the beef patties back t o the skillet and spoon the mushr oom and onion gr avy over the t op.\n4. Garnish with parsle y and ser ve over mashed potat oes.",
    "preview": "3/6/24, 4:02 PM Homemade Salisbury Steak - Valerie's Kitchen https://www.fromvalerieskitchen.com/wprm_print/84522 1/2Homemade Salisbury Steak This Homemade Salisbur y Steak r ecipe with rich and...",
    "size": 108072
  },
  {
    "id": 6,
    "filename": "Curry rice - Simply Delicious.pdf",
    "file_path": "recipes/006_Curry_rice_-_Simply_Delicious.pdf",
    "type": "pdf",
    "content": "3/10/24, 2:35 PM Quick and easy curry rice - Simply Delicious\nhttps://simply-delicious-food.com/wprm_print/18846 1/1Quick and easy curry rice\nCurr y rice is an easy side dish r ecipe, per fect for ser ving with y our fa vorite\ncurries. A f ew pantr y staples is all y ou need for this delicious dish.\nCourse Side Dish\nCuisine Indian\nKeywor d Curr y rice, Curr y rice r ecipe, how t o mak e curr y rice\nPrep Time 5 minutes\nCook Time 30 minutes\nTotal Time 35 minutes\nServings 6\nCalories 255kcal\nAuthor Alida Ry der\nIngredients\nInstructions\nNutrition\nCalories: 255kcal | Carbohy drates: 55g | Protein: 6g | Fat: 1g | Satur ated F at: 1g | Sodium: 393mg |\nPotassium: 165mg | Fiber: 2g | Sugar: 2g | Vitamin A: 185IU | Vitamin C: 11mg | Calcium: 29mg | Iron:\n1mg\nQuick and easy curr y rice https:/ /simply-delicious-food.com/quick-and-easy-curr y-rice/1 onion  \nﬁnely chopped\n2 garlic clo ves \ncrushed\n1 tsp crushed ginger\n1 tsp turmeric\n2 tsp curry powder / Gar am Masala\n2 cups  Jasmine / Basmati rice\n4 cups  stock / water\n1 tsp salt\n1 cup frozen peas  \n(optional)\n1. Heat a tablespoon of oil in a medium-siz ed pot. Add the onion and saute until soft and\ntranslucent.\n2. Add the garlic, ginger and spices and cook for 30 seconds.\n3. Stir in the rice then pour in the water/st ock and season with salt.\n4. Allow t o simmer until most of the water has been absorbed (appr oximately 10 minutes) then stir\nin the peas.\n5. Cover with a lid then turn the heat down t o its lowest setting.\n\u0000. Allow t o cook gently for 5 minutes then turn the heat off and allow the rice t o steam for 10\nminutes.\n7. Once cook ed, ﬂuff with a fork, season t o taste and ser ve.\n",
    "preview": "3/10/24, 2:35 PM Quick and easy curry rice - Simply Delicious https://simply-delicious-food.com/wprm_print/18846 1/1Quick and easy curry rice Curr y rice is an easy side dish r ecipe, per fect for...",
    "size": 101865
  },
  {
    "id": 7,
    "filename": "Spicy Chickpea Veggie Burgers with Jalapeño and Zucchini - Peas And Crayons.pdf",
    "file_path": "recipes/007_Spicy_Chickpea_Veggie_Burgers_with_Jalapeño_and_Zucchini_-_Peas_And_Crayons.pdf",
    "type": "pdf",
    "content": "6/13/2021 Spicy Chickpea V eggie Bur gers with Jalapeño and Zucchini - P eas And Crayons\nhttps://peasandcrayons.com/2016/05/spicy -chickpea- veggie-bur gers-jalapeno -zucchini-r ecipe.html 1/2\n Print\nSpicy Chickpea Veggie Burgers with\nJalapeño and Zucchini\nSpicy chickpea veggie burgers with jalapeño and zucchini, topped\nwith a tasty honey-lime slaw and ﬁery Sriracha mayo. These are\nmy tastiest veggie burgers yet!\nCourse  Main Course\nCuisine  American\nKeyword  Spicy Chickpea Veggie Burgers\nPrep Time  15 minutes\nCook Time  10 minutes\nTotal Time  25 minutes\nServings  4 servings\nCalories  147 kcal\nAuthor  Jenn Laughlin - Peas and Crayons\nIngredients\nFOR THE BURGERS:\nFOR THE SLAW:\nFOR THE SRIRACHA AIOLI:\nInstructions1.5 cup old-fashioned rolled oats \n(not instant)\n15 oz canned chickpeas \ndrained + rinsed\n1/3 cup ﬁnely diced bell pepper \n(any color)\n1 jalapeño pepper\n1 cup grated zucchini\n1-2 TBSP green onion \n(white + green portions)\n1/2 TBSP avocado oil\n1/2 tsp garlic powder\n1/2 tsp red pepper ﬂakes\n1/4 tsp dried oregano\n1/4 tsp salt\n1 large egg\n4 onion roll buns \nsee post for GF swaps\nleafy green lettuce of choice for topping\n1 heaping cup cabbage \nﬁnely chopped/shredded\n1/2 a fresh jalapeño \nsliced thin (optional)\n1/2 TBSP honey\n1/2 TBSP avocado oil\njuice of 1 lime \nor to taste\na pinch of salt\nfresh cilantro \noptional + to taste\n1/3 cup quality mayo\n1 tsp fresh lime juice\n1-2 TBSP Sriracha \nor to taste\n1/8-1/4 tsp garlic powder\n1. Combine ingredients for the aioli and whisk. Set aside.\n2. For the slaw, combine all ingredients and adjust to taste. Set aside.\n6/13/2021 Spicy Chickpea V eggie Bur gers with Jalapeño and Zucchini - P eas And Crayons\nhttps://peasandcrayons.com/2016/05/spicy -chickpea- veggie-bur gers-jalapeno -zucchini-r ecipe.html 2/2READY TO EAT?\nRecipe Notes\nHave some red onion handy? Feel free to slice it thin + add to the slaw!\nFREEZER INSTRUCTIONS: Simply cook the burgers via instructions above, allow to cool a bit, and then freeze\n(spaced) on a plate or cookie sheet. Once they've had a chance to partially freeze you can wrap them individually\nand pile them in baggies or your favorite airtight container for fast food without the freaky ingredients. To re-heat,\nsimply pop on a baking sheet in the oven for about 18-20 minutes at 400 F. Enjoy!\nNutrition stats estimated below are for the patties by themselves, since everyone adds different\nbuns/toppings/etc... Adjust as needed.\nCalories from Fat 36\n6%\n7%\n14%% Daily V alue*Nutrition Facts\nSpicy Chickpea V eggie Burgers with\nJalapeño and Zucchini\nAmount Per Serving (1 patty)\nCalories  147\nFat 4g\nCarbohydrates  21g\nProtein  7g\n* Percent Daily V alues are based on a 2000 calorie\ndiet.\nRecipe by Peas and Crayons - Spicy Chickpea Veggie Burgers with Jalapeño and Zucchini\nhttps://peasandcrayons.com/2016/05/spicy-chickpea-veggie-burgers-jalapeno-zucchini-recipe.html3. Combine oats and chickpeas in food processor and pulse a few times to roughly chop the chickpeas and oats.\nMixture should look chopped but not be paste-like or wet/mushy.\n4. Set aside and grab those veggies!\n5. Remove the stem from the jalapeño. For spicier burgers, leave the veins and seeds intact. For less spicy\nburgers remove half or all of the veins/seeds. I left half intact and removed the rest for burgers with a spicy\nkick and lots of ﬂavor!\n\u0000. If you haven't already, grate the zucchini using the coarse side of a box grater and wrap in a paper towel.\nSqueeze out excess moisture and set aside.\n7. Sauté bell pepper, jalapeño, zucchini and green onion in avocado oil until peppers are tender.\n\u0000. Season with garlic powder, red pepper ﬂakes, oregano, and salt.\n9. Add the freshly sauteed veggies to your bean mixture, then add your egg.\n10. Stir to fully incorporate and roll mixture into four balls.\n11. To shape your burgers, cup each ball in your hands and squeeze tightly, rotating as you gently, but ﬁrmly, press\nit into a disc using your thumb. I like mine on the thiner side so middles cook all the way through, but not so\nthin that they won't hold their shape.\n12. To help the burgers set, cover and refrigerate as you prep your buns or (lettuce wraps!) and toppings. This will\ngive them a little while to set. You can even leave them overnight and cook them up the following day. I often\nmake one after 15-30 minutes of chill time and cook up the rest the following day.\n1. Pour a tablespoon or two of oil in a skillet and heat to medium-high, so the burgers sizzle when you add them\nto the pan!\n2. Cook for a few minutes on each side until you're left with a golden crust. and a warm center. Repeat for each\nburger, or cook two at once if you have a big enough pan! I'd skip crowding all four together just because they're\na pain to ﬂip when all up in eachother's business.\n3. A tip for perfectly shaped veggie burgers: While sizzling away in the skillet, I nudge the burgers with the\nbackside of my spatula to gently help form the sides into a perfect disc. Works like a charm!\n4. Slather your buns with sriracha mayo, pile them high with lettuce, and top each burger with honey-lime slaw or\nyour favorite toppings. Enjoy!",
    "preview": "6/13/2021 Spicy Chickpea V eggie Bur gers with Jalapeño and Zucchini - P eas And Crayons https://peasandcrayons.com/2016/05/spicy -chickpea- veggie-bur gers-jalapeno -zucchini-r ecipe.html 1/2 Print...",
    "size": 114692
  },
  {
    "id": 8,
    "filename": "Homemade Black Bean Burgers.pdf",
    "file_path": "recipes/008_Homemade_Black_Bean_Burgers.pdf",
    "type": "pdf",
    "content": "",
    "preview": "",
    "size": 412027
  },
  {
    "id": 9,
    "filename": "Vegetarian Baked Penne.pdf",
    "file_path": "recipes/009_Vegetarian_Baked_Penne.pdf",
    "type": "pdf",
    "content": "",
    "preview": "",
    "size": 362594
  },
  {
    "id": 10,
    "filename": "sweet-and-spicy-ketchup_print.pdf",
    "file_path": "recipes/010_sweet-and-spicy-ketchup_print.pdf",
    "type": "pdf",
    "content": "Total Time: 40 mins\nYield: makes 1 1/4 cups\nIngredients\n1 tablespoon extra-virgin olive oil\n1 small onion, ﬁnely chopped\n2 garlic cloves, minced\n1/4 cup light brown sugar\n1/2 teaspoon smoked paprika or pimentón de la Vera\n1/4 teaspoon ground allspice\n1/4 teaspoon ground cloves\n1/3 cup distilled white vinegar\n1 tablespoon tomato paste\nTwo 8-ounce cans tomato sauce\nSalt and freshly ground black pepper\nDirections\nStep 1\nIn a saucepan, heat the oil. Add the onion and garlic and cook over moderately low heat, stirring occasionally,\nuntil softened, about 7 minutes. Add the brown sugar, paprika, allspice and cloves and cook, stirring\noccasionally, until the sugar melts. Add the vinegar and tomato paste and cook over moderate heat until thick,\nabout 3 minutes. Stir in the tomato sauce and simmer over moderate heat, stirring occasionally, until very\nthick, 15 to 20 minutes.\nStep 2\nTransfer the ketchup to a blender or food processor and puree until smooth. Season with salt and pepper.\nMake Ahead\nThe ketchup can be refrigerated for up to 2 weeks.\nOriginally appeared: June 2007Sweet-and-Spicy Ketchup\nPaul Virant keeps this simple house-made ketchup on hand for staff meals when burgers or Chicago dogs are\non offer for his cooks. He also likes to have it available to serve with his chicken tenders for children who\ncome into the restaurant. For the base, Virant uses tomatoes his staff has canned during the summer, but\nstore-bought tomato sauce also works.\nBy Paul Virant | Updated on May 5, 20173/18/25, 3:39 PM foodandwine.com/recipes/sweet-and-spicy-ketchup?print\nhttps://www.foodandwine.com/recipes/sweet-and-spicy-ketchup?print 1/1",
    "preview": "Total Time: 40 mins Yield: makes 1 1/4 cups Ingredients 1 tablespoon extra-virgin olive oil 1 small onion, ﬁnely chopped 2 garlic cloves, minced 1/4 cup light brown sugar 1/2 teaspoon smoked paprika...",
    "size": 75452
  },
  {
    "id": 11,
    "filename": "Vegetable Pajeon (Korean Scallion Pancakes With Vegetables) Recipe.pdf",
    "file_path": "recipes/011_Vegetable_Pajeon_(Korean_Scallion_Pancakes_With_Vegetables)_Recipe.pdf",
    "type": "pdf",
    "content": "Vegetable\nPajeon (Korean\nScallion\nPancakes With\nVegetables)\nRecipe from Sohui Kim\nAdapted by Melissa ClarkLinda Xiao for The New York Times. Food Stylist:\nBarrett Washburne.\nTotal Time 30 minutes\nRating (2,484)\nINGREDIENTS\nYield:3 to 4 servings\nFOR THE PANCAKES\n½ cup all-purpose flour\n½ cup potato starch (or ¼ cup\neach white rice flour and\ncornstarch)\n¾ teaspoon fine sea salt, plus\nmore as needed\n½ teaspoon baking powder\n¾ cup ice water\n1 large egg\n¼ cup finely chopped kimchi\n4 cups finely chopped or grated\nmixed vegetables (carrots, zucchini,PREPARATION\nStep 1\nPrepare the pancakes: In a large bowl, whisk together all-\npurpose flour, potato starch, salt and baking powder.\nStep 2\nIn a medium bowl, combine water, egg and kimchi. W hisk\nkimchi mixture into flour mixture, and whisk until smooth.\nFold in vegetables and about three-quarters of the scallions.\n(Save the rest for garnish.)\nStep 3\nIn a large nonstick skillet over medium heat, heat 2\ntablespoons oil. Scoop ¼  cup portions of batter into the skillet,\nas many as will fit while not touching, flatten, and fry until\ndark golden on the bottom, about 2 to 3 minutes. Flip and\nCrisp at the edges, soft at the center and filled with scallions and other vegetables, these irresistible,\ncomforting pancakes (adapted from Sohui Kim of Insa and the Good Fork restaurants in Brooklyn)\nmake for a quick dinner that you can throw together on any given weeknight. Itʼs extremely forgiving,\nso feel free to use whatever vegetables you have on hand. Ms. Kim recommends finely shredded raw\nvegetables, or even leftover cooked vegetables. And if you donʼt have the bandwidth to make a dipping\nsauce, a drizzle of soy sauce and squirt of Sriracha adds verve without any work. Serve pajeon by itself\nor topped with a fried egg or two, if you want to add protein. —Melissa Clark\nbell peppers, kale, whatever youʼve\ngot)\n4 scallions, cut into 2-inch-long\nsections and thinly sliced\nlengthwise\n2 tablespoons grapeseed or peanut\noil, plus more as needed\nFOR THE DIPPING SAUCE\n3 tablespoons soy sauce\n2 teaspoons rice wine vinegar, plus\nmore to taste\n1 teaspoon finely grated fresh\nginger or garlic (optional)\n½ teaspoon sesame oil, plus more\nto taste\nPinch of granulated sugarcontinue to fry until other side is browned, 2 to 3 minutes.\nTransfer to a paper towel-lined plate and sprinkle with a little\nmore salt. Continue with remaining batter.\nStep 4\nBefore serving, make the dipping sauce: In a small bowl, stir\ntogether soy sauce, vinegar, ginger or garlic (if using), sesame\noil and sugar. Sprinkle sliced scallion over pancakes, and serve\nwith dipping sauce on the side.\nPrivate Notes\nLeave a Private Note on this recipe and see it here.",
    "preview": "Vegetable Pajeon (Korean Scallion Pancakes With Vegetables) Recipe from Sohui Kim Adapted by Melissa ClarkLinda Xiao for The New York Times. Food Stylist: Barrett Washburne. Total Time 30 minutes...",
    "size": 874278
  },
  {
    "id": 12,
    "filename": "mushroom_quesadillas.txt",
    "file_path": "recipes/012_mushroom_quesadillas.txt",
    "type": "text",
    "content": "Ingredients\n8 corn tortillas\n4 tbsp of cooking oil\n2 cups of mushrooms (cut each mushroom in 4 slices).\n2 tsp of fresh cilantro\n1 tbsp of chopped onions\nsalt 1 pinch or a dash.\n1 tsp of knorr chicken bouillion \n\n\nDirections\nMakes 8 quesadillas.\non a pan add 2 tablespoons of oil, let it heat add onions,mushrooms,cilantro, a pinch salt and knorr. let fry for about 5 minutes or untill mushrooms come soft and brown. stir ocasionaly.\nwarm up tortillas on a pan , comal or microwave.\non a frying pan add the a little oil.\nGet a tortilla add a about 1 oz of cheese add 2 tablespoon of mushrooms, close tortilla and fry both sides until tortilla comes brown.\n\n\nNumber of Servings: 8",
    "preview": "Ingredients 8 corn tortillas 4 tbsp of cooking oil 2 cups of mushrooms (cut each mushroom in 4 slices). 2 tsp of fresh cilantro 1 tbsp of chopped onions salt 1 pinch or a dash. 1 tsp of knorr chicken...",
    "size": 696
  },
  {
    "id": 13,
    "filename": "Spicy Mexican Bean Burger Recipe - Mexican.Food.com.pdf",
    "file_path": "recipes/013_Spicy_Mexican_Bean_Burger_Recipe_-_Mexican.Food.com.pdf",
    "type": "pdf",
    "content": "10/10/2020 Spicy Mexican Bean Bur ger Recipe - Mexican.Food.com\nhttps://www .food.com/r ecipe/spicy-mexican-bean-bur ger-110944 1/3SPICY MEXICAN BEAN BURGER\nRecipe by Shannon Holmes\nThis is an inexpensive vegetarian\nburger and my husband loves them. He\nate one and he said they are ﬁlling,\ndelicious and he said he wants more\nmade when these are gone and he\neven said that they are better than\nstore bought. They don't fall apart like\nmost veggie burgers and all the\ningredients are available at any grocery\nstore.\nR E A D Y  I N : 15mins\nS E R V E S : 6\nY I E L D : 6 burgers\nU N I T S : US\nI N G R E D I E N T S\n1 (16 ounce) can fat-free refried beans (these are always vegan)\n1teaspoon oil\n⁄cup small onion, coarsely chopped\n⁄green pepper, coarsely chopped\n⁄ - ⁄cup frozen corn\n1carrot, peeled and shredded\n12\n12\n1412\n10/10/2020 Spicy Mexican Bean Bur ger Recipe - Mexican.Food.com\nhttps://www .food.com/r ecipe/spicy-mexican-bean-bur ger-110944 2/3⁄cup picante sauce (spicy or mild to your taste) or 1/8 cup salsa (spicy\nor mild to your taste)\n1cup breadcrumbs\n⁄cup ﬂour\n1teaspoon black pepper, to taste\nsalt\n1dash chili powder\n1dash cumin\n⁄cup sliced black olives (optional)\nhot sauce, a few drops per burger (optional)\nN U T R I T I O N  I N F O\nServing Size: 1 (162) g\nServings Per Recipe: 6\nAMT. PER SERVING % DAILY VALUE\nCalories: 144.7\nCalories from Fat 19 g 13 %\nTotal Fat 2.1 g 3 %\nSaturated Fat 0.4 g 1 %\nCholesterol 0 mg 0 %\nSodium 189.8 mg 7 %\nTotal Carbohydrate 27.6 g 9 %\nDietary Fiber 2.6 g 10 %\nSugars 2.7 g 10 %\nProtein 4.5 g 8 %\nD I R E C T I O N S\nHeat oil in skillet over medium heat.18\n12\n12\n10/10/2020 Spicy Mexican Bean Bur ger Recipe - Mexican.Food.com\nhttps://www .food.com/r ecipe/spicy-mexican-bean-bur ger-110944 3/3Add onions, carrots, corn and chopped green pepper.\nIn the meantime, place beans in a large bowl.\nSauté until vegetables are bright in color.\nAdd vegetables to beans, blend with hand mixer.\nAdd remaining ingredients, adding more ﬂour to create a ﬁrmer mixture, or more salsa\nif mixture is too stiﬀ.\nForm into balls and smash into patties.\nPlace on pieces of waxed paper and stack in Tupperware.\nPlace about 5 sliced olives in middle of patty, smash to seal them inside.\nTo heat, spray each burger with cooking spray.\nHeat over medium heat and cook until browned on one side.\nFlip and drop a few drops of hot sauce on burger if desired.\nI serve these with salsa, chopped onions and a cheese slice on a toasted burger bun\n(toast the face in the same skillet used for the burger).",
    "preview": "10/10/2020 Spicy Mexican Bean Bur ger Recipe - Mexican.Food.com https://www .food.com/r ecipe/spicy-mexican-bean-bur ger-110944 1/3SPICY MEXICAN BEAN BURGER Recipe by Shannon Holmes This is an...",
    "size": 105869
  },
  {
    "id": 14,
    "filename": "Chickpea burgers.pdf",
    "file_path": "recipes/014_Chickpea_burgers.pdf",
    "type": "pdf",
    "content": "Buffalo Chickpea Veggie Burgers (Modified)\nhttp://peasandcrayons.com/2016/09/buffalo-chickpea- veggie-burgers.html\nTotal 25 mins\nIngredients\n•3/4 cup old-fashioned rolled oats\n•1/2 (15 oz) can of chickpeas, drained + rinsed\n•1 tbsp diced jalapeno\n•1/3 cup diced bell pepper\n•1/3 cup diced onion\n•1/4 cup shredded carrot\n•oil to cook the burgers in\n•1/2 tsp garlic powder\n•1/2 tsp red pepper flakes \n•1/2 tsp dried oregano\n•1/4 tsp salt\n•2 tbsp catsup\n•1 egg\nInstructions\n1. Mash chickpeas, combine with oats.\n2. Dice bell pepper, onion, and jalapeno.  Grate car rots.\n3. Sauté onion, peppers, and carrot in oil until ten der.\n4. Add garlic powder, red pepper flakes, oregano, an d salt.\n5. Add the freshly sauteed veggies to your chickpea mixture, then add catsup and  egg.\n6. Stir to fully incorporate and roll mixture into f our balls.\n7. To shape your burgers, cup each ball in your hand s and squeeze tightly, rotating as you gently, \nbut firmly, press it into a disc using your thumb.\n8. To help the burgers set, cover and refrigerate.\nREADY TO EAT?\n1. Pour a tablespoon or two of oil in a skillet and heat to medium-high, so the burgers sizzle when \nyou add them to the pan!\n2. Cook for a few minutes on each side until you're left with a golden crust. and a warm center.",
    "preview": "Buffalo Chickpea Veggie Burgers (Modified) http://peasandcrayons.com/2016/09/buffalo-chickpea- veggie-burgers.html Total 25 mins Ingredients •3/4 cup old-fashioned rolled oats •1/2 (15 oz) can of...",
    "size": 28459
  },
  {
    "id": 15,
    "filename": "homemade_veggie_burger.txt",
    "file_path": "recipes/015_homemade_veggie_burger.txt",
    "type": "text",
    "content": "HOMEMADE VEGGIE BURGER\n\nComplete Idiot’s Guide® to Grilling\nby Don Mauer\n\nServes: 6\nPrep time: 20 minutes\nCook time: 11 to 12 minutes\nServing size: 1 hamburger\n\n\nIngredients\n• 1 TB. vegetable oil, plus additional for brushing on burgers and grill\n• 1/2 cup diced yellow (not sweet) onion\n• 2 cups (or 1 15-oz.] can) cooked black beans, drained and rinsed\n• 2 cups shredded Monterey Jack cheese\n• 1 cup cooked brown rice \n• 1 1/2 cups fresh breadcrumbs\n• 1/2 cup chopped green onion, white and green parts\n• 1 1/2 tsp. tomato paste\n• 1 tsp. soy sauce\n• 1 1/2 tsp. garlic powder\n• 1 1/2 tsp. dried oregano, crumbled or 1 TB. fresh oregano leaves, chopped fine\n• 1/4 to 1/2 tsp. ground cayenne \n• 1 tsp. ground cumin\n• 1/2 tsp. fresh-ground black pepper\n• 6 whole grain, whole-wheat hamburger buns\n• Ketchup\n• Yellow mustard\n• Sweet relish\n• Bottled horseradish\n• Lettuce\n• Ripe tomato slices\n\n\nDirections\n1. Heat oil in a skillet over medium-high heat. Add onion and cook 5 to 6 minutes, stirring occasionally, until lightly browned. Transfer onion to a large mixing bowl.\n\n2. To onion, add black beans, Monterey Jack cheese, rice, breadcrumbs, green onion, tomato paste, soy sauce, garlic powder, oregano, cayenne, cumin, and pepper. Mix well, mashing beans with a fork (or a potato masher, if you have one).\n\n3. Working with clean hands or a burger press, mold burgers into 6 patties. Cover and chill.\n\n4. Fire up the grill:\nFor a charcoal grill: Open the bottom vents. Ignite 6 quarts or 2 1/2 pounds charcoal briquettes or hardwood charcoal. When the coals are hot, set up for a one-level medium-heat fire (so you can hold your hand 5 inches above the cooking rack for only 4 to 5 seconds).\nFor a gas grill: Turn each burner to high and ignite. Cover the grill. When hot, set the burners to medium heat.\n\n5. Brush tops of burgers with oil.\nOn a charcoal grill: Brush the grill rack with oil. Grill burgers, oiled side down, uncovered, 4 minutes. Brush tops of burgers with oil, turn burgers, and grill 4 more minutes or until golden. \nOn a gas grill: Brush the grill rack with oil. Grill burgers, oiled side down, uncovered, 4 or 5 minutes. Brush tops of burgers with oil, turn burgers, and grill 4 or 5 more minutes or until golden.\n\n6. While burgers grill, toast cut sides of buns on grill for about 3 or 4 minutes. Place burgers on bottom of buns and serve, passing ketchup, mustard, relish, horseradish, lettuce and tomato slices.\n\nVariation: For an extra flavor kick, substitute an equal amount of shredded processed cheddar or processed Swiss cheese for the Monterey Jack cheese.\n\nNotes: It your veggie burgers don't stick together well, mix in 2 tablespoons water and try to form another patty These burgers stay formed better if they're refrigerated, covered, for at least 30 minutes before they head to the grill.",
    "preview": "HOMEMADE VEGGIE BURGER Complete Idiot’s Guide® to Grilling by Don Mauer Serves: 6 Prep time: 20 minutes Cook time: 11 to 12 minutes Serving size: 1 hamburger Ingredients • 1 TB. vegetable oil, plus...",
    "size": 2923
  },
  {
    "id": 16,
    "filename": "zucchini_patties.txt",
    "file_path": "recipes/016_zucchini_patties.txt",
    "type": "text",
    "content": "Zucchini Patties\n\nINGREDIENTS\n\n    * 2 cups grated zucchini\n    * 2 eggs, beaten\n    * 1/4 cup chopped onion\n    * 1/2 cup all-purpose flour\n    * 1/2 cup grated Parmesan cheese\n    * 1/2 cup shredded mozzarella cheese\n    * salt to taste\n    * 2 tablespoons vegetable oil\n\nDIRECTIONS\n\n   1. In a medium bowl, combine the zucchini, eggs, onion, flour, Parmesan cheese, mozzarella cheese, and salt. Stir well enough to distribute ingredients evenly.\n   2. Heat a small amount of oil in a skillet over medium-high heat. Drop zucchini mixture by heaping tablespoonfuls, and cook for a few minutes on each side until golden.\n\nThe liquid from the zucchini absolutely needs to be squeezed out to make this work--otherwise it will be much too runny. Here is what I did: used 3 eggs instead of 2 (i had a bit more onion and zucchini than what was called for), added 3 cloves of pressed garlic, a 1/2 tsp. of red pepper flakes, 3/4 to a full cup of italian seasoned bread crumbs, and 1/2 c. of cheddar (on top of the other cheeses). Also, I lessened the amount of flour to maybe 1/4 c. Lastly, I sprinkled the patties with bread crumbs before frying.",
    "preview": "Zucchini Patties INGREDIENTS * 2 cups grated zucchini * 2 eggs, beaten * 1/4 cup chopped onion * 1/2 cup all-purpose flour * 1/2 cup grated Parmesan cheese * 1/2 cup shredded mozzarella cheese * salt...",
    "size": 1159
  },
  {
    "id": 17,
    "filename": "Naan Bread.pdf",
    "file_path": "recipes/017_Naan_Bread.pdf",
    "type": "pdf",
    "content": "7/16/23, 12:32 PM Best Gluten F ree Naan Br ead (No -Yeast, No -Yogurt, Dairy -Free) - Dish by Dish\nhttps://www .dishbydish.net/easy -gluten-fr ee-naan-br ead-no -yeast-dairy -free/print/20695/ 1/3\neasy gluten free naan bread (no-yeast,no-yogurt, dairy-free)\n★ ★ ★ ★\n4.9 from 18 reviews\nAuthor: felicia | Dish by Dish  Total Time:  30 minutes\nYield: 8 pieces of naan 1x Diet: Gluten Free\nSoft and tender with a chewy interior , this super easy gluten-free naan bread recipe is ready in just 30\nminutes . Flavored with parsley and garlic for aroma and taste, it’ s totally yeast-free, gluten-free , and dairy-free  (no yogurt required!), but it’ s\nso good no one would care! Make a fresh batch of this delicious naan and eat it as a side dish  or appetizer  (with this delicious slow cooker\nlentil curry, alongside our popular creamy hummus , baba ganoush , or even on its own)!\nINGREDIENTS\nUNITS US MSCALE1x 2x 3x\nINSTRUCTIONS★\n1 cup gluten-free all-purpose flour\n1/2 teaspoon  xanthan gum  (omit if your gluten-free flour blend already includes it)\n1/2 cup tapioca starch , plus more as needed\n2 teaspoons  baking powder\n1 teaspoon  salt\n1 egg\n1/4 cup warm water, plus more as needed\n1 tablespoon  extra virgin olive oil , plus more for brushing\n1/4 cup fresh minced garlic, optional\n1/4 cup fresh chopped parsley, optional\n1. Combine Dry Ingredients:  Combine all the dry ingredients (gluten-free all-purpose flour, xanthan gum\n(if using), tapioca starch, baking powder, and salt) in a large mixing bowl.\n2. Whisk Wet Ingredients:  In a medium bowl, whisk the egg, warm water, and olive oil together until\ncombined.\n3. Mix Wet and Dry Ingredients to Get Dough:  Pour the wet mixture bit by bit into the bowl with the dry\ningredients and mix with a spoon until you get a soft, pliable dough ball. (If the dough is too dry,\nadd a sprinkle of warm water at a time, and knead until pliable. If the dough is too wet, add a\nsprinkle of tapioca starch until dough is no longer too sticky to handle). \n4. Shape Dough into Round Disc:  Use gluten-free floured hands to shape the dough ball into a round\ndisc.\n5. Cut Dough into Portions:  Cut the round dough disc into 8 equal portions as you would a pizza. \n6. Flatten Dough:  Flatten each dough portion with your fingers or a rolling pin on a floured surfact\nuntil each piece of dough is roughly 1/8-inch thick. You want the dough to be as thin as possible\nwithout breaking so the naan doesn’t get too thick. \n7. Prepare Garlic-Parsley Mixture:  If using garlic and parsley, mix the fresh garlic and parsley\ntogether in a small bowl, and press around 1 teaspoon of garlic-parsley mix evenly on both sides of\neach piece of flattened dough.\n7/16/23, 12:32 PM Best Gluten F ree Naan Br ead (No -Yeast, No -Yogurt, Dairy -Free) - Dish by Dish\nhttps://www .dishbydish.net/easy -gluten-fr ee-naan-br ead-no -yeast-dairy -free/print/20695/ 2/3NOTES\nS e r v e s  4\nS e r v i n g  S i z e :  2  n a a n\nC a l o r i e s  P e r  S e r v i n g :  2018. Heat Cast Iron Skillet:  Heat a cast iron skillet  over high heat and once hot, brush the skillet with\nolive oil.\n9. Cook: Place a piece of flattened dough in the middle of the skillet and let it cook for\napproximately 40 seconds until air bubbles start to form at the surface of the dough and the bottom\nstarts to char slightly. Brush the top of the dough with olive oil, flip it over, and let it cook\nfor another 40 seconds before removing it from the skillet and placing it on a plate and covering it\nwith a kitchen towel. \n10. Repeat Until All Dough is Used:  Repeat until all the naan is cooked and serve warm.\nGluten-Free All-Purpose Flour: I recommend using a good-quality gluten-free all-purpose flour blend  that is made of a mix of lighter\nflours/starches (such as rice flour , tapioca starch, corn starch or potato starch) to ensure a fluf fier texture. I do NOT  recommend using a flour\nblend with heavier flours such as garbanzo bean flour as that will result in a denser texture.\nXanthan Gum: Xanthan gum  is a replacement for gluten in gluten-free baked goods, and helps to bind the ingredients together . If your\ngluten-free flour blend does not include xanthan gum, make sure to add it in.\nTapioca Starch:  You can substitute tapioca starch  for the same amount of cassava flour or arrowroot starch. Basically this starch is\nnecessary to give the naan bread a chewy texture.\nBaking Powder : I recommend using aluminium-free baking powder  to prevent any “metallic” taste that may be present especially when\nmaking a recipe that requires baking powder in high quantities to give it the yeast-free rise. If you are Celiac or intolerant/allergic to gluten,\nmake sure you use certified gluten-free baking powder .\nEgg:  The egg in this recipe helps to bind the ingredients together . I personally haven’t tried making this gluten-free naan recipe without the\negg, but if you are vegan or allergic to eggs, you can try using aquafaba or a flax egg.\nWater: You may substitute the water for the same amount of non-dairy milk (such as my 5-minute cashew milk  or my easy homemade\nalmond milk ). Alternatively , if you’re not lactose-intolerant, feel free to go ahead and use normal dairy milk.\nOlive Oil:  I like the taste that extra virgin olive oil  imparts to the naan, but if you don’t have olive oil (or simply prefer not to use it), you can\nuse other oils such as sunflower oil or avocado oil instead.\nCast Iron Skillet : I believe using a cast iron skillet  will yield the best results, as cast iron mains high heat well and for a long time. However ,\nif you don’t own a cast iron skillet, simply make sure to heat up your skillet very well before cooking the naan.\nStoring/Freezing:  To store, place the cooled naan in an airtight container  and store in the refrigerator for up to 3 days. To freeze, place the\ncooled naan in a freezer-safe container or ziplock bag and freeze for up to 2 months. Let frozen naan thaw completely overnight in the\nrefrigerator before heating it up and serving.\nThis recipe was originally posted in May 2020 but has since been updated to include ingredient photos, ingredient notes and substitutions,\nas well as clearer step-by-step instructions. \nAdapted from: Tea for T urmeric \n7/16/23, 12:32 PM Best Gluten F ree Naan Br ead (No -Yeast, No -Yogurt, Dairy -Free) - Dish by Dish\nhttps://www .dishbydish.net/easy -gluten-fr ee-naan-br ead-no -yeast-dairy -free/print/20695/ 3/3Find it online : https://www .dishbydish.net/easy-gluten-free-naan-bread-no-yeast-dairy-free/\nRecipe Card powered by",
    "preview": "7/16/23, 12:32 PM Best Gluten F ree Naan Br ead (No -Yeast, No -Yogurt, Dairy -Free) - Dish by Dish https://www .dishbydish.net/easy -gluten-fr ee-naan-br ead-no -yeast-dairy -free/print/20695/ 1/3...",
    "size": 219069
  },
  {
    "id": 18,
    "filename": "Gluten-Free Pizza Crust Recipe _ King Arthur Baking.pdf",
    "file_path": "recipes/018_Gluten-Free_Pizza_Crust_Recipe___King_Arthur_Baking.pdf",
    "type": "pdf",
    "content": "Ingredients\n*Substitute our 1 1/2 cups\n(150g) Gluten-Free '00' Pizza Flour\nand omit the xanthan gum.Instructions\nGluten-Free Pizza Crust\nGluten-free pizza lovers, rejoice! Your days of eating sad, flavorless pizza\n(or foregoing it altogether) are over. This easy-to-mix batter-like dough\nbakes up into a crisp and chewy crust. It's a wonderful base for your\nfavorite toppings. \n\nPREP\n15 minsBAKE\n18 to 25 minsTOTAL\n1 hr 48 minsYIELD\none 9\" to 12\"\npizza\n1 1/2 cups (234g) King Arthur\nGluten-Free All-Purpose Flour*\n2 tablespoons (18g) buttermilk\npowder or 2 tablespoons (14g)\nnonfat dry milk\n1 teaspoon baking powder\n3/4 teaspoon table salt\n1 teaspoon xanthan gum\n1 1/2 teaspoons instant yeast\n1 tablespoon granulated sugar or\nhoney, optional\n1 cup (227g) water, warm\n1/4 cup (50g) olive oil, dividedWeigh your flour; or measure it by gently spooning it into a cup, then\nsweeping off any excess. Place the dry ingredients (except the yeast\nand sugar or honey, if you're using it) into a large mixing bowl; the\nbowl of your stand mixer is perfect. Mix until thoroughly blended.1\nPlace the sugar or honey (if you're using it), warm water, 2\ntablespoons (25g) olive oil, yeast, and about 1/2 cup (78g) of the dry\nmixture into a small bowl. Stir to combine; a few lumps are OK. Set\naside for 30 minutes or so, until the mixture is bubbly and smells\nyeasty.2\nAdd this mixture to the dry ingredients, and beat on medium-high\nspeed for 4 minutes. The mixture will be thick and sticky; if you've\never applied spackling compound to a wall, that's exactly what it'll\nlook and feel like. Note: You must use a stand mixer or electric hand\nmixer to make this dough; mixing by hand doesn't do a thorough enough\njob.3\nCover the bowl, and let the dough rest for 30 minutes or so. 4\nPreheat the oven to 425°F. 5\nDrizzle 2 tablespoons (25g) olive oil onto the center of a baking\nsheet or 12\" round pizza pan. Scrape the dough from the bowl onto\nthe puddle of oil.6\nUsing your wet fingers, start at the center of the dough and work\noutwards, pressing it into a 12\" to 14\" circle.7\nLet the dough rest, uncovered, for 15 minutes. 8\nBake the crust for 8 to 10 minutes, just until it's set; the surface will\nlook opaque, rather than shiny.9\nRemove from the oven and top with whatever you like. Return to the\noven to finish baking, about 10 to 15 minutes depending on the\ntoppings you've chosen.10\nRemove from the oven, and serve warm. 112/9/25, 1:33 PM Print Recipe | King Arthur Baking\nhttps://www.kingarthurbaking.com/recipes/gluten-free-pizza-crust-recipe 1/2\nTips from our Bakers\nWe're here to help. King Arthur Baker's Hotline: (855) 371 2253To bake your pizza on a pizza or baking stone: Place the stone on the\ncenter rack of the oven and preheat the oven to 425°F. Drizzle 2\ntablespoons olive oil onto the center of a half-sheet piece of\nparchment paper (about 12” x 16”). Scrape the dough from the bowl\nonto the oil and paper. Using wet fingers, press the dough into a 12”\ncircle, starting at the center and working out. Let the dough rest,\nuncovered, for 15 minutes. Bake crust for 8 to 10 minutes, just until\nset. Remove it from the oven and add toppings. Return it to the oven\nfor another 10 to 15 minutes, until the toppings are cooked to the\ndesired doneness.\nMake your crust thin, thick, or deep dish: see our blog post for\ninstructions.\nWant to experiment with different cheeses beyond the standard\nmozzarella? Choose those that melt well: Fontina, cheddar, Jack,\nprovolone, brick, Gouda, and Muenster are all good candidates.\nBe aware: Some of your baking ingredients can be a hidden source of\ngluten. Learn more at our blog post: For gluten-free baking, think\nbeyond just flour. For additional information on King Arthur-\nproduced products, read the complete details of our allergen\nprogram, including our contact-prevention practices.2/9/25, 1:33 PM Print Recipe | King Arthur Baking\nhttps://www.kingarthurbaking.com/recipes/gluten-free-pizza-crust-recipe 2/2",
    "preview": "Ingredients *Substitute our 1 1/2 cups (150g) Gluten-Free '00' Pizza Flour and omit the xanthan gum.Instructions Gluten-Free Pizza Crust Gluten-free pizza lovers, rejoice! Your days of eating sad,...",
    "size": 1670179
  },
  {
    "id": 19,
    "filename": "zucchini_casserole_more.txt",
    "file_path": "recipes/019_zucchini_casserole_more.txt",
    "type": "text",
    "content": "Love this.! I switched it up a bit (and thanks to all of the people who gave me all of the great ideas!). I added the following (because I had it on hand): 1/2 (of each) red, yellow and orange bell pepper, chopped, fresh spinach (handful), fresh basil (2 Tablespoons), fresh Italian parsley (2-3 tablespoons), 3/4 cup of cherry tomatoes quartered, sauteed 1/2 red onion and two big garlic cloves in a little olive oil, used light sour cream instead of the oil (1/2-3/4 cup), sprinkled it with some olive oil, used Heart Smart Bisquick, egg beaters, salt, pepper, Italian seasoning, baked it for 45-50 minutes in 350-degrees using a glass pyrex dish (10X13, I think). It looks beautiful and tastes really great! What a wonderful way to get a bunch of healthy veggies in your diet.\n",
    "preview": "Love this.! I switched it up a bit (and thanks to all of the people who gave me all of the great ideas!). I added the following (because I had it on hand): 1/2 (of each) red, yellow and orange bell...",
    "size": 781
  },
  {
    "id": 20,
    "filename": "spicy tomato sauce.txt",
    "file_path": "recipes/020_spicy_tomato_sauce.txt",
    "type": "text",
    "content": "For the spicy tomato sauce\n\n300ml passata\n\n2 small chilli, finely chopped\n\n2 tbsp soy sauce\n\n2 tbsp maple syrup\n\n1 tbsp oil\n\n1/2 tsp cornstarch (diluted in 3 tbsp water)\n\nTo make the spicy tomato sauce\n\nHeat the oil in a frying pan over a medium heat. Once hot, fry the chilli for one minute.\n\nReduce the heat and add the passata. Bring the heat back to medium and cook for about five minutes.\n\nPour in the soy sauce and maple syrup, then cook for three more minutes, stirring regularly.\n\nAdd the diluted cornstarch and mix to combine. Cook for about two minutes or until the mixture has thickened.\n",
    "preview": "For the spicy tomato sauce 300ml passata 2 small chilli, finely chopped 2 tbsp soy sauce 2 tbsp maple syrup 1 tbsp oil 1/2 tsp cornstarch (diluted in 3 tbsp water) To make the spicy tomato sauce Heat...",
    "size": 599
  },
  {
    "id": 21,
    "filename": "Spicy Baked Macaroni and Cheese.pdf",
    "file_path": "recipes/021_Spicy_Baked_Macaroni_and_Cheese.pdf",
    "type": "pdf",
    "content": "Healthy Living Market \n222 Dorset St, So. Burlington, VT Get Directions \nwe're open from 8am – 9pm 7 days a week 802–863–2569 \nSales \nCatering \nDepartments \nBody Care \nBread \nCheese \nGrocery \nHousewares \nMeat & Seafood \nProduce \nVitamins & Herbs \nWine & Beer \nCafé \nEvents \nLearning Center \nRecipes \nBlog \nShop Online \nHealthy Living To Go \nGift Cards \nEmail Address: \nSpicy Baked Macaroni and Cheese \nIngredients: \n1 lb. elbow macaroni \n1 large onion; medium dice \n1 tbsp. vegetable oil \n3 cloves fresh garlic; minced \n1 tbsp. chili powder Spicy Baked Macaroni and Cheese | Healthy Living Ma rket and Cafe | S... file:///N:/Recipes/Spicy Baked Macaroni and Cheese   Healthy Living M... \n1 of 3 1/22/2015 5:19 PM\n\n1 tsp. cumin \n½ tsp. coriander \n1 tsp. paprika \n¼ tsp. cayenne pepper \n1 tsp. oregano \n1 stick butter; 3 tbsp. and 5 tbsp. divided \n¼ cup all purpose flour \n1 cup milk \n1 ½ cups half and half \n2 cups green chiles \n5 cups cheddar cheese; shredded \n2 tsp. salt \n1 tsp. freshly ground black pepper \n1 ½ cups panko bread crumbs \n \nDirections: \nPreheat oven to 350 degrees and prepare a baking dish by lightly greasing. In a large stock pot, cook pasta in\nboiling salted water until al dente. Drain and toss with a small amount of oil to prevent s ticking. In a large straight \nsided sauté pan, sweat onions in oil until tender. Add garlic and other spices and cook until very f ragrant. Add 3 \ntbsp. butter to pan and cook until foamy. Stir in flour to create a roux, stirring frequently, until  sandy in texture \nand barely browned. Whisk a small amount of milk into the pan and continue whisking until all milk and hal f and \nhalf are incorporated. Bring to a simmer, and cook until thickened, stirring often to prevent s corching. Remove \nfrom heat and stir in cheese. Once the cheese melts, combine with green chiles and cooke d pasta. Season with salt \nand pepper. Taste and adjust seasoning if needed. Pour evenly into prepared baking dish and top with rema ining \nsmall pats of butter and then sprinkle on breadcrumbs. Tightly wrap baking dish in foil, and bake at 350 degre es \nfor 25 minutes or until heated through and starting to bubble at the sides. Uncover dish, and return to oven for a n \nadditional 10-15 minutes or until browned. A broiler on high heat can also be used to brown the topping. \nSearch Recipes \n \nBrowse Recipes by Category \n    Spicy Baked Macaroni and Cheese | Healthy Living Ma rket and Cafe | S... file:///N:/Recipes/Spicy Baked Macaroni and Cheese   Healthy Living M... \n2 of 3 1/22/2015 5:19 PM\n\nHome \nEmployment \nAbout Us \nTerms & Conditions \nContact Us \nCommunity Outreach \nFacebook \nTwitter \nstaff  ©2009-2011 Healthy Living Market All Rights Reserved. website development by Original Gravity Media \nAuthorize.Net \nMerchant - Click to \nVerify \nOnline Payments Spicy Baked Macaroni and Cheese | Healthy Living Ma rket and Cafe | S... file:///N:/Recipes/Spicy Baked Macaroni and Cheese   Healthy Living M... \n3 of 3 1/22/2015 5:19 PM\n",
    "preview": "Healthy Living Market 222 Dorset St, So. Burlington, VT Get Directions we're open from 8am – 9pm 7 days a week 802–863–2569 Sales Catering Departments Body Care Bread Cheese Grocery Housewares Meat &...",
    "size": 83959
  },
  {
    "id": 22,
    "filename": "Fried Eggplant Recipe.pdf",
    "file_path": "recipes/022_Fried_Eggplant_Recipe.pdf",
    "type": "pdf",
    "content": "Fried Eggplant\nBy Lidey Heuck\nUpdated Aug. 27, 2024\nChristopher Testani for The New York Times. Food\nStylist: Simon Andrews.Total Time 45 minutes\nPrep Time 5 minutes\nCook Time 40 minutes\nRating (36)\nI N G R E D I E N T S\nYield:6 servings (20 slices)\n1 large globe eggplant, sliced into\n¼-inch-thick rounds (about 1¼\npounds)\nKosher salt (such as Diamond\nCrystal) and black pepper\n½ cup all-purpose flour\n2 large eggs\n3 cups panko bread crumbs\n2 teaspoons Italian seasoning\n1½ teaspoons garlic powder\n1 cup canola oil, for frying\nChopped fresh parsley, for serving\nMarinara sauce, for dipping\n(optional)P R E P A R A T I O N\nStep 1\nPlace the eggplant slices in a large bowl, sprinkle with 1\nteaspoon salt and toss to evenly coat. Set aside for 10 to 20\nminutes, then use a clean dish towel or paper towels to pat\neach slice dry, absorbing any water that has been released.\nStep 2\nM eanwhile, place the flour in a shallow bowl or rimmed plate.\nCrack the eggs into a second bowl and beat them with a fork.\nIn a third bowl, combine the panko, Italian seasoning, garlic\npowder, 1½  teaspoons salt and 1 teaspoon pepper.\nStep 3\nW orking one at a time, dip the eggplant rounds into the flour,\nshaking off any excess, then into the egg mixture, and finally,\ninto the panko mixture, coating each piece completely. Place\non a paper towel lined plate until ready to cook.\nStep 4\nThese crispy breaded eggplant rounds make a delicious appetizer served with marinara sauce for\ndipping. The key to tender, creamy eggplant with a crisp, crunchy coating is slicing the eggplant thinly\nand salting it to draw out excess moisture before breading. Coated in seasoned panko, the eggplant\nrounds cook in under 3 minutes, meaning you can fry the whole batch in under 15 minutes and serve\nthe rounds piping hot. If youʼre planning ahead, you can also bread the eggplant slices and refrigerate\nthem on a paper towel lined plate for several hours before frying.\nPour the oil into a large, heavy-bottomed skillet or Dutch oven\nand heat over medium-high. W hen the oil is hot (it should\nsizzle immediately if you drop a breadcrumb into the pan),\ncarefully place a few eggplant slices in the pan. Adjust heat to\nmedium and cook for 1 to 2 minutes on each side, until golden\nbrown on both sides.\nStep 5\nTransfer to the prepared plate, sprinkle lightly with salt and\nrepeat with the remaining eggplant, adjusting the heat as\nnecessary to prevent smoking. Sprinkle the eggplant with\nparsley and serve hot, with marinara sauce for dipping if you\nlike.\nPrivate Notes\nLeave a Private Note on this recipe and see it here.",
    "preview": "Fried Eggplant By Lidey Heuck Updated Aug. 27, 2024 Christopher Testani for The New York Times. Food Stylist: Simon Andrews.Total Time 45 minutes Prep Time 5 minutes Cook Time 40 minutes Rating (36)...",
    "size": 1063774
  },
  {
    "id": 23,
    "filename": "Chana Masala - Love and Lemons.pdf",
    "file_path": "recipes/023_Chana_Masala_-_Love_and_Lemons.pdf",
    "type": "pdf",
    "content": "1/16/24, 4:36 PM Chana Masala - Love and Lemons\nhttps://www.loveandlemons.com/?p=72293 1/2\nChana Masala\nPrep Time: 15 mins\nCook Time: 40 mins\nTotal Time: 55 mins\nServes 4\nThis easy chana masala recipe is a healthy, satisfying vegan meal! Serve the ﬂavorful chickpea curry over\nrice or scoop it up with warm naan.\nIngredients\nInstructions2 tablespoons extra-virgin olive oil\n1 medium yellow onion, chopped\n1 teaspoon cumin seeds\n1 teaspoon garam masala\n½ teaspoon ground coriander\n½ teaspoon ground turmeric\n¼ teaspoon ground cardamom\nPinch of cayenne pepper\n2 garlic cloves, grated\n½ teaspoon grated fresh ginger\nHeaping 1 teaspoon sea salt\n½ cup water\n1 (28-ounce) can whole peeled tomatoes\n3 cups cooked chickpeas, drained and rinsed\n½ cup chopped fresh cilantro, plus more for serving\n1 teaspoon fresh lemon juice, plus more for serving\nCooked brown rice or white rice, for serving\nWhole milk Greek yogurt, for serving\n1. Heat the olive oil in a large skillet over medium heat. Add the onion and cook for 8 minutes,\nstirring often, or until soft and well browned.\n2. Reduce the heat to medium-low and add the cumin seeds, garam masala, coriander, turmeric,\ncardamom, and a pinch of cayenne. Stir and cook for 30 seconds, or until fragrant. Stir in the\ngarlic, ginger, salt, and ¼  cup of the water.\n3. Add the tomatoes, breaking them apart with your hands as you add them or crushing them with\na wooden spoon in the skillet. Bring to a simmer and cook for 8 to 10 minutes, or until the sauce\nthickens. Add the chickpeas and the remaining ¼  cup water, stir, and simmer for 20 to 25\nminutes, stirring occasionally, or until thick. Stir in the cilantro and lemon juice.\n4. Serve over rice with dollops of Greek yogurt, more cilantro, and more lemon juice, if desired.\n1/16/24, 4:36 PM Chana Masala - Love and Lemons\nhttps://www.loveandlemons.com/?p=72293 2/2Find it online at https:/ /www .lo v eandlemons.com/?p=72293",
    "preview": "1/16/24, 4:36 PM Chana Masala - Love and Lemons https://www.loveandlemons.com/?p=72293 1/2 Chana Masala Prep Time: 15 mins Cook Time: 40 mins Total Time: 55 mins Serves 4 This easy chana masala...",
    "size": 943018
  },
  {
    "id": 24,
    "filename": "5 minutes Vegan Burger Sauce - Sandhya's Kitchen.PDF",
    "file_path": "recipes/024_5_minutes_Vegan_Burger_Sauce_-_Sandhya's_Kitchen.PDF",
    "type": "pdf",
    "content": "5 minutes Vegan Burger Sauce\nThis 5 minutes Burger sauce elevates the ﬂavors of a dish to just another level.\nServe this Vegan sauce in your burger, sandwich, wrap or even as a dipping sauce\nfor hashbrowns, chips or anything you fancy. The sauce is so good, you will not\nrealise it is Vegan!\n5mins 5mins\nAppetizer British vegan burger sauce\n8 40kcal Sandhya Hariharan\nIngredients\nInstructions\nNutrition\nCalories: 40kcal | Carbohydrates: 2.3g | Protein: 0.1g | Fat: 3.5g | Sodium: 263mg | Potassium: 21mg |\nFiber: 0.1g | Sugar: 1g | Calcium: 2mg\nTried this recipe?\nMention @sandhyaskitchen and hashtag #sandhyaskitchen\nPrep Time\nTotal Time\nCourse: \nCuisine: \nKeyword: \nServings: \nCalories: \nAuthor: ½CupVegan Mayonnaise\n2TbspTomato Ketchup\n1TspHot Sauce\n1TbspPickle Juice or Jalapeno Juice\n1TspMustard\nYellow or Dijon\n½TspGarlic Powder\n¼-½TspSalt\n½TspGround Black Pepper\n½TspOnion Powder\nOptional\n1. Gather Ingredients -In a small bowl, add all the ingredients together.\n2. Combine -Mix well using a fork or use a whisk. Serve!\n3. Store -Transfer any leftover sauce into a mason jar and store in the refrigerator. It stores well\nfor up to 5 days.\n5 from 10 votes",
    "preview": "5 minutes Vegan Burger Sauce This 5 minutes Burger sauce elevates the ﬂavors of a dish to just another level. Serve this Vegan sauce in your burger, sandwich, wrap or even as a dipping sauce for...",
    "size": 898419
  },
  {
    "id": 25,
    "filename": "Creamy Baked Ziti - Printer Friendly - Allrecipes.pdf",
    "file_path": "recipes/025_Creamy_Baked_Ziti_-_Printer_Friendly_-_Allrecipes.pdf",
    "type": "pdf",
    "content": "Prep \n20  m Cook \n20  m Ready In \n40  m Creamy Baked Ziti \nRecipe By: Kraft \n\"Ziti pasta bakes with layers of creamy tomato sauc e and mozzarella cheese in an easy and comforting d ish that's ready in less than an hour.\" \nIngredients 4 cups ziti pasta, uncooked 1 (26 ounce) jar marinara sauce 1 (14.5 ounce) can diced tomatoes, undrained 6 ounces PHILADELPHIA Cream Cheese, cubed 3/4 cup BREAKSTONE'S or KNUDSEN Sour Cream 1 (8 ounce) package KRAFT Shredded Mozzarella Chees e with a TOUCH OF \nPHILADELPHIA 1/3 cup KRAFT Grated Parmesan Cheese \nDirections \nHeat oven to 375 degrees F. Cook pasta in large saucepan as directed on package , omitting salt. Remove from pan; drain. Meanwhile,  add marinara sauce, tomatoes and cream cheese to \nsame pan; cook on medium heat 5 min. or until cream  cheese is melted and mixture is well blended, stir ring frequently. Return pasta to pan; mix well. \nLayer half the pasta mixture in 13x9-inch baking di sh; cover with layers of sour cream, 1 cup mozzarel la and remaining pasta mixture. Top with remaining \nmozzarella and Parmesan. Bake 20 min. or until heated through. \nALL RIGHTS RESERVED © 2017 Allrecipes.com Printed From Allrecipes.com 3/6/2017 \n12 3 4Philadelphia Cream Cheese Regular \n2 For $5.00 - expires in 5 days \nMeijer \n7240 W Central Ave TOLEDO, OH 43617 \nCreamy Baked Ziti - Printer Friendly - Allrecipes.c om http://allrecipes.com/recipe/219845/creamy-baked-zi ti/print/?recipeType=Recipe&servings=8\n1 of 1 3/6/2017 5:33 PM",
    "preview": "Prep 20 m Cook 20 m Ready In 40 m Creamy Baked Ziti Recipe By: Kraft \"Ziti pasta bakes with layers of creamy tomato sauc e and mozzarella cheese in an easy and comforting d ish that's ready in less...",
    "size": 61745
  },
  {
    "id": 26,
    "filename": "Fried Apples - One Dish Kitchen.PDF",
    "file_path": "recipes/026_Fried_Apples_-_One_Dish_Kitchen.PDF",
    "type": "pdf",
    "content": "Fried Apples\nThis fried apples recipe comes together in just one pan and takes only 15\nminutes to make. Tender apple slices are pan-fried to perfection with butter\nand cinnamon, creating a delicious side dish, dessert, or ice cream topping.\n5mins 15mins 20mins\nBreakfast, Dessert, Side Dish American\nGluten Free, Low Salt, Vegetarian\napples, cinnamon fried apples, fried apples, small batch fried apples\n2servings Joanie Zisk\nEquipment\nIngredients\nInstructions\nNotes\nPeeling the Apples: Peel them for a smoother texture, or leave the skin on if you prefer. Both\nwork well.\nPreventing Browning: Slice apples just before cooking or toss them with lemon juice to keep\nthem fresh-looking.\nMaking More: Double the ingredients for a larger batch.\nNutrition\nServing: 1serving | Calories: 251kcal | Carbohydrates: 29g | Protein: 1g | Fat: 17g | Saturated Fat: 11g |\nTrans Fat: 1g | Cholesterol: 45mg | Sodium: 155mg | Potassium: 158mg | Fiber: 3g | Sugar: 25g | Vitamin\nPrep Time\nCook Time\nTotal Time\nCourse: \nCuisine: \nDiet: \nKeyword: \nServings: \nAuthor: 10-inch skillet\n2cupssliced or chopped apples\n(about 2 medium-sized apples)\n1teaspoonlemon juice\n3tablespoonssalted butter\n2tablespoonsbrown sugar\n½teaspoonground cinnamon\n⅛teaspoonground nutmeg\n1. Peel, core, and slice the apples. Place them in a bowl and toss with lemon juice to prevent\nbrowning.\n2. Melt butter in a 10-inch skillet over medium heat.\n3. Stir in brown sugar and spices, cooking for 30 seconds.\n4. Add apples and stir to coat.\n5. Cook for 12-15 minutes, stirring occasionally, until the apples soften. Cooking time varies based\non slice size.\n6. Remove from heat and serve warm.\n5 from 20 votes\nA: 593IU | Vitamin C: 7mg | Calcium: 23mg | Iron: 1mg\nQR code\nScan this QR code with your phone's camera to view this recipe on your mobile device.\nAdvertisements will not show up when recipe is printed.",
    "preview": "Fried Apples This fried apples recipe comes together in just one pan and takes only 15 minutes to make. Tender apple slices are pan-fried to perfection with butter and cinnamon, creating a delicious...",
    "size": 306471
  },
  {
    "id": 27,
    "filename": "cornbread using flax egg.pdf",
    "file_path": "recipes/027_cornbread_using_flax_egg.pdf",
    "type": "pdf",
    "content": "Ingredients\n1 flax egg (1 tbsp Flaxseed / 3 tbsp of W ater\n1 ¼ cup unsweetened plain almond milk\n3 teaspoons apple cider vinegar\n1 cup all-purpose flour or 1:1 gluten-free all-purpose flour\n1 cup fine yellow cornmeal\n½ teaspoon baking soda\n2 teaspoons baking powder\n½ teaspoon sea salt\n⅓ cup cane sugar or coconut sugar\n⅓ cup vegan butter , melted (or oil), plus more for serving\nInstructions\n1. Preheat the oven to 375 degrees F .\n2. Grease a 8×8 inch pan with nonstick cooking spray or vegan butter .\n3. Prepare flax egg in a small bowl and let set for a few minutes to gel up.\n4. Prepare flax egg in a small bowl and let set for a few minutes to gel up.\n5. In a large bowl combine flour , cornmeal, baking soda, baking powder and salt\ntogether\n6. In the same container as the milk mixture, add flax egg, coconut sugar and vegan\nbutter (or oil) and mix to combine.\n7. Pour the wet ingredients into the dry and mix until fully combined & smooth\n8. Pour the batter into the pan and using a spatula, smooth down the top into an\neven layer .\n9. Bake for 28-30 minutes, until a toothpick comes out clean.\n10. Let cool for at least 10-15 minutes, preferably until cool otherwise cornbread might\nbe crumbly .\n11. Slice into 9 slices, serve with vegan butter and get into that cornbread\nchyleeeeeee!!!!\nServings : 9\nReady in : 40 Minutes\nCourse : Appetizer , Sides\nRecipe Type : Dinner , Lunch , Snack\nRate this recipe\n         \n3 People Rated This Recipe2/24/25, 3:44 PM Best Vegan Cornbread Recipe Ever\nhttps://www.printfriendly.com/print?url=https://cookingwithque.com/recipe-items/best-vegan-cornbread-recipe-ever/&headerImageUrl=&hea… 2/3",
    "preview": "Ingredients 1 flax egg (1 tbsp Flaxseed / 3 tbsp of W ater 1 ¼ cup unsweetened plain almond milk 3 teaspoons apple cider vinegar 1 cup all-purpose flour or 1:1 gluten-free all-purpose flour 1 cup...",
    "size": 47275
  },
  {
    "id": 28,
    "filename": "Cauliflower Shawarma With Spicy Tahini Recipe (with Video).pdf",
    "file_path": "recipes/028_Cauliflower_Shawarma_With_Spicy_Tahini_Recipe_(with_Video).pdf",
    "type": "pdf",
    "content": "Cauliflower Shawarma With Spicy Tahini\nBy Melissa Clark\nTotal Time 45 minutes\nRating (5,981)\nINGREDIENTS\nYield:2 servings\nFOR THE CAULIFLOWER\n5 tablespoons extra-virgin olive oil,\nplus more as needed\n1¼ teaspoons ground cumin\n1¼ teaspoons sweet paprika\n¾ teaspoon fine sea or table salt,\nplus more as needed\n1 teaspoon ground coriander\n¼ teaspoon ground turmeric\n¼ teaspoon freshly ground black\npepper\nPinch of ground cayenne\n1 large head cauliflower (about 2½\npounds), trimmed and cut into bite-\nsize floretsPREPARATION\nStep 1\nArrange racks in the upper and lower thirds of your oven. Heat\noven to 425 degrees.\nStep 2\nPrepare the cauliflower: In a large bowl, whisk together olive\noil, cumin, paprika, salt, coriander, turmeric, black pepper and\ncayenne. Add cauliflower and onion, and toss until well coated.\nSpread mixture in a single layer on a rimmed baking sheet.\nStep 3\nRoast vegetables on the top oven rack until they are golden\nbrown, slightly crisp and tender, 30 to 40 minutes, stirring\nonce or twice. If the vegetables look dry as they roast, drizzle\nwith a little more olive oil.\nStep 4In this vegetarian take on shawarma, the usual spiced lamb, chicken or turkey is replaced with\ncauliflower florets and onion wedges that have been tossed with a classic combination of cumin,\npaprika and coriander, then roasted until browned, fragrant and very tender. A hot sauce-spiked tahini\nserved alongside lends creaminess and heat. To serve it, you can tuck everything into a pita or\nflatbread, or keep the bread on the side and let everyone assemble their own sandwiches at the table.\nChopped cucumber, tomatoes and olives are optional, but they add a juicy brightness to contrast with\nthe aromatic, roasted flavors. (Watch the video of Melissa Clark making cauliflower shawarma with\nspicy tahini here.)\n1 large red onion, cut into ¼-inch\nwedges\nPita or flatbread, for serving\n¼ cup coarsely chopped parsley,\nplus more for serving\nChopped tomato, cucumber and\nolives, for serving\nFOR THE SPICY TAHINI\nSAUCE\n1 tablespoon fresh lemon juice,\nplus more to taste\n1 to 2 teaspoons harissa paste or\nother hot sauce, or a large pinch of\nUrfa or Aleppo pepper, plus more to\ntaste\n1 fat garlic clove, finely grated,\npassed through a press or minced\n¼ teaspoon fine sea or table salt\n⅓ cup tahini\n⅓ cup ice water, plus more as\nneededAs they cook, prepare the tahini sauce: Whisk together lemon\njuice, 1 teaspoon harissa, garlic and salt in a small bowl, and let\nsit for a minute or two to mellow the garlic. Whisk in tahini.\nWhisk in ice water, 1 tablespoon at a time, until the sauce is\nsmooth and thin enough to drizzle. You may not need all of the\nwater or you may need to add a little more: Tahini brands vary\na lot. Taste and adjust seasoning, adding more harissa, lemon\njuice and salt if you like. The sauce should taste zippy and\ncreamy.\nStep 5\nWarm the pitas or flatbread by placing them directly on the\nbottom oven rack during the last 5 minutes as the vegetables\nroast. (Or you can warm the bread on another baking pan if\nthat’s easier for you.)\nStep 6\nScatter parsley on top of the roasted vegetables and serve with\nwarm pitas, tahini sauce, chopped tomato, cucumber and\nolives.\nPrivate Notes\nLeave a Private Note on this recipe and see it here.",
    "preview": "Cauliflower Shawarma With Spicy Tahini By Melissa Clark Total Time 45 minutes Rating (5,981) INGREDIENTS Yield:2 servings FOR THE CAULIFLOWER 5 tablespoons extra-virgin olive oil, plus more as needed...",
    "size": 74282
  },
  {
    "id": 29,
    "filename": "falafel.txt",
    "file_path": "recipes/029_falafel.txt",
    "type": "text",
    "content": "Falafel \n\nhttp://www.marthastewart.com/349175/falafel\n\nIngredients\n\n    1 3/4 cups , or 1 15.5 oz can chickpeas, drained and rinsedCooked Dried Chickpeas\n\n    2 garlic cloves, smashed\n\n    1 small yellow onion, cut into 1-inch pieces (used 1/2 onion)\n\n    1/4 cup chopped parsley (used 2 tbsp)\n\n    2 tablespoons chopped mint (omitted)\n\n    1/2 teaspoon cumin\n\n    1/2 teaspoon coriander\n\n    1/4 teaspoon cayenne (omitted)\n\n    1/4 teaspoon baking soda\n\n    3/4 teaspoon salt (used 1/4 tsp)\n\n    Juice of 1 lemon (used 1 tbsp)\n\n    1 egg, lightly beaten\n\n    3 tablespoons sesame seeds, toasted (omitted)\n\n    1/2 cup safflower or canola oil\n\n    For serving: pita bread, sliced tomatoes, thinly sliced red onion, romaine lettuce leaves, and store-bought tahini sauce.\n\nDirections\n\n    Step 1\n\n    Place half of chickpeas in food processor and pulse a few times until chopped, transfer to a large bowl.\n    Step 2\n\n    Place remaining chickpeas in food processor with garlic, onion, herbs, spices, baking soda, salt, and lemon juice. Pulse to a thick, chunky paste, about 30 seconds. Transfer to bowl with chopped chickpeas.\n    Step 3\n\n    Add egg and sesame seeds to bowl and stir to combine. Cover and chill batter in fridge 30 minutes.\n    Step 4\n\n    Heat oil in a large skillet over medium heat. When oil shimmers, drop heaping tablespoons of batter into skillet and gently press batter into 2-inch-round patties. Cook, turning once, until deep golden brown on both sides, about 4 minutes total. Transfer to paper towel-lined plate to drain.\n    Step 5\n\n    Serve falafel with pita bread, sliced tomatoes and red onion, romaine leaves, and store-bought tahini dressing.\n\n",
    "preview": "Falafel http://www.marthastewart.com/349175/falafel Ingredients 1 3/4 cups , or 1 15.5 oz can chickpeas, drained and rinsedCooked Dried Chickpeas 2 garlic cloves, smashed 1 small yellow onion, cut...",
    "size": 1732
  },
  {
    "id": 30,
    "filename": "Meatless_meatballs.txt",
    "file_path": "recipes/030_Meatless_meatballs.txt",
    "type": "text",
    "content": "1 1/2 cups walnuts, ground (make sure these aren’t rancid. Buy in bulk and taste first if you can. If you buy in a package, it shouldn’t look oily.)\n\n4 ounces cheddar, grated\n\n1/2 cups breadcrumbs\n\n1/2 cup wheat germ (I use wholemeal flour)\n\n1/2 onion, minced and sauted  til soft\n\n3/4 cup milk\n\n2 Tbs chopped parsley\n\nsalt and pepper\n\n3 cups bechamel sauce (white sauce, seasoned with thyme and sauteed, diced onion; be sure to cook the onion well)\n\n2 eggs\n\nMix walnuts, grated cheese, breadcrumbs, wheat germ or flour, onion and enough milk to make a mixture that holds together. (I generally use less than 3/4 cup so don’t add all the milk at once). Finally, add well-beaten eggs. Roll the mixture lightly into balls, slightly smaller than egg-size and put into an oiled baking dish. Pour the 3 cups of sauce over it. Bake at 375 – 400˚ for about 40 minutes. \n",
    "preview": "1 1/2 cups walnuts, ground (make sure these aren’t rancid. Buy in bulk and taste first if you can. If you buy in a package, it shouldn’t look oily.) 4 ounces cheddar, grated 1/2 cups breadcrumbs 1/2...",
    "size": 872
  },
  {
    "id": 31,
    "filename": "Ziti Bake Recipe _ Taste of Home.pdf",
    "file_path": "recipes/031_Ziti_Bake_Recipe___Taste_of_Home.pdf",
    "type": "pdf",
    "content": "© T aste of Home 2014 Ziti Bake\nMany of my casserole \nrecipes have been \nfrowned upon by my \nchildren, but they give a \ncheer when they hear \nwe're having Baked Ziti \nfor supper . I've tried to \nincorporate more \nmeatless meals into our \nmenus. No one misses \nthe meat in this one. \nEven the leftovers are \nwell-liked.—Charity \nBurkholder , Pittsboro, \nIndiana. \n6 Servings Prep: 20 min. Bake: 50 min. \nIngredients\n3 cups uncooked ziti or small tube pasta \n1-3/4 cups meatless spaghetti sauce, divided \n1 cup (8 ounces) 4% cottage cheese \n1-1/2 cups (6 ounces) shredded part-skim mozzarella  cheese, divided \n1 egg, lightly beaten \n2 teaspoons dried parsley flakes \n1/2 teaspoon dried oregano \n1/4 teaspoon garlic powder \n1/8 teaspoon pepper \nDirections\nCook pasta according to package directions. Meanwhi le, in a large \nbowl, combine 3/4 cup spaghetti sauce, cottage chee se, 1 cup \nmozzarella cheese, egg, parsley, oregano, garlic po wder and pepper. \nDrain pasta; stir into cheese mixture. \nIn a greased 8-in. square baking dish, spread 1/4 c up spaghetti \nsauce. Top with pasta mixture, remaining sauce and mozzarella \ncheese. \nCover and bake at 375° for 45 minutes. Uncover; bak e 5-10 minutes \nlonger or until a thermometer reads 160°. Yield: 6 servings. Ziti Bake Recipe | Taste of Home http://www.tasteofhome.com/recipes/ziti-bake/print \n1 of 1 6/11/2014 5:14 PM\n",
    "preview": "© T aste of Home 2014 Ziti Bake Many of my casserole recipes have been frowned upon by my children, but they give a cheer when they hear we're having Baked Ziti for supper . I've tried to incorporate...",
    "size": 91025
  },
  {
    "id": 32,
    "filename": "Vegetarian Skillet Chili Recipe - NYT Cooking.pdf",
    "file_path": "recipes/032_Vegetarian_Skillet_Chili_Recipe_-_NYT_Cooking.pdf",
    "type": "pdf",
    "content": "2/23/22, 2:27 PM Vegetarian Skillet Chili R ecipe - NYT Cooking\nhttps://cooking.nytimes.com/r ecipes/1017704- vegetarian-skillet-chili 1/1I N G R E D I E N T S\nFOR THE PICKLED ONIONS:\n1 lime\n1 red onion or shallot, thinly sliced\nLarge pinch of kosher salt\nSmall pinch of granulated sugar\nFOR THE CHILI:\nOlive or grapeseed oil\n1 large onion, chopped\n3 garlic cloves, or to taste, minced\n1 teaspoon chile powder, plus more\nto taste\n1 teaspoon dried oregano, plus more\nto taste\n2 (15-ounce) cans beans, drained\n1 (15-ounce) can diced tomatoes\nwith their juices\nKosher salt\nFresh cilantro, diced avocado and\nsour cream, for garnish (optional)P R E P A R A T I O NYIELD4 servings\nTIME 30 minutesVegetarian Skillet Chili\nBy Melissa Clark\nIf you keep canned beans, tomatoes, onion and garlic in your pantry, you can make this dish on any weeknight\nwithout having to shop. The pickled onions aren’t strictly necessary, but they are simple to make and add a welcome\ntangy contrast to the beans. Pickled peppers are a fine substitute. If you have a bell pepper or jalapeño or two, chop\nthem up and sauté them with the onions. And if you want to be fancy, grate the zest off the lime before juicing for the\npickles, and stir it into the sour cream.\nStep 1\nMake the pickled onions: Squeeze lime juice into a bowl, and add\nonion, salt and sugar. Let rest while you make the chili.\nStep 2\nPrepare the chili: Heat a large skillet over medium-high. Add the oil.\nWhen hot, add onion and sauté until softened, 5 to 7 minutes. Add\ngarlic, chile powder and oregano and sauté until fragrant, 1 to 2\nminutes longer. Add beans and tomatoes and a few large pinches of\nsalt and let simmer until the tomatoes break down, about 20 minutes.\nStep 3\nTaste and add more salt, chile powder and/or oregano to taste. Serve\nwith the pickled onions and any of the garnishes you like.\nPRIVATE NOTES\nLeave a Private Note on this recipe and see it here.",
    "preview": "2/23/22, 2:27 PM Vegetarian Skillet Chili R ecipe - NYT Cooking https://cooking.nytimes.com/r ecipes/1017704- vegetarian-skillet-chili 1/1I N G R E D I E N T S FOR THE PICKLED ONIONS: 1 lime 1 red...",
    "size": 146659
  },
  {
    "id": 33,
    "filename": "black-bean-burger (non-mushy).pdf",
    "file_path": "recipes/033_black-bean-burger_(non-mushy).pdf",
    "type": "pdf",
    "content": "Really Awesome Black Bean Burgers\nJUMP TO RECIPE\nAdjust oven rack to center position and preheat oven to 350°F (175°C). Spread black beans in a single layer on\na foil-lined rimmed baking sheet. Roast until beans are mostly split open and outer skins are beginning to get\ncrunchy , about 20 minutes. Remove from oven and allow to cool slightly .\nWhile beans roast, heat 2 tablespoons oil in a medium skillet over medium-high heat until shimmering. Add\nonion and poblano and cook, stirring frequently , until softened, about 5 minutes. Add garlic and cook, stirring\nconstantly , until fragrant, about 2 minutes. Add chipotle chile and sauce and cook, stirring, until fragrant, about\n30 seconds. Transfer mixture to a large bowl.\nPlace cashews in the bowl of a food processor and pulse until chopped into pieces no larger than 1/3-inch,\nabout 12 short pulses. Add to bowl with onion and pepper .RECIPES BY COURSE MAINS MAINS BY TYPE BURGERS\nPrep 10 mins\nCook 45 mins\nActive 45 mins\nTotal 55 mins\nServes 6 to 8 patties\nIngredients\n2 (15-ounce) cans  black beans , rinsed and drained ●\n4 tablespoons  vegetable oil , divided ●\n1 medium  onion , finely chopped (about 1 cup) ●\n1 large  poblano pepper , finely chopped (about 1 cup) ●\n3 medium cloves  garlic , minced ●\n1 chipotle chile in adobo sauce , finely chopped, plus 1 teaspoon sauce ●\n3/4 cup roasted cashews ●\n1/2 cup finely crumbled feta  or cotija cheese ●\n3/4 cup panko bread crumbs ●\n1 large  egg ●\n2 tablespoons  mayonnaise ●\nKosher salt  and freshly ground black pepper ●\nCheese for topping, such as pepper jack , cheddar , muenster , or Swiss (optional) ●\n6 to 8 hearty hamburger buns , toasted ●\nCondiments  as desired, such as chipotle mayonnaise , ketchup, mustard, or mayonnaise ●\nToppings as desired, such as shredded lettuce , sliced onions, and pickles ●\nDirections\n1.\n2.\n3.3/3/25, 9:47 AM seriouseats.com/the-best-black-bean-burger-recipe?print\nhttps://www.seriouseats.com/the-best-black-bean-burger-recipe?print 1/2\nWhen beans are slightly cooled, transfer to food processor . Add feta or cotija. Pulse until beans are roughly\nchopped (the largest pieces should be about 1/3 of a full bean in size). Transfer to bowl with onion/pepper\nmixture. Add bread crumbs, egg, and mayonnaise and season with salt and pepper . Fold together gently but\nthoroughly with hands. Patty mixture can be stored in an airtight container in the refrigerator for up to three days\nat this stage.\nTo cook indoors:  Form bean mixture into 6 to 8 patties as wide as your burger buns. Heat 1 tablespoon oil in a\nlarge nonstick or cast iron skillet over medium heat until shimmering. Add 4 patties and cook, swirling pan\noccasionally , until well browned and crisp on first side, about 5 minutes. Carefully flip and cook until second side\nis browned, about 5 minutes longer , adding cheese if desired. If cooking more than 4 burgers, cook in batches,\nkeeping cooked burgers on a rack set in a rimmed baking sheet in a 200°F oven while second batch cooks.\nTo cook on the grill:  Light 2/3 chimney full of charcoal.  When all the charcoal is lit and covered with gray ash,\npour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and\nallow to preheat for 5 minutes. Alternatively , set half the burners on a gas grill to the medium-high setting, cover ,\nand preheat for 10 minutes. Clean and oil the grilling grate. Form bean mixture into 6 to 8 patties as wide as\nyour burger buns and brush top sides with oil. Place on hot side of grill oiled-side down and cook without moving\nuntil first side is well browned, 3 to 5 minutes. Brush tops of burgers with oil. Carefully flip and continue cooking\nuntil second side is browned, 3 to 5 minutes longer , topping with cheese if desired.\nSpread top and bottom buns with chipotle mayonnaise or other condiments as desired. Add toppings to top or\nbottom bun as desired. Place patties on bottom buns, close burgers, and serve immediately .\nSpecial Equipment\nFood processor , rimmed baking sheet , grill or large nonstick or cast iron skillet\nNotes\nPatty mixture can be made through step 4 and stored in a sealed container in the refrigerator for up to 3 days before\nforming patties and cooking as desired. To freeze, place formed patties on a parchment-lined baking sheet and place in\nfreezer until fully frozen, about 1 hour . Remove from freezer and cut parchment around each burger . Stack frozen\nburgers with the parchment in between each layer . Transfer to a zipper-lock freezer bag and freeze for up to 3 months.\nTo cook frozen burgers, break apart and spread in a single layer on a baking sheet or cutting board and allow to thaw at\nroom temperature for 1 hour before cooking as directed.\nRead More4.\n5.\n6.\n7.\nHomemade V egan Burgers ●\nTaste Test: The Best Supermarket V eggie Burgers ●\nTaste Test: The Best Imitation-Meat Burgers (Including the Impossible, and Beyond) ●3/3/25, 9:47 AM seriouseats.com/the-best-black-bean-burger-recipe?print\nhttps://www.seriouseats.com/the-best-black-bean-burger-recipe?print 2/2",
    "preview": "Really Awesome Black Bean Burgers JUMP TO RECIPE Adjust oven rack to center position and preheat oven to 350°F (175°C). Spread black beans in a single layer on a foil-lined rimmed baking sheet. Roast...",
    "size": 82408
  },
  {
    "id": 34,
    "filename": "Quick Chana Masala Recipe - Cookie and Kate.pdf",
    "file_path": "recipes/034_Quick_Chana_Masala_Recipe_-_Cookie_and_Kate.pdf",
    "type": "pdf",
    "content": "Quick Chana Masala\nAuthor: Cookie and KatePrep Time: 15 minsCook Time: 20 mins\nTotal Time: 35 minutesYield: 4 servings 1xDiet: Vegan\n 4.7 from 209 reviews\nQuick and easy chana masala recipe served over basmati rice. This spicy, hearty,\nchickpea-based Indian dish is vegan and gluten free. It makes great leftovers, too! Be sure\nto prep the ingredients in advance, as the recipe moves quickly. Recipe yields 4 bowls.\nIngredients\n1x 2x 3x\n1 cup uncooked brown basmati rice, for serving (rice is optional, I like to cook extra\nto have on hand for other meals)\n2 tablespoons coconut oil or extra-virgin olive oil\n1 medium yellow onion, chopped\n1 medium serrano or jalapeño pepper*, minced (remove ribs and seeds to tame the\nspice level)\n½ teaspoon ﬁne sea salt, to taste\n5 cloves garlic, pressed or minced (about 1 tablespoon)\n1 tablespoon peeled and minced fresh ginger (about a 1-inch piece)\n1 ½ teaspoons garam masala**\n1 ½ teaspoons ground coriander\n¾ teaspoon ground cumin\n½ teaspoon ground turmeric\nPinch of cayenne pepper (optional!*)3/5/25, 4:08 PM Quick Chana Masala Recipe - Cookie and Kate\nhttps://cookieandkate.com/quick-vegan-chana-masala/print/23522/ 1/3\n1 large can (28 ounces) ﬁre-roasted crushed tomatoes or whole peeled tomatoes,\nwith their juices\n2 cans (14 ounces each) chickpeas (or 3 cups cooked chickpeas), rinsed and drained\nLemon wedges, for garnish\nFresh cilantro, for garnish (optional)\nInstructions\n1. Cook the rice (if you want to serve the chana masala on rice): Bring a large pot of\nwater to boil on the stove and rinse the rice in a ﬁne-mesh colander. Once boiling,\npour in the rice and give it a stir. Boil the rice for 30 minutes, then turn oﬀ the heat\nand drain the rice. Return the rice to the pot and cover the pot. Let the rice steam\nfor 10 minutes. Remove the lid, ﬂuﬀ the rice with a fork and season with sea salt to\ntaste.\n2. Cook the chana masala: In a medium Dutch oven or large saucepan, warm the oil\nover medium-low heat. Add the onion, serrano and salt. Cook until the onion is\ntender and turning translucent, about 5 minutes.\n3. Add the garlic and ginger, and cook until fragrant, about 30 seconds to 1 minute.\nStir in the garam masala, coriander, cumin, turmeric, salt and cayenne (if using),\nand cook for another minute, while stirring constantly.\n4. Add the tomatoes and their juices. If using whole tomatoes, use the back of a\nwooden spoon to break the tomatoes apart (you can leave some chunks of tomato\nfor texture).\n5. Raise the heat to medium-high and add the chickpeas. Bring the mixture to a\nsimmer. Cook, reducing the heat as necessary to maintain a gentle simmer, for 10\nminutes or longer to allow the ﬂavors to develop. Season to taste with additional\nsalt, if desired. If it’s not spicy enough for your liking, add another pinch of cayenne.\n6. Serve over basmati rice, if desired, and garnish with a lemon wedge or two and a\nsprinkle of fresh cilantro leaves.\nNotes\nRecipe adapted with permission from The Oh She Glows Cookbook by Angela Liddon.\n*Tame the heat: While chana masala is inherently full of spice, the serrano (or jalapeño)\nand cayenne pepper are what bring the heat. If you’re sensitive, reduce or omit them\nboth. You can always stir in a pinch of cayenne pepper at the end of cooking if you want\nmore.3/5/25, 4:08 PM Quick Chana Masala Recipe - Cookie and Kate\nhttps://cookieandkate.com/quick-vegan-chana-masala/print/23522/ 2/3\n**Spice blend note: Garam masala is traditional. If you don’t have it and want to get by\nwithout making another trip to the store, you could use tikka masala instead, or perhaps\neven 1 teaspoon yellow curry powder. Don’t have any of those? I suspect this dish would\nbe nicely ﬂavorful with an added pinch of clove and cardamom, or even nothing at all.\nStorage suggestions: This recipe makes for great leftovers! Store the rice, chana masala\nand garnishes separately for best results. Warm the rice and chana masala together, then\ngarnish with fresh lemon wedges and cilantro. Leftovers should keep well for up to 5\ndays. I believe you could also successfully freeze the chana masala and rice components\nfor later.\nChange it up: Though untraditional, I think this would taste great with a generous\nsplash of coconut milk for some creaminess (it would also mellow the spices somewhat).\nUpdate 3/18/20: The recipe originally called for cumin seeds (1 ½ teaspoons) instead of\nground cumin. I made the switch because ground cumin is easier to ﬁnd. The recipe\ncalled for cooking the cumin seeds in the oil before adding the onion, etc. (Cook for a\nminute or two, stirring frequently, until the seeds are golden and fragrant. Watch\ncarefully to avoid burning the seeds.)\nFind it online: https://cookieandkate.com/quick-vegan-chana-masala/3/5/25, 4:08 PM Quick Chana Masala Recipe - Cookie and Kate\nhttps://cookieandkate.com/quick-vegan-chana-masala/print/23522/ 3/3",
    "preview": "Quick Chana Masala Author: Cookie and KatePrep Time: 15 minsCook Time: 20 mins Total Time: 35 minutesYield: 4 servings 1xDiet: Vegan 4.7 from 209 reviews Quick and easy chana masala recipe served...",
    "size": 378631
  },
  {
    "id": 35,
    "filename": "Cheesy Broccoli Pasta Bake.pdf",
    "file_path": "recipes/035_Cheesy_Broccoli_Pasta_Bake.pdf",
    "type": "pdf",
    "content": "Prep Time \n30 mins Cook Time \n20 mins Total Time \n50 mins Cheesy Broccoli Pasta Bake \nA delicious way to eat Broccoli, a favourite Pasta dish. \nCourse: Pasta \nCuisine: Italian \nServings: 4 people \nCalories: 363 kcal \nAuthor: Rosemary \nIngredients \n3 cups cooked short pasta I used penne pasta \n4 cups broccoli florets raw \n3/4 cup tomato puree \n1/2 cup water \n1/2 teaspoon basil \n1/2 teaspoon oregano \n1/4 teaspoon salt \n1-2 cloves garlic chopped \n1 cup Fontina cheese Gruyere cheese is a good substitu te \n1/2 cup Parmesan Cheese \nInstructions \nPre-heat oven to 350°. Lightly oil an 8 x 6 inch ba king dish. 1. \nIn a medium pot heat olive oil and garlic (for appr oximately 1 minute) then add tomato puree, water, b asil, oregano and salt, \nsimmer on medium heat for approximately 10-15 minut es, until thickened. 2. \nCook pasta in salted boiling water for approximatel y 4 minutes then add the broccoli florets and conti nue to boil for \napproximately 3-4 minutes, drain well. 3. \nMix pasta, broccoli florets and sauce, add half the  Fontina and 1/2 the Parmesan cheese and toss gentl y, place in baking \ndish and top with remaining Fontina and Parmesan ch eese. Bake approximately 20 minutes, serve immediat ely. Enjoy! 4. \nNutrition Facts \nCheesy Broccoli Pasta Bake \nAmount Per Serving \nCalories 363 \n* Percent Daily Values are based on a 2000 calorie diet. 4.17 from 6 votes Cheesy Broccoli Pasta Bake https://anitalianinmykitchen.com/cheesy-broccoli-pa sta-bake/ \n1 of 1 5/7/2018, 5:21 PM",
    "preview": "Prep Time 30 mins Cook Time 20 mins Total Time 50 mins Cheesy Broccoli Pasta Bake A delicious way to eat Broccoli, a favourite Pasta dish. Course: Pasta Cuisine: Italian Servings: 4 people Calories:...",
    "size": 37577
  },
  {
    "id": 36,
    "filename": "Tofu Katsu with Japanese Curry - WoonHeng.pdf",
    "file_path": "recipes/036_Tofu_Katsu_with_Japanese_Curry_-_WoonHeng.pdf",
    "type": "pdf",
    "content": "Tofu Katsu with Japanese Curry\nCrispy tofu katsu with ﬂavorful Japanese curry served on a bed of rice is what you\nneed to try today! The tofu is perfectly seasoned and fried to a golden brown. The crunchiness is\nso addictive that it can be served as-is. The curry has melt-in-your-mouth potatoes that go so well\nwith a bowl of warm sushi rice.\n30 mins 1 hr 30 mins\n30 mins2 hrs\nCurry, Main Course Asian, Japanese comfortfood, Curry, tofu\n2 woonheng\nIngredients\nTofu Katsu\nJapanese Curry\nCurry Roux*\nOther ingredients\nPrep Time\nCook Time\nRice Cooking Time (in\nrice cooker)\nTotal Time\nCourse: \nCuisine: \nKeyword: \nServings: \nAuthor: 16 oz ﬁrm tofu \ndrained and freeze\nsalt and pepper to taste\n¼ cup ﬂour\n¼ cup plant-based egg \nor plant milk or aquafaba\n½ cup panko breadcrumbs\nsalt and pepper\noil for cooking\n2 small-sized potato \nabout 1 lb, peeled\n2 medium-sized carrot \nchopped\n8 oz King Oyster mushrooms \nchopped\n4 cups veggie stock\n1 large onion \nﬁnely chopped (yields about 1¼ cups)\n1 small Fuji apple \npeeled and seeded\n1 tablespoon soy sauce\nsalt to taste\n½ tablespoon peach preserves \noptional (see notes)\nplant-based butter for cooking\noil for cooking\n3 tablespoons plant-based butter\n4 tablespoons all-purpose ﬂour\n1½ tablespoons curry powder\n1 tablespoon garam masala\n½ teaspoon cayenne pepper4.94 from 16 votes3/5/25, 4:00 PM Tofu Katsu with Japanese Curry - WoonHeng\nhttps://woonheng.com/wprm_print/tofu-katsu-with-japanese-curry 1/3\nInstructions\nHow to prepare Tofu Katsu\nPrepare the curry roux\nHow to prepare Japanese curry and serveCooked sushi rice\nﬁnely julienned cabbage\n1. To prepare the tofu, remove the tofu from its package and drain out the water. Wrap the tofu\nwith paper towels or a clean dishcloth.\n2. Place tofu on a chopping board and stack with another ﬂat plate or chopping board. Then\nweigh it down with something heavy such as cans or cartons. Let the tofu drain for about 10-\n15 minutes. Remove and place the tofu back into its package and freeze overnight.\n3. When ready, thaw the tofu to room temperature and squeeze the tofu between your palms to\nremove the liquid.\n4. Then, cut into 2 big slabs. I trimmed the sides to make it look like a cutlet but this is an\noptional step. Season both sides generoulsy with salt and pepper.\n5. Next, set up the dipping station: Place ﬂour, plant-based eggs, and panko breadcrumbs on 3\nseparate plates.\n6. Take a tofu slab and coat each side generously with ﬂour. Then, dip it into the plant-based\negg until coated and drip off excess. Finally, lay the tofu on the panko and gently press to get\nthe panko to stick until all sides are well coated.\n7. Heat ½-inch vegetable oil in a large skillet over medium heat. To test if the oil is ready, drop a\nsmall piece of panko into the oil. If it sizzles, then the oil is ready.\n8. Carefully slide the tofu into the hot oil. The tofu should sizzle as soon as it touches the oil.\nUse a pair of tongs to lift a corner to check the color.\n9. Once the tofu is golden, slowly turn them over and fry the other side. Note: if it's browning too\nquickly, lower the heat just a little.\n10. When ready remove and transfer katsu to a drain rack. This will keep the katsu crispy until\nready to use. The katsu is ready to be served as-is with a side of rice.\n1. Skip this step if you are using store-bought curry cubes.\n2. To make the curry roux, melt the butter in a pot over medium-low heat and whisk in the ﬂour.\nStir the mixture while cooking until it starts to turn brown. This process takes about 10-12\nminutes.\n3. Then, add the garam masala, curry powder, and cayenne pepper. Stir until well-combined and\nset it aside until ready to use or refrigerate once it's cooled.\n1. To prepare the curry, melt butter in a pan and sauté the mushrooms until aromatic. Then,\ntransfer it to a plate and set it aside.\n2. Using the same pan, add more cooking oil and sauté onions until they caramelized.\n3. Add the carrots, potatoes, and mushrooms and cover the ingredients with vegetable stock.3/5/25, 4:00 PM Tofu Katsu with Japanese Curry - WoonHeng\nhttps://woonheng.com/wprm_print/tofu-katsu-with-japanese-curry 2/3\nNotes\nI'm using a large onion which yields about 1 ¼ cups after chopped\nThe peach preserve is absolutely optional. Skip if you have a large Fuji apple or you prefer a\nless sweet version\nCurry Roux recipe is from JustOneCookbook4. Place a lid over and bring the mixture to a boil, then lower the heat and let it simmer. Check\nthe potatoes' tenderness with a fork or chopstick.\n5. Meanwhile, blend the apple into a puree.\n6. Once the potatoes are fork-tender and fully cooked through, season with soy sauce, salt,\napple, and peach preserves (if using).\n7. Using a sieve, stir the curry roux into the broth. The broth will slowly turn darker. Test and\nseason if needed.\n8. To serve, add a few spoons of rice to a plate and then, top with tofu katsu and ladle the hot\ncurry over. Serve warm a side of shredded cabbage.3/5/25, 4:00 PM Tofu Katsu with Japanese Curry - WoonHeng\nhttps://woonheng.com/wprm_print/tofu-katsu-with-japanese-curry 3/3",
    "preview": "Tofu Katsu with Japanese Curry Crispy tofu katsu with ﬂavorful Japanese curry served on a bed of rice is what you need to try today! The tofu is perfectly seasoned and fried to a golden brown. The...",
    "size": 83950
  },
  {
    "id": 37,
    "filename": "zucchini_pancakes.pdf",
    "file_path": "recipes/037_zucchini_pancakes.pdf",
    "type": "pdf",
    "content": "",
    "preview": "",
    "size": 202272
  },
  {
    "id": 38,
    "filename": "Two-Minute Creamy Salad Dressing.pdf",
    "file_path": "recipes/038_Two-Minute_Creamy_Salad_Dressing.pdf",
    "type": "pdf",
    "content": "6/18/22, 1:35 PM Two-Minute Cr eamy Salad Dr essing\nhttps://www .thekitchn.com/_/print 1/1https://www.thekitchn.com/recipe-two-minute-creamy-salad-dressing-recipes-from-the-kitchn-114115\nTwo-Minute Creamy Salad Dressing\nYIELD\nMakes enough for 2 side salads\nINGREDIENTS\nINSTRUCTIONS\nRECIPE NOTES\nStorage:  Leftovers can be stored in an airtight container in the refrigerator for up to 5 days.\nThis r ecipe was originally published April 2010.1 teaspoon Dijon or grainy mustard\n1 1/2 tablespoons mayonnaise or whole-milk plain yogurt\nPinch salt\nPinch granulated sugar\nFreshly ground black pepper\n1 tablespoon Champagne or white wine vinegar\nWhisk the mustard, mayonnaise or yogurt, salt, sugar, and pepper together in a\nsmall bowl until combined. Add the vinegar and whisk until smooth. Toss with\nsalad greens and serve.1",
    "preview": "6/18/22, 1:35 PM Two-Minute Cr eamy Salad Dr essing https://www .thekitchn.com/_/print 1/1https://www.thekitchn.com/recipe-two-minute-creamy-salad-dressing-recipes-from-the-kitchn-114115 Two-Minute...",
    "size": 75189
  },
  {
    "id": 39,
    "filename": "gf_bannocks.txt",
    "file_path": "recipes/039_gf_bannocks.txt",
    "type": "text",
    "content": "Gluten-free bannock (fry bread)\nMakes about four pieces of fry bread (I made five but one was a bit smaller)\n\n2 cups gluten-free all-purpose flour (I used Dove’s Farm Plain White Flour)\n1 teaspoon baking powder\n1 teaspoon baking soda\n2 teaspoons xanthan gum\n1/2 teaspoon salt\n1 cup water, plus a bit extra if necessary (I added 1 tablespoon)\nvegetable shortening for frying\n\nMix all dry ingredients together well. I like to use a pastry blender if I’m feeling too lazy to sift. A pastry blender is great at smushing any lumps and mixing everything well together.\n\nAdd 1 cup of cold water and mix until you have a slightly sticky dough. If it’s too firm, add a little extra water. I added 1 tablespoon. A pastry blender is great for this step too.\n\nMake a ball out of the dough. Allow to rest at room temperate for 30 minutes, covered lightly with a clean tea towel.\n\nScoop out a hunk of dough – the size will depend on how big you want your fry bread to be, but mine mostly turned out a little smaller than a salad plate and I’d say my dough hunks were about the size of a small orange.\n\nLightly flour your working surface with the gluten-free flour. I actually just used a flat plate because I decided not to roll out my dough with a rolling pin. Maybe it’s the association with camping but I tend to think bannock shouldn’t be too perfect-looking. I just used my hands to flatten it out into a thinnish disc, probably about 5 mm where thinnest and up to 1 cm where thickest.\n\nPut a generous pat of vegetable shortening (I use Trex as it’s not full of chemicals) into a frying pan and preheat to medium-high. Put the bannock in the pan and fry until it’s puffy in places and golden brown on the fried side. Flip over and fry the other side.\n",
    "preview": "Gluten-free bannock (fry bread) Makes about four pieces of fry bread (I made five but one was a bit smaller) 2 cups gluten-free all-purpose flour (I used Dove’s Farm Plain White Flour) 1 teaspoon...",
    "size": 1760
  },
  {
    "id": 40,
    "filename": "Flatbread - Gluten Free on a Shoestring.pdf",
    "file_path": "recipes/040_Flatbread_-_Gluten_Free_on_a_Shoestring.pdf",
    "type": "pdf",
    "content": "2/5/24, 4:39 PM Soft Gluten Free Flatbread - Gluten Free on a Shoestring\nhttps://glutenfreeonashoestring.com/soft-gluten-free-ﬂatbread-piadina/ 1/2Soft Gluten Free Flatbread\nThe simplest recipe for soft gluten free flatbread calls for only 5 basic gf pantry\ningredients. It will bend without breaking every time using this recipe + our tips and\ntricks!\nBread, Flatbread, Tortillas\nItalian\n15 minutes\n15 minutes\n30 minutes\n2 flatbreads\nNicole Hunn\nI N G R E D I E N T S I N S T R U C T I O N S\nCourse: \nCuisine: \nPrep Time:\nCook Time:\nChilling time:\nYield: \nAuthor: \n¾ cup (105 g) all purpose\ngluten free flour blend  \n(I used\nBetter Batter; click thru for full\ninfo), plus more for sprinkling\n½ teaspoon  xanthan gum  \nomit\nif your blend already contains\nit\n5 tablespoons  (38 g) tapioca\nstarch/flour  \n(See Recipe Notes)\n¾ teaspoon  kosher salt\n½ teaspoon  baking powder\n1 tablespoon  (14 g) extra vir gin\nolive oil\n½ cup (4 fluid ounces ) plain\nunsweetened plant-based (for\nvegan) milk  \nor cow’ s milk,\nchilled\nNeutral oil for the skillet  \nlike\ngrapeseed, canola, or vegetable1. In a lar ge bowl, place the flour , xanthan gum, tapioca starch/flour ,\nsalt, and baking powder , and whisk to combine well. Add the oil,\nand mix to combine.\n2. Add the milk, and mix until the mixture comes together . If necessary\nto bring the dough together , knead together with clean hands. The\ndough will be thick but relatively soft.\n3. Ideally , divide the dough into 5 ounce portions (as written, the\ndough makes 2 portions), wrap each tightly in plastic wrap, and chill\nfor 30 minutes and up to 3 days. You can also work with the dough\nimmediately , if you don’ t have time to chill it.\n4. When you’re ready to make the flatbreads, heat a cast iron skillet\nthat’s at least 10-inches in diameter , or a heavy-bottom nonstick\nskillet, over medium-low heat. Place a flat, wide spatula and a tea\ntowel on the counter next to the skillet.\n5. If you’ve chilled the dough in portions, unwrap and work with one\npiece at a time. If the dough hasn’ t been divided, divide it in two\nequal halves, each weighing about 5 ounces.\n6. Turn each piece of dough out onto a very lightly floured flat surface,\nand sprinkle lightly with extra flour . Cover the other piece(s) of\ndough loosely with a cloth to prevent it (them) from drying out.\n7. Sprinkle the dough lightly with more flour and begin to roll it into a\nround, sprinkling lightly with more flour as necessary to prevent\nsticking. The edges will be jagged and a bit rough.\n8. Gather the dough together and repeat the process at least once more,\nuntil the dough is smoother . Roll the dough into an approximately\n10-inch round, turning and flouring lightly as necessary . The edges\nshould be less rough, but this is rustic flatbread.\n9. Brush about 1 tablespoon of neutral oil on the hot skillet. Pick up the\nprepared raw piece of flatbread and place it flat in the center of the\nskillet, taking care not to bend any of the edges.\n Save\n2/5/24, 4:39 PM Soft Gluten Free Flatbread - Gluten Free on a Shoestring\nhttps://glutenfreeonashoestring.com/soft-gluten-free-ﬂatbread-piadina/ 2/2N O T E S\nTapioca starch/flour .\nYou must use tapioca starch (or flour , they’re the same thing) in this recipe in addition to a proper all purpose\ngluten free flour blend. You cannot use Expandex modified tapioca starch. They’re completely dif ferent\ningredients.\nRolling in a tea towel .\nYou absolutely do not have to roll the warm flatbreads in a tea towel. This is designed to create a “memory” in\nthe dough for rolling, so that they will bend perfectly even as they cool.\nAdapted from Curious Cuisinier e.\nNutrition information is appr oximate and should not be r elied on.\nN U T R I T I O N\nCalories: 328kcal | Carbohydrates: 60g | Protein: 2g | Fat: 8g | Saturated Fat: 1g | Polyunsaturated Fat: 1g |\nMonounsaturated Fat: 5g | Sodium: 1109mg | Potassium: 7mg | Fiber: 3g | Sugar: 0.1g | Calcium: 134mg | Iron:\n0.4mg\nSoft Gluten F ree Flatbr ead fr om Nicole Hunn at Gluten F ree on a Shoestring. Find r ecipe online at\nhttps:/ /glutenfr eeonashoestring.com/soft-gluten-fr ee-ﬂatbr ead-piadina/10. Allow it to cook for about 1 minute without disturbing it, or until the\nedges begin to lift. Slide the spatula underneath the flatbread,\nensuring that there are no spots that might stick.\n11. Flip the flatbread over and allow it to cook for another minute,\npressing it firmly back onto the skillet with the spatula to prevent it\nfrom puf fing up. You can also take a toothpick and prick any\nbubbles to deflate them.\n12. Continue to cook the flatbread, flipping it frequently , until it is set on\nboth sides and doesn’ t glisten anywhere. It should take 2 to 3\nminutes total. Remove the flatbread from the skillet, place it in the\ncenter of the tea towel (See Recipe Notes), and fold the edges of the\ntowel over on it to enclose it.\n13. Repeat with the other piece of dough, oiling the skillet lightly as\nnecessary .\n14. Once the flatbreads are done cooking but are still very warm, open\nthe tea towel and remove both pieces of bread. Place one about 4\ninches from one short end of the towel, fold the edge over the bread,\nand roll the bread tightly in the towel.\n15. Place the second flatbread on the unrolled portion of the towel, and\nrepeat the process, rolling until the two flatbreads are tightly\nwrapped in the towel. Allow them to cool for at least 5 minutes\nwrapped in the towel before unwrapping and serving.",
    "preview": "2/5/24, 4:39 PM Soft Gluten Free Flatbread - Gluten Free on a Shoestring https://glutenfreeonashoestring.com/soft-gluten-free-ﬂatbread-piadina/ 1/2Soft Gluten Free Flatbread The simplest recipe for...",
    "size": 305403
  },
  {
    "id": 41,
    "filename": "bakedziti.txt",
    "file_path": "recipes/041_bakedziti.txt",
    "type": "text",
    "content": "`Baked Ziti\nRecipe #35282\n24 ratings\nThis is a tried and true recipe. Good with a crisp salad and some garlic bread.\nby Miss Annie\n| Edit...\nMy Notes\n\n\n1 \tsmall onion, chopped\n2 \tteaspoons olive oil\n1/2 \tcup tomato paste\n1 (8 \tounce) can tomato sauce\n2/3 \tcup water\n1 \tteaspoon leaf oregano, crumbled\n1 \tteaspoon basil leaves, crumbled\n1/4 \tteaspoon salt\n1/8 \tteaspoon black pepper\n1 \tcup ricotta cheese\n6 \tounces mozzarella cheese, shredded\n8 \tounces ziti pasta, cooked and drained\n\n\n   1. Saut onion in oil until it's tender.\n   2. Add tomato paste, tomato sauce, water, oregano, basil, salt and pepper.\n   3. Simmer, covered, for 10 minutes.\n   4. Preheat oven to 375F.\n   5. Coat casserole dish with cooking spray.\n   6. Combine ricotta and 1/2 of the mozzarella in a large bowl.\n   7. Add cooked ziti and half of the sauce.\n   8. Stir.\n   9. Turn into prepared casserole dish and pour on the remaining sauce.\n  10. Sprinkle with the remaining cheese.\n  11. Bake for 25 to 30 minutes.\n\n",
    "preview": "`Baked Ziti Recipe #35282 24 ratings This is a tried and true recipe. Good with a crisp salad and some garlic bread. by Miss Annie | Edit... My Notes 1 small onion, chopped 2 teaspoons olive oil 1/2...",
    "size": 1027
  },
  {
    "id": 42,
    "filename": "Spicy Chile and Garlic Broccoli Recipe _ MyRecipes.pdf",
    "file_path": "recipes/042_Spicy_Chile_and_Garlic_Broccoli_Recipe___MyRecipes.pdf",
    "type": "pdf",
    "content": "1/24/22, 4:42 PM Spicy Chile and Garlic Br occoli R ecipe | MyR ecipes\nhttps://www .myrecipes.com/r ecipe/spicy -chile-garlic-br occoli?printview 1/1Spicy Chile and Garlic\nBroccoli\nCrushed red pepper brings the heat in this\nSpicy Chile and Garlic Broccoli recipe. Serve\nthis healthy side with lean beef or chicken\nfor a well-rounded and delicious meal.Yield:Serves 6 (serving\nsize: 2/3 cup)\nJohn Autry; Styling:\nCindy Barr\nIngredients Directions\n© COPYRIGHT 2022 MYRECIPES. ALL RIGHTS RESERVED.\nPrinted from https://www.myrecipes.com 01/24/202212 ounces broccoli \u0000orets (5\ncups raw)\n2 tablespoons extra-virgin\nolive oil\n1 ½ teaspoons crushed red\npepper\n4 garlic cloves, sliced\n1 tablespoon fresh lemon\njuice\n1 teaspoon grated lemon rind\n¼ teaspoon kosher saltArrange broccoli in a steamer. Steam, covered, 4 minutes or\nuntil crisp-tender. Place broccoli in a large bowl.Step 1\nHeat a skillet over medium-high heat. Add olive oil, crushed\nred pepper, and sliced garlic; cook 2 minutes. Add lemon juice.\nPour over broccoli. Sprinkle with lemon rind and kosher salt.Step 2",
    "preview": "1/24/22, 4:42 PM Spicy Chile and Garlic Br occoli R ecipe | MyR ecipes https://www .myrecipes.com/r ecipe/spicy -chile-garlic-br occoli?printview 1/1Spicy Chile and Garlic Broccoli Crushed red pepper...",
    "size": 250197
  },
  {
    "id": 43,
    "filename": "Shrimp Cocktail Sauce.pdf",
    "file_path": "recipes/043_Shrimp_Cocktail_Sauce.pdf",
    "type": "pdf",
    "content": "3/6/24, 3:37 PM Classic Shrimp Cocktail Sauce\nhttps://www.thekitchn.com/_/print 1/2https://www .thekitchn.com/recipe-classic-shrimp-cocktail-sauce-appetizer -recipes-from-the-kitchn-\n217148\nClassic Shrimp C ocktail Sauc e\nPREP TIME\n5 minutesSERVES\n6 to 8\nINGREDIENTS\nRECIPE NOTES1/2 cup ketchup •\n2 tablespoons prepar ed horser adish, plus mor e to taste •\n1 teaspoon freshly squeez ed lemon juice •\n1/2 teaspoon Worcestershir e sauce •\n1/2 teaspoon hot sauce •\n1 to 2 pounds large raw shrimp, peeled and\ndeveined (https:/ /www .thekitchn.com/how-t o-peel-amp-de vein-shrimp-cooking-\nlessons-fr om-the-kitchn-217120)•\nINSTRUCTIONS\nWhisk t ogether all the ingr edients in a bowl. Taste and add mor e horser adish or\nany of the other ingr edients t o suite y our taste. When y ou're happ y with the\nsauce, tr ansf er it t o a small ser ving bowl.1\nCook the shrimp b y poaching them in boiling water , pan-fr ying them on the\nstovetop(//www .thekitchn.com/how-t o-quickly-cook-shrimp-on-the-st ovetop-\ncooking-lessons-fr om-the-kitchn-214397) , or roasting them in the\noven(//www .thekitchn.com/how-t o-roast-shrimp-in-the-o ven-cooking-lessons-\nfrom-the-kitchn-204080)  until opaque. Arr ange the shrimp ar ound the cocktail\nsauce and ser ve hot or cold.2\n3/6/24, 3:37 PM Classic Shrimp Cocktail Sauce\nhttps://www.thekitchn.com/_/print 2/2Mak e-ahead:  The cocktail sauce can be made up t o a week ahead and k ept r efriger ated.\nThe shrimp can be cook ed a da y ahead and ser ved cold.",
    "preview": "3/6/24, 3:37 PM Classic Shrimp Cocktail Sauce https://www.thekitchn.com/_/print 1/2https://www .thekitchn.com/recipe-classic-shrimp-cocktail-sauce-appetizer -recipes-from-the-kitchn- 217148 Classic...",
    "size": 72129
  },
  {
    "id": 44,
    "filename": "Easy Black Bean Chili – A Couple Cooks.pdf",
    "file_path": "recipes/044_Easy_Black_Bean_Chili_–_A_Couple_Cooks.pdf",
    "type": "pdf",
    "content": "2/23/22, 3:05 PM Easy Black Bean Chili – A Couple Cooks\nhttps://www .acouplecooks.com/black-bean-chili/print/115218/ 1/2Easy Black Bean Chili\n★ ★ ★ ★ ★ 5 from 2 reviews\nYield:  6 servings 1x Diet:  Vegetarian\nThis Black Bean Chili r ecipe is easy t o mak e and full of big ﬂa vor! It’ s cozy and hear ty, the ideal\nvegetarian dinner idea.\nIngredients 1x 2x 3x\nInstructions1 medium y ellow onion\n3 cloves garlic\n2 tablespoons  olive oil\n1/3 cup  dry quinoa\n1 cup  water\n3 15-ounce cans black beans, dr ained (not rinsed)\n2 28-ounce cans diced t omat oes, ﬁr e roasted if possible\n4 tablespoons  salted butter (r eplace with 2 tablespoons  olive oil or r eﬁned coconut oil for\nvegan)\n1 15-ounce can corn (or 1 1/2 cups  frozen corn)\n1 tablespoon  yellow mustar d\n1 tablespoon  Worcestershir e sauce\n1/2 cup  ketchup\n2 tablespoons  each chili powder and dried or egano\n1 tablespoon  each  garlic powder and cumin\n1 1/2 teaspoons  kosher salt\n1 teaspoon  smok ed paprika\n2/23/22, 3:05 PM Easy Black Bean Chili – A Couple Cooks\nhttps://www .acouplecooks.com/black-bean-chili/print/115218/ 2/2Find it online : https:/ /www .acouplecooks.com/black-bean-chili/S e r v e s  6\nC a l o r i e s  P e r  S e r v i n g :  \n% DAILY VALUE\n19% Total Fat\n1 4 . 6 gSaturated\nFat 6 g25% Total\nCarbohydrate\n6 9 . 6 g63% Dietary\nFiber 1 7 . 6 g\nSugars 1 8 . 3 g 33% Protein\n1 6 . 6 g16% Vitamin\nA 1 4 2 . 3 µ g35% Vitamin\nC 3 1 . 2 m g\n14% Calcium\n1 8 4 . 3 m g45% Iron\n8 . 2 m g0% Vitamin\nD 0 µ g32%\nMagnesium\n1 3 4 . 5 m g\n28%\nPotassium\n1 3 2 5 . 8 m g17% Vitamin\nB6 0 . 3 m g1% Vitamin\nB12 0 µ g4511. Dice the onion . Mince the garlic .\n2. In a lar ge pot or Dutch o ven, heat the oliv e oil o ver medium heat. Add the onions and garlic\nand sauté for 5 t o 7 minutes, until tender .\n3. Add all other ingr edients ex cept for the smok ed paprika. Simmer for 25 minutes, then stir in\nthe smok ed paprika. Ser ve immediately with t oppings of y our choice. St ore left overs\nrefriger ated for up t o 3 da ys, or fr ozen for 3 months.\n4. Campﬁr e chili instructions: Follow the instructions abo ve, but r emo ve the smok ed paprika\n(the ﬁr e will add smoky ﬂa vor). If y ou’re taking it camping, pr ep the minced onion and garlic\nand place in a sealed container . Place the ingr edients fr om water thr ough kosher salt  in\nanother lar ge sealed container (k eep out the dr y quinoa and add when cooking). K eep\neverything cool until making the chili.",
    "preview": "2/23/22, 3:05 PM Easy Black Bean Chili – A Couple Cooks https://www .acouplecooks.com/black-bean-chili/print/115218/ 1/2Easy Black Bean Chili ★ ★ ★ ★ ★ 5 from 2 reviews Yield: 6 servings 1x Diet:...",
    "size": 109245
  },
  {
    "id": 45,
    "filename": "Cookstr - Deluxe Macaroni and Cheese.pdf",
    "file_path": "recipes/045_Cookstr_-_Deluxe_Macaroni_and_Cheese.pdf",
    "type": "pdf",
    "content": "3/17/24, 12:42 PM Cookstr - Deluxe Macaroni and Cheese\nﬁle:///home/jfg/Mount/box 25GB/Recipes/Cookstr - Deluxe Macaroni and Cheese.htm 1/5Cookstr\nLOG OUT\nWelcome to Cookstr\nLog in  Sign up\nWhat's Cookstr\nNutritional Info\nRecipes\nChefs & Authors\nMy Cookstr\nType recipe, ingredients, \ndeluxe-macaroni-and-cheese\nDeluxe Macar oni and Cheese\nHeart  \nEmail  \nPrint  \nFacebook\n Twitter\n Stumbleupon\n Pinterest\nInfo\nCourse: Main Course, Side Dish\nTotal Time: Under 1 Hour\nSkill Level: Easy\nCost: Inexpensive\nFavorited: 47 Times\nAuthor\njean-anderson\nJean Anderson\nView Profile\nCookbook\nthe-new-doubleday-cookbook\nPublished by Doubleday\nPhoto by: Joseph De Leo\nComments: 0\n \nRecipe\nYield : 6 servings\nIngredients\n¼ cup butter or margarine\n¼ cup sifted flour\n1 teaspoon powdered mustard\n2½ cups milk\n3 cups coarsely grated sharp Cheddar  cheese\n¼ teaspoon salt (about)\n1/8 teaspoon white pepper\n1 tablespoon Worcestershire sauce\n1 tablespoon finely grated yellow onion  (optional)\n½ pound elbow macaroni , cooked and drained by package directions\n3/17/24, 12:42 PM Cookstr - Deluxe Macaroni and Cheese\nﬁle:///home/jfg/Mount/box 25GB/Recipes/Cookstr - Deluxe Macaroni and Cheese.htm 2/5Directions\nPreheat oven to 350°F .\nMelt butter in saucepan over moderate heat, blend in flour and mustard, slowly stir in milk, and cook, stirring until thickened. Mix\nin 2 cups grated cheese and all remaining ingredients except macaroni. Taste for salt and add a little more if needed. Cook and stir\nuntil cheese melts.\nOff heat, mix in macaroni; turn into a buttered 2-quart casserole, sprinkle with remaining cheese, and bake, uncovered, about ½\nhour until bubbly and lightly browned.\n© 1975, 1985 Doubleday/Bantam Doubleday Dell Publishing, Inc.\n \nNutritional Information\nNutritional information is provided by the author .\nPer serving: 520 C, 95 mg CR, 600 mg S*\n \nWould you like to leave a comment about this recipe?\nAdd a comment\n \nOther Recipes You Might Like\nleche-frita\nLeche Frita\nby Penelope Casas\nperini-ranch-bread-pudding-with-whiskey-sauce\nPerini Ranch Bread Pudding with Whiskey Sauce\nby Robb Walsh\nfrench-toast\nFrench Toast\nby Marion Cunningham\nmini-meat-pies\nMini Meat Pies\nby Penelope Casas\nlittle-tuna-pies\nLittle Tuna Pies\nby Penelope Casas\nDiscover  Related Recipes\nRecipes with Milk\nRecipes with Cheddar\nRecipes with Macaroni\nAmerican Recipes",
    "preview": "3/17/24, 12:42 PM Cookstr - Deluxe Macaroni and Cheese ﬁle:///home/jfg/Mount/box 25GB/Recipes/Cookstr - Deluxe Macaroni and Cheese.htm 1/5Cookstr LOG OUT Welcome to Cookstr Log in Sign up What's...",
    "size": 160035
  },
  {
    "id": 46,
    "filename": "Spicy Potato Pancakes with Queso Fresco Sauce - Recipe for Potato Pancakes with Spicy Cheese Sauce.pdf",
    "file_path": "recipes/046_Spicy_Potato_Pancakes_with_Queso_Fresco_Sauce_-_Recipe_for_Potato_Pancakes_with_Spicy_Cheese_Sauce.pdf",
    "type": "pdf",
    "content": "3/17/24, 12:36 PM Spicy Potato Pancakes with Queso Fresco Sauce - Recipe for Potato Pancakes with Spicy Cheese Sauce\nﬁle:///home/jfg/Mount/ramdisk/Recipes/Spicy Potato Pancakes with Queso Fresco Sauce - Recipe for Potato Pancakes with Spicy Che… 1/51. Food & Drink\nSouth American Food\nSearch\nSouth American Food\nThe Basics\nRegional Specialties\nShare\nPrint  Print\nFree South American Food Newsletter! Enter email address Sign Up\nDiscuss  in my forum\nSpicy Potato Pancakes with Queso Fr esco Sauce\nBe the first to write a r eview\nBy Marian Blazes , About.com Guide\nSee More About:\nqueso fresco\npotatoes\nappetizers\n“\n ”\nSpicy Potato Pancakes with Cheese Sauce\nMarian Blazes\nIt's hard to improve on the classic potato pancake, served with sour cream and applesauce. But sometimes a little variation can be\nfun. These potato pancakes have a few delicious surprises without straying too far from the original. The pancake batter has a\nmix of sweet and regular potatoes, as well as some jalepeño for kick. The sweet potatoes add a caramel note that goes well with\nthe cheese sauce, which is made by cooking onions, peppers, and garlic until they are very soft, then adding queso fresco cheese\nfor creaminess and a little tang.\nPrep Time: 15 minutes\nCook Time: 40 minutes\nTotal Time: 55 minutes\nIngredients:\n1/3 cup finely chopped onion\n3/17/24, 12:36 PM Spicy Potato Pancakes with Queso Fresco Sauce - Recipe for Potato Pancakes with Spicy Cheese Sauce\nﬁle:///home/jfg/Mount/ramdisk/Recipes/Spicy Potato Pancakes with Queso Fresco Sauce - Recipe for Potato Pancakes with Spicy Che… 2/52 cloves garlic, minced\n2 tablespoons olive oil\n1 red or orange bell pepper , chopped very fine\n2 jalapeño peppers, minced (about 4 tablespoons)\n1 teaspoon cumin\n1/2 teaspoon chile powder (or to taste)\n2 tablespoons flour\n1 cup vegetable broth\n3/4 cup crumbled queso fresco cheese (or farmers cheese, or mild feta)\n1 large white potato\n1 large sweet potato\n2 eggs\n3 tablespoons flour\nVegetable oil and butter for frying\nSalt and pepper to taste\nPreparation:\n1. Sauté the onions and garlic in the olive oil until golden and soft.\n2. Add the chopped pepper , 2 tablespoons minced jalapeño, cumin, chile powder , and salt to taste. Cook for 15 to 20\nminutes on low heat, until vegetables are golden and very tender .\n3. Raise heat to medium. Stir in 2 tablespoons flour and cook, stirring, for 2 minutes. Add 1 cup vegetable broth, lower heat,\nand simmer for 10 minutes, until most of the liquid is evaporated and you have a thick sauce.\n4. Stir in the cheese and cook over low heat, stirring constantly , until cheese has blended into the sauce. Keep sauce barely\nwarm while you prepare the pancakes.\n5. Peel and finely grate the potatoes. Press grated potatoes between paper towels to remove excess water .\n6. Stir 2 eggs, 2 tablespoons minced jalapeño, and 3 tablespoons flour into the potatoes. Season generously with salt.\n7. Heat 3 tablespoons vegetable oil and 2 tablespoons butter in a skillet on medium heat.\n8. When oil is hot, add tablespoons of potato batter to skillet. Flatten and shape into round pancakes with a spatula. Oil\nshould be hot enough that pancakes sizzle gently .\n9. Cook pancakes for about 2 minutes on each side, or until golden brown, pressing down gently with spatula. Drain on a\nplate lined with paper towels, and repeat with rest of batter .\n10. Pancakes can be kept warm in a 200 degree oven for up to 30 minutes, on a cookie sheet lined with paper towels.\n11. Serve pancakes warm with cheese sauce.\nMakes about 15-20 pancakes.\nUser Reviews\nWrite a review\nBe the first to write a review\nMore Potato Recipes..\nEcuadorian Potato Cakes - LLapingachos - Recipe for Potato Cakes\nPapa a la Huancaína - Potatoes with Cheese Sauce\nSweet Potato Pancakes - Sweet Potato Pancakes Recipe - Recipe for Sweet Potat...\nMore Links\nRelated Articles",
    "preview": "3/17/24, 12:36 PM Spicy Potato Pancakes with Queso Fresco Sauce - Recipe for Potato Pancakes with Spicy Cheese Sauce ﬁle:///home/jfg/Mount/ramdisk/Recipes/Spicy Potato Pancakes with Queso Fresco...",
    "size": 158527
  },
  {
    "id": 47,
    "filename": "Marinade Recipe - Pinch of Yum.pdf",
    "file_path": "recipes/047_Marinade_Recipe_-_Pinch_of_Yum.pdf",
    "type": "pdf",
    "content": "3/6/24, 3:31 PM The Everything Marinade Recipe - Pinch of Yum\nhttps://pinchofyum.com/the-everything-marinade/print/59496 1/2\nThe Everything Marinade\nAuthor: Lindsay  Total Tim e: 5 m inutes  Yield: 4 servings 1x\nThe Everything M arinade! All you need is a few  pantry ingredients and a jar, and\nyou’ve got heavenly, sm okey-sw eet, savory \u0000avor that goes w ith just about any\nvegetable or protein.\nIN G R ED IEN TS\nIN STRU CTIO N S\nN O TES1/4 cup olive oil\n1/4 cup m aple syrup\n1/4 cup soy sauce\n2 tablespoons balsam ic vinegar\n1 teaspoon sm oked paprika\n1/2 teaspoon cum in\n1/2 teaspoon Italian seasoning\n1/2 teaspoon onion pow der\n1/2 teaspoon garlic pow der\nsalt and black pepper (to taste)\n1. W hisk all ingredients or shake in a jar until com bined.\n2. SO M AN Y OPTION S. See notes for all the w ays to use this m agic.\nPork: W e used pork chops and loved it. M arinate for at least 1 hour, up to overnight. Grill, pan fry, do\nyour thing, brushing the pork w ith a little reserved sauce during cooking to m ake it extra juicy and\nyum m y.\nChicken: W e used chicken thighs and loved it. M arinate for at least 1 hour, up to overnight. Pan fry,\nbake, or cook in the Instant Pot for 15 m inutes. Shred or chop the chicken for a salad or add-in to\nanother recipe, or just… eat the chicken thighs!\nTofu: W e used extra \u0000irm  tofu and loved it. For best results, squeeze all the w ater out of the block of\ntofu and then m arinate the intact block of tofu overnight. The next day, cut the block into cubes and\npan-fry, brushing w ith reserved m arinade.\n3/6/24, 3:31 PM The Everything Marinade Recipe - Pinch of Yum\nhttps://pinchofyum.com/the-everything-marinade/print/59496 2/2NUTRITION FACTS\nServes 4\nCalories Per Serving: \n% DAILY VALUE\n18% Total Fat 14.2g 0% Cholesterol 0m g 18% Sodium 424.6m g 6% Total Carbohydrate\n17.7g\n1% Dietary Fiber 0.4g Sugars 14g 3% Protein 1.5g 2% Vitamin A 14.6µg\n0% Vitamin C 0.1m g 3% Iron 0.5m g 11% Potassium\n526.6m g2% Phosphorus\n20.8m g197\nFind it online: https://pinchofyum .com /the-everything-m arinadePortobello M ushroom  Caps: M y personal favorite! M arinate for 30 m inutes to 1 hour. Grill or pan-fry\nuntil nice and roasty and sticky and juicy. \nVeggies: W orks great w ith just about any veggies, no instructions needed. \nBeef: This w as the only thing w e tried that w e didn’t love w ith this m arinade.",
    "preview": "3/6/24, 3:31 PM The Everything Marinade Recipe - Pinch of Yum https://pinchofyum.com/the-everything-marinade/print/59496 1/2 The Everything Marinade Author: Lindsay Total Tim e: 5 m inutes Yield: 4...",
    "size": 114831
  },
  {
    "id": 48,
    "filename": "chana-masala-savory-indian-chick-peas.pdf",
    "file_path": "recipes/048_chana-masala-savory-indian-chick-peas.pdf",
    "type": "pdf",
    "content": "10/23/23, 4:39 PM allrecipes.com/r ecipe/236564/chana-masala-savory -indian-chick-peas/?print\nhttps://www .allrecipes.com/r ecipe/236564/chana-masala-savory -indian-chick-peas/?print 1/2Prep Time: 15 mins\nCook Time: 15 mins\nTotal Time: 30 mins\nIngredients\n1 onion, chopped\n1 tomato, chopped\n1 (1 inch) piece fresh ginger, peeled and chopped\n4 cloves garlic, chopped, or more to taste\n1 green chile pepper, seeded and chopped (Optional)\n3 tablespoons olive oil\n2 fresh bay leaves\n1 teaspoon chili powder\n1 teaspoon coriander powder\n1 teaspoon garam masala\n½ teaspoon turmeric powder\n1 pinch salt to taste\nwater as needed\n1 (15 ounce) can chickpeas\n1 teaspoon fresh cilantro leaves, for garnish, or more to taste\nDirectionsChana Masala (Savory Indian Chick Peas)\nGive this chana masala dish a try and don't look back. Indian food is not just curried sauces. This spin on an Indian\nchickpea curry features a healthy mixture of chickpeas, tomatoes, onion, and spices. Both carnivores and vegetarians\nwill enjoy this meal. My kids love it. Leave out the green chile if the kiddies will be eating. Serve over basmati or jasmine\nrice and enjoy. Namaste y'all!\nRecipe by latinmama | Updated on March 7, 2023\n Tested by Allrecipes Test Kitchen\nStep 1\nGrind onion, tomato, ginger, garlic, and chile pepper together in a food processor into a paste.\nStep 2\nHeat olive oil in a large skillet over medium heat. Fry bay leaves in hot oil until fragrant, about 30 seconds. Pour the\npaste into the skillet and cook until the oil begins to separate from the mixture and is golden brown in color, 2 to 3\nminutes. Season the mixture with chili powder, coriander, gram masala, turmeric, and salt; cook and stir until very hot, 2\nto 3 minutes.\nStep 3\nStir enough water into the mixture to get a thick gravy; bring to a boil and stir chickpeas into the gravy. Reduce heat to\nmedium and cook until the chickpeas are heated through, 5 to 7 minutes. Garnish with cilantro.\n10/23/23, 4:39 PM allrecipes.com/r ecipe/236564/chana-masala-savory -indian-chick-peas/?print\nhttps://www .allrecipes.com/r ecipe/236564/chana-masala-savory -indian-chick-peas/?print 2/2Cook's Notes:\nServe with a 'Mattar Paneer' recipe to round out this Indian dinner.\nAs an optional serving suggestion, use the \"Indian Naan Bread\" recipe instead of rice as a companion to this dish.\nNutrition Facts\nPer serving: 413calories; total fat 23g ; saturated fat 3g ; sodium 525mg ; total carbohydrate 46g ; dietary fiber 10g ; total\nsugars 5g ; protein 9g ; vitamin c 76mg ; calcium 103mg ; iron 3mg ; potassium 635mg",
    "preview": "10/23/23, 4:39 PM allrecipes.com/r ecipe/236564/chana-masala-savory -indian-chick-peas/?print https://www .allrecipes.com/r ecipe/236564/chana-masala-savory -indian-chick-peas/?print 1/2Prep Time: 15...",
    "size": 79469
  },
  {
    "id": 49,
    "filename": "Easy Fried Apples Recipe - Kylee Cooks.pdf",
    "file_path": "recipes/049_Easy_Fried_Apples_Recipe_-_Kylee_Cooks.pdf",
    "type": "pdf",
    "content": "Easy Fried Apples Recipe\nThis F ried Apples Recipe is tar t, sweet and has just the right amount of\nspice t o mak e them a fa vorite side or desser t!\nA delicious comfor t food that e veryone lo ves! Ser ve as a side, or as desser t\n(they are delicious o ver ice-cr eam).\nCourse Desser t, Side Dish\nCuisine American\nPrep Time 10 minutes\nCook Time 20 minutes\nTotal Time 30 minutes\nServings 6\nCalories 331kcal\nAuthor Kylee A yotte\nEquipment\nIngredients\nServing:\nInstructions\nGet pr epped\nCook the apples\nAdd r emaining ingr edients\nServe\nNotesCast ir on skillet\n½ cup butter\n6 apples  \nGranny Smith\n½ cup granulated white sugar  \ngranulated, white\n¼ cup brown sugar  \npack ed\n1 teaspoon  cinnamon\n1 pinch  nutmeg\n1 pinch  salt\n6 scoops  Vanilla Ice cr eam\n1. Peel, cor e and slice the apples int o even pieces.\n1. Melt the butter in a lar ge skillet o ver medium heat.\n2. Add the apples, co ver, and cook o ver low heat for 15-20 minutes, until the apples ar e soft. Stir\noften so the y don ’t burn.\n1. Mix the white sugar , brown sugar , cinnamon, nutmeg and salt t ogether in a bowl.\n2. Add t o the apples and stir . Cook for another 5-10 minutes until the sugar is dissolv ed and ar e\nsyrup y.\n1. Serve over ice-cr eam, or as a side.\n9/18/24, 5:13 PM Easy Fried Apples Recipe - Kylee Cooks\nhttps://www.kyleecooks.com/wprm_print/easy-fried-apples-recipe 1/2\nNutrition info does not include the optional ice cr eam.\nRecipe fr om K yleeCooks.com | Easy F ried Apples Recipe | https:/ /www .kyleecooks.com/fried-apples/ (cop yrighted)9/18/24, 5:13 PM Easy Fried Apples Recipe - Kylee Cooks\nhttps://www.kyleecooks.com/wprm_print/easy-fried-apples-recipe 2/2",
    "preview": "Easy Fried Apples Recipe This F ried Apples Recipe is tar t, sweet and has just the right amount of spice t o mak e them a fa vorite side or desser t! A delicious comfor t food that e veryone lo ves!...",
    "size": 139302
  },
  {
    "id": 50,
    "filename": "Spicy Ketchup - Joy the Baker.pdf",
    "file_path": "recipes/050_Spicy_Ketchup_-_Joy_the_Baker.pdf",
    "type": "pdf",
    "content": "Homemade Spicy Ketchup\nmakes 3 cups ketchup\n2 tablespoons olive oil\n1 medium onion, chopped\n1 clove garlic, minced\n1 heaping tablespoon tomato paste\n1 teaspoon salt\n1 teaspoon ground mustard\n1/2 teaspoon smokey paprika\nbig pinch ground cloves\n1/4 teaspoon ground allspice\n1/2 to 1 teaspoon crushed red pepper flakes, heat mellows as the ketchup\ncoolsJoy the Baker\n9/30/24, 5:10 PM Homemade Spicy Ketchup - Joy the Baker\nhttps://joythebaker.com/2013/07/homemade-spicy-ketchup/ 1/4\n1 28-ounce can crushed tomatoes with juice\n1/2 cup brown sugar\n1/4 cup apple cider vinegar\nPlace oil in a medium saucepan, over medium heat.  I used a 3 quart sauce\npan and it seemed like the perfect fit.  Saute onions until they are transparent,\ntender, and begin to brown, about 6 to 8 minutes.  Add the garlic and cook for\nabout 1 minute more.  Add the tomato paste, salt, and all of the spices to the\npan.  Stir until the tomato paste is evenly distributed, and the spices are\nfragrant, about 1 minute.  Add brown sugar, vinegar, and crushed tomatoes.\n Stir to combine.\nLet mixture simmer over low heat for about 45 minutes.  Mixture will thicken\nto a ketchup consistency.  Stir occasionally.\nRemove pan from heat, and use an immersion blender to blend to the chunky\nketchup smooth.  If you don’t have an immersion blender, you can carefully\nplace the warm ketchup in a regular blender to blend smooth.  Just be sure to\nleave the blender lid slightly ajar so the warm contents don’t burst.  After\nusing either an immersion or regular blender, strain ketchup through a fine\nmesh strainer into a clean bowl.  This will remove any unwanted seeds.  I\nleave mine chunky cause I’m dirty like that.  Get into it.\nTaste and adjust seasoning as necessary.  Store ketchup in glass jars in the\nfridge.  Ketchup will last for up to 1 month in the fridge!\n9/30/24, 5:10 PM Homemade Spicy Ketchup - Joy the Baker\nhttps://joythebaker.com/2013/07/homemade-spicy-ketchup/ 2/4\nsays: says: says: says: says: says: says: says: says: says: says: says: says:\nsays: says: says: says: says: says: says: says: says: says:TRACKBACKS\nLEAVE A REPLY\nRELATED POSTS IN GLUTEN-FREE\nFRESH BAKED EM AILS,\nDELIVERED TO YOUR\nINBOX\nHI! I’M  JOY!\nBOOKS + M AGAZINES\nM Y FAVORITE CAM PING\nGEAR\n9/30/24, 5:10 PM Homemade Spicy Ketchup - Joy the Baker\nhttps://joythebaker.com/2013/07/homemade-spicy-ketchup/ 3/4\nDRAKE ON CAKE\n Follow on Instagram (https://www.instagram.com/joythebaker/)INSTAGRAM\nLoad More... (javascript:void(0);)\n9/30/24, 5:10 PM Homemade Spicy Ketchup - Joy the Baker\nhttps://joythebaker.com/2013/07/homemade-spicy-ketchup/ 4/4",
    "preview": "Homemade Spicy Ketchup makes 3 cups ketchup 2 tablespoons olive oil 1 medium onion, chopped 1 clove garlic, minced 1 heaping tablespoon tomato paste 1 teaspoon salt 1 teaspoon ground mustard 1/2...",
    "size": 1835054
  },
  {
    "id": 51,
    "filename": "Spanish chickpea and spinach stew.pdf",
    "file_path": "recipes/051_Spanish_chickpea_and_spinach_stew.pdf",
    "type": "pdf",
    "content": "Spanish chickpea and spinach stew \nserves: 4 \nprep: 10 min \ncooking: 30 min \nIngredients \n2 tbsp / 30 ml oil (I used olive oil) \n3 garlic cloves, finely chopped \n1 medium red onion, finely chopped \n3 tsp cumin (ground) \n1½ tsp smoked paprika (ground) \n¼-½ tsp cayenne pepper or hot chilli powder \n½ tsp salt \n2-3 tsp brown sugar \nblack pepper, to taste \n2 x 400 g tins of peeled plum tomatoes \n1 tbsp of tomato paste \n1½ cups of cooked chickpeas \n200 g of spinach \na handful of almond flakes, toasted \nfresh parsley, chopped (optional) \ncooked rice (I used brown), to serve with \nMethod \nHeat up the oil in a large frying pan (ideally with a lid). Add chopped onion and fry on a low heat until almos t translucent, stirring from time to time. 1. \nAdd chopped garlic. Keep on stirring frequently until the onion is translucent and garlic softens c ompletely and releases its beautiful aroma. 2. \nAdd all the ground spices to the fried onion and garlic mixture and stir them around well. Fry them of f gently for a minute or two stirring the whole time as they burn easily. 3. \nAdd tomato paste to the pan and stir it into the onion and garlic mixture. 4. \nSquash plum tomatoes with a potato masher in a separate bowl before adding them to the pan. Add toma toes to the pan, salt and half of the sugar. Let the sauce thicken by \nsimmering it on a low heat with no lid on. Give the sauce a good stir from time to time. 5. \nOnce the sauce thickens, taste it and season with some black pepper and more sugar if needed. I  used 3 tsp of sugar in this recipe as my tomatoes were quite tangy, but you may \nnot need as much. 6. \nStir in cooked chickpeas and let them warm through. Now add in the spinach and place the lid on to let spi nach wilt and cook in the steam. If you are not in a rush, you can gently \npan-fry the spinach in a little olive oil and garlic separately and then add it to the dish, but tha t’s optional. 7. \nServe over rice, sprinkled with toasted almonds and fresh parsley. 8. Spanish chickpea and spinach stew https://www.lazycatkitchen.com/spanish-chickpea-spi nach-stew/?print=true \n1 of 1 1/9/2019, 4:30 PM",
    "preview": "Spanish chickpea and spinach stew serves: 4 prep: 10 min cooking: 30 min Ingredients 2 tbsp / 30 ml oil (I used olive oil) 3 garlic cloves, finely chopped 1 medium red onion, finely chopped 3 tsp...",
    "size": 523402
  },
  {
    "id": 52,
    "filename": "Hearty Vegetable Stew Recipe by Tasty.pdf",
    "file_path": "recipes/052_Hearty_Vegetable_Stew_Recipe_by_Tasty.pdf",
    "type": "pdf",
    "content": "1/23/24, 2:53 PM Hearty Vegetable Stew Recipe by Tasty\nhttps://tasty.co/recipe/hearty-vegetable-stew 1/2Hearty V egetable S tew\nWarm up on a chilly evening with this comforting Hearty V egetable S tew. Loaded with  \nnutritious vegetables and simmered in a flavorful broth, this dish is a perfect way to get your  \ndaily dose of veggies.\nRachel Gaewski\nTasty T eam\nMay 04, 2023\nIngredients\nfor 6 servings\n2 tablespoons olive oil\n10 oz baby bella mushroom ,\nquartered\n1 yellow onion , diced\n3 carrots , chopped\n2 celery stalks , chopped\n2 cloves garlic , minced\n½ teaspoon dried rosemary\n½ teaspoon dried thyme\n½ teaspoon pepper\n3 tablespoons tomato paste\n2 tablespoons low sodium soy\nsauce\n¼ cup flour\n¾ cup dry red wine\n4 cups red potato , diced\n4 cups vegetable broth\n2 dried bay leavesMeal Dinner Weeknight High-Fiber Low-Sugar Under 1 Hour Special Occasion\n1/23/24, 2:53 PM Hearty Vegetable Stew Recipe by Tasty\nhttps://tasty.co/recipe/hearty-vegetable-stew 2/2Nutrition Info\nCalories  \nFat g\nCarbs  g\nFiber  g\nSugar  g\nProtein  g\nEstimated values based on one\nserving size .\nPreparation\n1In large pot or Dutch oven, heat the olive oil over medium heat. Once the oil begins to\nshimmer , add the mushrooms and cook for about 5 minutes, or until most of their juices\nhave been released.\n2Add the onions, carrots, and celery , and cook for 4-5 minutes, or until onions are semi-\ntranslucent.\n3Add the garlic, rosemary , thyme , pepper , tomato paste , and soy sauce , and cook for 2-3\nmore minutes, until the herbs are fragrant.\n4Add the flour and stir until fully incorporated. Add the wine and stir until mostly absorbed.\n5Add the potatoes, vegetable broth, and bay leaves, and bring to a boil. R educe the heat to\nmedium-low and simmer for 45 minutes, stirring occasionally , until the potatoes are tender\nand the stew has thick ened.\n6Remove the bay leaves.\n7Enjoy!\n8Don't let a good recipe slip away . Download the T asty app  and save your favorites for easy\naccess.",
    "preview": "1/23/24, 2:53 PM Hearty Vegetable Stew Recipe by Tasty https://tasty.co/recipe/hearty-vegetable-stew 1/2Hearty V egetable S tew Warm up on a chilly evening with this comforting Hearty V egetable S...",
    "size": 79473
  },
  {
    "id": 53,
    "filename": "Curried Rice (Basmati rice) - RecipeTin Eats.pdf",
    "file_path": "recipes/053_Curried_Rice_(Basmati_rice)_-_RecipeTin_Eats.pdf",
    "type": "pdf",
    "content": "3/10/24, 2:39 PM Curried Rice (Basmati rice) - RecipeTin Eats\nhttps://www.recipetineats.com/wprm_print/34395 1/2Curried Rice (Basmati rice)\nRecipe video abo ve. You need mor e than just curr y powder for a gr eat Curried\nRice! Basmati adds a beautifully nutty ar oma t o this rice r ecipe. Spiciness:  Warm\nhum, not o verly spicy . Not intended t o be a full-on authentic Indian r ecipe, but\nleans mor e towar ds Indian than unﬂa vourful W estern curr y recipes (y ou know\nthe type I mean!)\n10 mins 20 mins 10 mins 30 mins\nSides Indian Basmati rice r ecipes, Curr y Rice, Rice Pilaf\n4 365cal  Nagi\nIngredients\nSpices:\nRice:\nFinishes:\nInstructions\nPrep Time\nCook Time\nResting\nTotal Time\nCourse: \nCuisine: \nKeywor d: \nServings: \nCalories: \nAuthor: 2 tsp yellow curr y powder  \n(Note 1)\n0.67  tsp cumin\n0.67  tsp coriander\n0.33  tsp paprika\n0.33  tsp chilli powder  \n(adjust spiciness t o taste) (Note 2)\n26.67 g (2 tbsp)  butter  \n(or ghee or oil) (Note 3)\n0.67  onion  \n, ﬁnely chopped\n2 garlic clo ves \n, minced\n1.33  tsp ginger  \n, ﬁnely chopped or gr ated\n1 cups ( 183.33 g) uncook ed basmati rice  \n(Note 4)\n1.33  small carr ot \n, peeled and gr ated\n1.5 cups ( 373.33  ml) chick en or v egetable br oth, low sodium  \n(Note 5)\n1.33  cups ( 200g) frozen peas\n0.83  tsp salt\n0.33  tsp black pepper\n0.67  cup ( 100g) cashews  \n, roasted, unsalted\n0.33  cup coriander/cilantr o lea ves \n, ﬁnely chopped\nYogur t \n, for ser ving (optional)\n1. Rinse rice until water runs pr etty clear , then dr ain well. (Note 4)\n2. Melt butter in a small t o medium pot (or lar ge saucepan) o ver medium high heat.\n3. Add garlic and ginger , cook 30 seconds. Add onion and cook for 2 minutes until par tly\ntranslucent.\n4. Add carr ot and cook for 2 - 3 minutes until softened and sweet.\n5. Add rice and stir t o coat all the gr ains in the oil.\n\u0000. Add Spices and mix t o coat the rice.\n7. Add br oth, peas, salt and pepper , stir. If any rice is pr otruding abo ve the sur face, pok e it under\nthe liquid.\n4.99  from 79 votes\n3/10/24, 2:39 PM Curried Rice (Basmati rice) - RecipeTin Eats\nhttps://www.recipetineats.com/wprm_print/34395 2/2Notes\n1. Curr y powder  - Use HO T if you want it spicy , or mild if not. Use any curr y powder - not intended t o\nbe a full on authentic Indian r ecipe. I'v e used all the major br ands sold at A ustralian supermark ets\n(Keens, Cliv es, Ho yts, Master foods) and the y're all tasty .\n2. Chilli powder  - this is pur e ground chilli, for spiciness so adjust t o taste. Chili powder in the US is a\nspice mix that' s not v ery spicy . If you can 't get pur e ground chilli powder , sub with ca yenne pepper .\n3. Ghee  is clariﬁed butter used in Indian cooking. Tastes lik e rich butter . Not essential in this r ecipe.\n4. Rice  - basmati is ideal for this r ecipe, the nutty ar oma adds t o the o verall ﬂa vour. Can also use\nother plain white rice - long gr ain or jasmine (best subs), medium*, shor t grain* or sushi rice*. Not\nsuitable for: Br own rice, black rice, wild rice, paella, or risott o rice. Not tried with quinoa. * Rice is\nstickier , such is the natur e of those rices. \nHow I rinse rice:  Either place in colander and run under water for 30 seconds, mo ving rice about with\nyour hands, until water runs pr etty clear . Or do this in a bowl, swishing rice ar ound and changing\nwater 4 times or so. Dr ain rice well befor e using. No need t o soak rice for this r ecipe - I found it didn 't\nmak e a diff erence t o ﬂuﬃness.\n5. Br oth/st ock - Be sur e to use low sodium br oth (st ock), other wise it will end up t oo salty . If you use\na stock powder , bouillon cube or concentr ate + hot water t o mak e broth, then omit the salt\ncompletely .\n6. GENERAL : - Scaling r ecipe: If y ou scale down, be sur e to use a smaller pot other wise the rice won 't\ncook e venly. - Don 't use a fork t o ﬂuff basmati rice, it br eaks the long gr ains.\nNutrition\nCalories: 365cal | Carbohy drates: 56g | Protein: 12g | Fat: 10g | Satur ated F at: 2g | Sodium: 538mg |\nPotassium: 508mg | Fiber: 5g | Sugar: 6g | Vitamin A: 3940 IU | Vitamin C: 22.9 mg | Calcium: 58mg |\nIron: 3.4mg\nAnother gr eat r ecipe b y recipetineats.com\u0000. When the entir e sur face of the liquid is simmering, stir once, place lid on and immediately turn\nheat down t o LOW.\n9. Cook for 14 minutes, do not peek while cooking!\n10. Lift lid slightly and quickly tilt pot t o check t o ensur e liquid has been absorbed. Clamp lid back\non and r emo ve from heat.\n11. Stand for 10 minutes, undisturbed.\n12. Use a rubber spatula t o gently ﬂuff the rice. (Note 6)\n13. Add most of the cashews and coriander , stir thr ough.\n14. Transf er to ser ving bowl, sprinkle with r emaining cashews and coriander . See in post for ser ving\nideas.",
    "preview": "3/10/24, 2:39 PM Curried Rice (Basmati rice) - RecipeTin Eats https://www.recipetineats.com/wprm_print/34395 1/2Curried Rice (Basmati rice) Recipe video abo ve. You need mor e than just curr y powder...",
    "size": 1404965
  },
  {
    "id": 54,
    "filename": "The Best Vegetarian Enchiladas - Build Your Bite.pdf",
    "file_path": "recipes/054_The_Best_Vegetarian_Enchiladas_-_Build_Your_Bite.pdf",
    "type": "pdf",
    "content": "The Best V egetarian Enchiladas\nThese black bean and v eggie enchiladas ar e the most delicious v egetarian enchiladas y ou will e ver eat!\nIngredients\n1 lar ge onion, diced\n5 lar ge garlic clo ves, minced or ﬁnely diced\n1 lar ge gr een pepper , diced\n1 tablespoon oliv e oil\n1 cup fr ozen corn k ernels\n2 tablespoons cr eam cheese\n10 lar ge ﬂour t ortillas\n1 1/2 cups shr edded mexican cheese\n1 (15 o z) can black beans, dr ained\n1 teaspoon smok ed paprika\n2 teaspoons cumin\n1/2 teaspoon chili powder\n1/2 lar ge lime, juiced, plus mor e for ser ving\n8 oz enchilada sauce\navocado, for ser ving\nSea salt\nPepper\nInstructions\n1. Combine onion, garlic, gr een pepper , 1 tablespoon of oliv e oil, and 1/4 teaspoon of sea salt and pepper in a lar ge skillet\n2. Sautee on medium high heat for 6-8 minutes, until onion becomes tr anslucent\n3. Add fr ozen corn k ernels and sautee an additional 4-5 minutes, as corn defr osts\n4. Add dr ained beans, cr eam cheese, 1/2 cup shr edded mexican cheese, smok ed paprika, cumin, chili powder , and the juice of half a lar ge\nlime\n5. Add salt and pepper t o taste (I used an additional 1/2 teaspoon of each)\n\u0000. Build enchiladas using ﬁlling and place in a baking dish\n7. Cover with enchilada sauce and r emaining mexican cheese\n\u0000. Bake at 350 for 20-25 minutes, or until cheese becomes slightly crisp y (turn up the heat if necessar y towar ds the end for desir ed crisp) I\nbroil on low the last couple of minutes t o mak e the cheese br owned, but if y ou do this be sur e to watch closely so that y ou don 't burn it.\n9. Serve topped with fr esh lime juice and a vocado slices\n10. Enjo y!\nDid y ou mak e this r ecipe?\nYIELD: 10 ENCHILADAS\nPREP TIME\n20 minutes\nCOOK TIME\n25 minutes\nTOTAL TIME\n45 minutes   \n \nNutrition Information:\nYIELD: 10\nSERVING SIZE: 1 enchilada\nAmount P er Ser ving:\nCALORIES: 290\nTOTAL FAT: 12g\nSATURATED FAT: 6g\nTRANS FAT: 0g\nUNSATURATED FAT: 5g\nCHOLESTEROL: 19mg\nSODIUM: 699mg\nCARBOHYDRATES: 35g\nFIBER: 8g\nSUGAR: 5g\nPROTEIN: 12g\nBe sur e to tag me on instagr am @buildy ourbite and hashtag #buildy ourbite with y our r ecipe cr eations!\n© Jo y Shull\nCUISINE: mexican / CATEGORY: Main Dish\nhttps:/ /buildy ourbite.com/the-best-e ver-veggie-enchiladas/",
    "preview": "The Best V egetarian Enchiladas These black bean and v eggie enchiladas ar e the most delicious v egetarian enchiladas y ou will e ver eat! Ingredients 1 lar ge onion, diced 5 lar ge garlic clo ves,...",
    "size": 71266
  },
  {
    "id": 55,
    "filename": "Cheddar-Roasted Broccoli Recipe.pdf",
    "file_path": "recipes/055_Cheddar-Roasted_Broccoli_Recipe.pdf",
    "type": "pdf",
    "content": "Cheddar-\nRoasted\nBroccoli\nBy Ali Slagle\nPublished March 1, 2024\nNico Schinco for The New York Times. Food Stylist: Barrett Washburne.Total Time 40 minutes\nPrep Time 10 minutes\nCook Time 30 minutes\nRating (529)\nI N G R E D I E N T S\nYield:4 servings\n1½ pounds broccoli, cut into 1½-\nto 2-inch-long florets, stems sliced\n¼-inch thick\n3 tablespoons extra-virgin olive oil\nSalt and pepper\n2 garlic cloves, finely chopped\n¾ packed cup/3 ounces coarsely\ngrated extra-sharp CheddarP R E P A R A T I O N\nStep 1\nArrange a rack at the bottom of the oven and heat to 425 degrees.\nOn a parchment paper-lined sheet pan, toss the broccoli with the\noil and season with salt and pepper. Arrange in a single layer, cut\nsides down, and roast on the bottom rack, without flipping, until\nbrowned and crisp-tender, 15 to 20 minutes.\nStep 2\nSprinkle the broccoli with the garlic, stir to combine, then spread\nthe broccoli in an even layer. Sprinkle with the Cheddar, then\nroast until the cheese is melted and nearly all golden brown, 6 to 9\nminutes. Let cool a few minutes for the cheese to crisp. Use a\nspatula to transfer the broccoli and all the cheese to plates.\nPrivate Notes\nLeave a Private Note on this recipe and see it here.\nWith frizzled florets and crisp-tender stems, roasted broccoli is pretty delicious on its own. Follow Step\n1 if you need a go-to basic method, or keep going for broccoli all dressed up in lacy skirts of Cheddar.\nStore-bought grated cheese will work, but freshly grated cheese will have an easier time surrendering\nto the heat of the oven. Let the cheese go past melted to just golden brown, at which point it will crisp\ninto chips on your florets. Serve the broccoli alongside chicken cutlets, sausage or refried beans — or\neat it straight from the sheet pan with your fingers.",
    "preview": "Cheddar- Roasted Broccoli By Ali Slagle Published March 1, 2024 Nico Schinco for The New York Times. Food Stylist: Barrett Washburne.Total Time 40 minutes Prep Time 10 minutes Cook Time 30 minutes...",
    "size": 927418
  },
  {
    "id": 56,
    "filename": "Enchilada Sauce - Cookie and Kate.pdf",
    "file_path": "recipes/056_Enchilada_Sauce_-_Cookie_and_Kate.pdf",
    "type": "pdf",
    "content": "11/10/2021 How to Mak e Enchilada Sauce - Cookie and K ate\nhttps://cookieandk ate.com/enchilada-sauce-r ecipe/print/24083/ 1/3★ ★ ★ ★ 4.8 from 1187  reviews PRINT\nHomemade Enchilada Sauce\nAuthor:  Cookie and Kate  Prep Time:  3 mins  Cook Time:  7 mins  Total Time:  10 minutes  \nYield:  2 cups  1x  Category:  Condiment  Cuisine:  Mexican\nThis homemade red enchilada sauce has authentic Mexican flavor! It’s so good and easy, you’ll never go back\nto store-bought sauce again. You can even make a double batch and freeze half of it for later. Recipe as written\nbelow yields about 2 cups (16 ounces) sauce.\nSCALE1x 2x 3x\nINGREDIENTS\n3 tablespoons  olive oil\n3 tablespoons  flour (whole wheat flour, all-purpose flour and gluten-free flour blends all work!)\n1 tablespoon  ground chili powder (scale back if you’re sensitive to spice or using particularly spicy chili\npowder)\n1 teaspoon  ground cumin\n½ teaspoon  garlic powder\n¼ teaspoon  dried oregano\n¼ teaspoon  salt, to taste\nPinch of cinnamon (optional but recommended)\n2 tablespoons  tomato paste\n2 cups  vegetable broth\n1 teaspoon  apple cider vinegar or distilled white vinegar\nFreshly ground black pepper, to taste★\n11/10/2021 How to Mak e Enchilada Sauce - Cookie and K ate\nhttps://cookieandk ate.com/enchilada-sauce-r ecipe/print/24083/ 2/3Save recipes, create shopping lists,\nmeal plans and more. ADD TO SHOPPING LIST\nINSTRUCTIONS\n1. This sauce comes together quickly once you get started, so measure the dry ingredients (the flour, chili\npowder, cumin, garlic powder, oregano, salt and optional cinnamon) into a small bowl and place it near\nthe stove. Place the tomato paste and broth near the stove as well.\n2. In a medium-sized pot over medium heat, warm the oil until it’s hot enough that a light sprinkle of the\nflour/spice mixture sizzles on contact. This might take a couple of minutes, so be patient and don’t step\naway from the stove!\n3. Once it’s ready, pour in the flour and spice mixture. While whisking constantly, cook until fragrant and\nslightly deepened in color, about 1 minute. Whisk the tomato paste into the mixture, then slowly pour\nin the broth while whisking constantly to remove any lumps.\n4. Raise heat to medium-high and bring the mixture to a simmer, then reduce heat as necessary to\nmaintain a gentle simmer. Cook, whisking often, for about 5 to 7 minutes, until the sauce has thickened\na bit and a spoon encounters some resistance as you stir it. (The sauce will thicken some more as it\ncools.)\n5. Remove from heat, then whisk in the vinegar and season to taste with a generous amount of freshly\nground black pepper. Add more salt, if necessary (I usually add another pinch or two). Go forth and\nmake enchiladas!\nNOTES\nEnchilada sauce recipe adapted from my spinach artichoke enchiladas .\nStorage suggestions:  Extra enchilada sauce will keep well in the refrigerator for up to 5 days. Or, freeze it\nfor up to 3 months. Let it cool to room temperature before transferring to a wide-mouth mason jar, leaving\nsome room at the top for expansion (don’t screw on the lid completely until the mixture is fully frozen), or a\nfreezer bag (remove excess air before sealing).\nMake it gluten free:  Just use gluten-free all-purpose flour blend. I tried with Bob’s Red Mill brand and it\nworked great.  \nMake it tomato free:  You can omit the tomato paste. You might want to up the spices a bit. The sauce\nwon’t taste quite like the enchilada sauce you might buy at the store, but it will still be good!  \nChange it up:  The chili powder, cumin and garlic powder are essential here, but feel free to change up the\nother spices to suit your preferences.  \nIf you love this sauce:  Check out more of my Mexican recipes here!\n▸ NUTRITION INFORMATION\n11/10/2021 How to Mak e Enchilada Sauce - Cookie and K ate\nhttps://cookieandk ate.com/enchilada-sauce-r ecipe/print/24083/ 3/3Did you make this recipe?\nPlease let me know how it turned out for you! Leave a comment below and share a picture on Instagram  with\nthe hashtag #cookieandkate .\nRecipe from Cookie and Kate : https://cookieandkate.com/enchilada-sauce-recipe/",
    "preview": "11/10/2021 How to Mak e Enchilada Sauce - Cookie and K ate https://cookieandk ate.com/enchilada-sauce-r ecipe/print/24083/ 1/3★ ★ ★ ★ 4.8 from 1187 reviews PRINT Homemade Enchilada Sauce Author:...",
    "size": 183759
  },
  {
    "id": 57,
    "filename": "zucchini_casserole.pdf",
    "file_path": "recipes/057_zucchini_casserole.pdf",
    "type": "pdf",
    "content": "Zucchini Pie \nRated: \nSubmitted By: IMTHECOOKSTER \nPhoto By: handbanana \nPrep Time: 20 Minutes \nCook Time: 30 Minutes Ready In: 50 Minutes \nServings: 8\n\"A little like a quiche, a little like a pie--and t he best of both. This easy crustless quiche is \nmade with zucchini, baking mix, and Parmesan cheese .\" \nINGREDIENTS: \n3 cups zucchini, diced \n1 onion, chopped \n4 eggs, beaten \n1 cup buttermilk baking mix \n1/2 cup vegetable oil 1/2 cup grated Parmesan cheese \n1/2 teaspoon dried marjoram \n1 teaspoon chopped parsley, or to taste \nground black pepper to taste \nDIRECTIONS: \n1. Preheat oven to 350 degrees F (175 degrees C). Grea se a 10x6-inch pan or a \n12-inch pie plate. \n2. In a medium mixing bowl, combine zucchini, onion, e ggs, buttermilk baking mix, \nvegetable oil, Parmesan cheese, marjoram, parsley a nd pepper; mix well. Spread \ninto the prepared baking dish. \n3. Bake for 30 minutes, or until lightly brown. \nALL RIGHTS RESERVED © 2015 Allrecipes.com Printed fr om Allrecipes.com 5/20/2015 http://allrecipes.com/Recipe-Tools/Print/Recipe.asp x?recipeID=14877&o... \n1 of 1 5/20/2015 4:10 PM\n",
    "preview": "Zucchini Pie Rated: Submitted By: IMTHECOOKSTER Photo By: handbanana Prep Time: 20 Minutes Cook Time: 30 Minutes Ready In: 50 Minutes Servings: 8 \"A little like a quiche, a little like a pie--and t...",
    "size": 46665
  },
  {
    "id": 58,
    "filename": "Frozen Green Beans Recipe (Stovetop) - Munchy Goddess.pdf",
    "file_path": "recipes/058_Frozen_Green_Beans_Recipe_(Stovetop)_-_Munchy_Goddess.pdf",
    "type": "pdf",
    "content": "The Best EASY Frozen Green Beans Recipe\n(Stovetop)\nThis quick and easy frozen green beans recipe makes the perfect last minute side dish! Frozen\ngreen beans are sautéed in melted butter, then seasoned to perfection. It’s truly the best!\nCourse Dinner, Side Dish\nCuisine American\nKeyword easy green bean side dish, frozen green beans, frozen green beans recipes\nPrep Time 1minute\nCook Time 9minutes\nTotal Time 10minutes\nServings 4\nAuthor Ivory\nIngredients\nInstructions\nNotes\nRecipe Variations And Substitutions:\nLemon-Garlic: Add a splash of fresh lemon juice and some fresh minced garlic for a lemon\ngarlic twist.\nCheesy: Sprinkle with grated Parmesan during the last minute of cooking.1tablespoonolive oil\n2tablespoonsunsalted butter\n1poundfrozen green beans\n½teaspoongarlic powder\n¼teaspoonred pepper ﬂakes\n¼teaspoonsalt\n¼teaspoonground black pepper\n1. Heat a large skillet over medium low heat. Add the olive oil and butter, allowing the butter to\nmelt completely.\n2. Add the frozen green beans to the skillet. Increase the heat to medium high and toss the\ngreen beans until they are well coated with the olive oil and butter. Cook for 5-7 minutes,\nstirring occasionally, until the beans are heated throughly and start to become tender.\n3. Sprinkle garlic powder, red pepper ﬂakes, salt, and pepper over the beans. Stir well to coat\nevenly.\n4. Continue cooking for another 3-5 minutes, until the green beans are just tender.\n5. Serve immediately and enjoy!\nMore seasonings: Toss with Italian seasoning for a different ﬂavor.\nButter: Feel free to use olive oil or vegan butter in place of butter if preferred. Also, salted\nbutter works just ﬁne in the recipe, you will just need to adjust the amount of salt you add to\nthe green beans.\nStorage And Reheating Instructions:\nStore leftovers in an airtight container in the refrigerator for up to 4 days.\nReheat in microwave for 20 seconds at a time, tossing in between, until warmed.\nPro Tips:\nDon’t Thaw: Use the green beans straight from the freezer for the best texture.\nAdjust Seasonings: Taste and adjust the salt, pepper, and garlic powder to your preference.\n",
    "preview": "The Best EASY Frozen Green Beans Recipe (Stovetop) This quick and easy frozen green beans recipe makes the perfect last minute side dish! Frozen green beans are sautéed in melted butter, then...",
    "size": 90327
  },
  {
    "id": 59,
    "filename": "Fried Bread Recipe.pdf",
    "file_path": "recipes/059_Fried_Bread_Recipe.pdf",
    "type": "pdf",
    "content": "9/26/23, 4:37 PM Fried Br ead R ecipe - F ood.com\nhttps://www .food.com/r ecipe/fried-br ead-135931 1/1FRIED BREAD\nReady In:20mins\nIngredients:4Yields:9biscuits\nINGREDIENTS\n4teaspoons baking powder\n2cups \u0000our\n1cup water\noil or lard (for frying)DIRECTIONS\n\u0000\u0000 Mix \u0000our and baking powder. Add water\nto make a soft dough. Pat dough out on\na sheet of plastic wrap to about 1/2\"\nthick.\n\u0000\u0000 Heat up about 1/4\" of oil or lard to\nmedium heat in a cast iron or non stick\npan.\n\u0000\u0000 Cut dough into about 9 biscuits.\n\u0000\u0000 Fry on one side until brown. Flip and\ncook about 2-3 minutes more. Test for\ndoneness by \u0000aking the side of a biscuit\nwith a fork. If it seems dry inside it is\ndone.\n\u0000\u0000 Serve with butter and jam. Can also be\nnapped with gravy and served with\nstewed hamburger and onions.Submitted bymomthecook 2\n\"My mom used this on the mornings when we had run out of bread. She also used it to\nmake sandwiches if needed. It came from my Granny who used it to round out meals\nduring the Depression.\"\n ",
    "preview": "9/26/23, 4:37 PM Fried Br ead R ecipe - F ood.com https://www .food.com/r ecipe/fried-br ead-135931 1/1FRIED BREAD Ready In:20mins Ingredients:4Yields:9biscuits INGREDIENTS 4teaspoons baking powder...",
    "size": 65617
  },
  {
    "id": 60,
    "filename": "Black Bean Burger Is Ready in 30 Minutes.pdf",
    "file_path": "recipes/060_Black_Bean_Burger_Is_Ready_in_30_Minutes.pdf",
    "type": "pdf",
    "content": "2/3/22, 9:58 AM This Killer Homemade Black Bean Bur ger Is R eady in 30 Minutes\nhttps://lifehack er.com/how-to -mak e-a-killer -black-bean-bur ger-in-30-minutes-1846792837 3/7This recipe should yield 4 thin yet substantial patties. Feel free to make some\ncommon-sense substitutions: If you don’t have mayo, sour cream or ranch dressing\nwill work great. A couple of large dried chiles, soaked and peeled , can easily stand in\nfor the canned ones. And, of course, you should add or subtract seasonings to suit\nyour tastes.\nPlace the oats, nuts, mayonnaise, and drained chiles in the bowl of a food processor.\nAdd about 2 tablespoons of liquid from the beans. Pulse until you have a rough\npaste, scraping down the sides of the bowl as needed. Let this mixture sit while you\nprepare the beans.\nThoroughly drain the beans and spread them out in a large nonstick or well-\nseasoned cast iron skillet. Cook over over medium-high heat for 5-8 minutes, stirring\nonce or twice, until they’re totally dried out and starting to split. Taste one for\nseasoning and adjust as needed—canned beans usually need at least a little salt.1/2 cup rolled or quick-cooking oats\n1/2 cup nuts, any kind, toasted or raw (I used toasted walnuts)\n2 tablespoons mayonnaise or vegan mayonnaise\n1 4-ounce can roasted green chiles or 1 chipotle in adobo, drained\n1 1/2 cups cooked black beans, homemade or from a 15-ounce can\n2 teaspoons hot sauce of choice, or more as desired (my go-to is El Yucateco\nBlack Label)\n1 teaspoon garlic powder\n1/2 teaspoon ground cumin\n1/2 teaspoon adobo seasoning or garlic salt, plus more to taste\n1-2 tablespoons water, as needed\nVegetable or olive oil, for cooking\nBuns and condiments of choice, to serve·\n·\n·\n·\n·\n·\n·\n·\n·\n·\n·\n·HOME LATEST FOOD & DRINK TECH HEALTH MONEY HOME\n2/3/22, 9:58 AM This Killer Homemade Black Bean Bur ger Is R eady in 30 Minutes\nhttps://lifehack er.com/how-to -mak e-a-killer -black-bean-bur ger-in-30-minutes-1846792837 4/7Photo : A.A. Newton\nScrape the hot beans into the food processor, add everything else except the water,\nand process until you have a relatively smooth paste. Take a little taste and adjust\nthe seasonings as needed. If it holds together when pinched, you’re set. If it’s a dry,\ncrumbly mess, throw in a tablespoon of water and process to combine. Generously\nwet your hands and form the burger mixture into 4 patties. (Some extra surface\nmoisture helps prevent cracking and crumbling.)HOME LATEST FOOD & DRINK TECH HEALTH MONEY HOME\n2/3/22, 9:58 AM This Killer Homemade Black Bean Bur ger Is R eady in 30 Minutes\nhttps://lifehack er.com/how-to -mak e-a-killer -black-bean-bur ger-in-30-minutes-1846792837 5/7This is about the texture you’re aiming for: Moist but not soupy , firm but not crumbly .Photo : A.A.\nNewton\nWipe out the bean skillet and heat it up over medium-low with a thin layer of\nvegetable or olive oil. Add as many patties as you can and let them cook until they’re\ndry on top and firm to the touch. This will take at least 4-5 minutes for thin patties\nand 6-8 for thick ones. They’ll fall apart if you flip them too soon, so don’t touch! Use\nthe downtime to toast buns, slice onions and tomatoes, and get your other\ncondiments ready.  \nFlip the burgers and cook until the underside is brown, another 3-5 minutes\ndepending on thickness. Serve on toasted buns with your favorite toppings. If you\nhave any leftover burger mixture, form it into patties and freeze on a parchment-\nlined sheet pan so they’re ready for your next bean burger craving.HOME LATEST FOOD & DRINK TECH HEALTH MONEY HOME",
    "preview": "2/3/22, 9:58 AM This Killer Homemade Black Bean Bur ger Is R eady in 30 Minutes https://lifehack er.com/how-to -mak e-a-killer -black-bean-bur ger-in-30-minutes-1846792837 3/7This recipe should yield...",
    "size": 119093
  },
  {
    "id": 61,
    "filename": "Curry Rice - Vegan in the Freezer.pdf",
    "file_path": "recipes/061_Curry_Rice_-_Vegan_in_the_Freezer.pdf",
    "type": "pdf",
    "content": "3/10/24, 2:41 PM Easy Vegan Curry Rice - Vegan in the Freezer\nhttps://veganinthefreezer.com/wprm_print/77284 1/4Easy Vegan Curry Rice\nA ﬂa vorful and healthy dish the whole family will enjo y! The combination of\nsautéed v eggies, rice, peas, and curr y powder cr eates an easy and delicious\nmeal.\n Author Ginny McMeans\nIngredients\nInstructions1 tbsp  olive oil\n1 onion\n2 garlic clo ves\n¾ tsp salt\n¾ tsp cayenne pepper\n¼ tsp paprika\n½ tsp ground ginger\n2 tsp curry powder\n1 ½ cup frozen peas\n2 carrots\n1 cup long-gr ain rice\n2 cups  vegetable st ock\n1. Peel and ﬁnely chop the onion and garlic. Heat the oliv e oil in a lar ge pan o ver medium heat.\n2. Add the chopped onion, garlic, salt, ca yenne pepper , paprika, ginger , and curr y powder .\n3. Mix all well and cook for 3-4 minutes.\n4.88  from 8 votes\n3/10/24, 2:41 PM Easy Vegan Curry Rice - Vegan in the Freezer\nhttps://veganinthefreezer.com/wprm_print/77284 2/4\n4. Grate the carr ots. Add the peas and carr ots t o the pan and mix well.\n5. Continue t o cook for another 2-3 minutes, stirring constantly .\n3/10/24, 2:41 PM Easy Vegan Curry Rice - Vegan in the Freezer\nhttps://veganinthefreezer.com/wprm_print/77284 3/4\n\u0000. Add the rice and pour in the st ock.\n7. Mix well again and co ver. Cook for 15 minutes o ver medium-low heat.\n3/10/24, 2:41 PM Easy Vegan Curry Rice - Vegan in the Freezer\nhttps://veganinthefreezer.com/wprm_print/77284 4/4\n\u0000. When done, tr ansf er to ser ving plates.\n9. Optionally , top with ﬁnely chopped cashews or cilantr o and garnish with lime wedges. Enjo y!",
    "preview": "3/10/24, 2:41 PM Easy Vegan Curry Rice - Vegan in the Freezer https://veganinthefreezer.com/wprm_print/77284 1/4Easy Vegan Curry Rice A ﬂa vorful and healthy dish the whole family will enjo y! The...",
    "size": 210338
  },
  {
    "id": 62,
    "filename": "5-Minute Stir Fry Sauce (so easy!) - Fork in the Kitchen.pdf",
    "file_path": "recipes/062_5-Minute_Stir_Fry_Sauce_(so_easy!)_-_Fork_in_the_Kitchen.pdf",
    "type": "pdf",
    "content": "4/6/23, 3:48 PM 5-Minute Stir F ry Sauce (so easy!) - F ork in the Kitchen\nhttps://www .forkinthekitchen.com/stir -fry-sauce-r ecipe/ 1/25-Minute Stir F ry Sauce (so easy!)\nMaking stir fr y at home has ne ver been easier with this 5-minute stir fr y sauce r ecipe made fr om\nscratch. Whisk t ogether the simple ingr edients - or shak e them up in a jar - and add it t o your fa vorite\nstir fr y ingr edients. Y our ﬂa vorful dinner will be r eady in no time!\n4.97 from 100 votes\n5 minutes 5 minutes 6 servings Becca Mills\nIngredients  \nText Me the Ingr edients\nInstructions  \nPrep Time: \nTotal Time: \nServings: \nAuthor: ½ cup soy sauce , \nlow sodium r ecommended\n½ cup low-sodium v egetable st ock, \nor water\n1 teaspoon  sesame oil\n½ Tablespoon  rice vinegar\n2 cloves garlic , \nminced\n1 - 2 teaspoon  grated ginger\n1 Tablespoon  sugar or hone y*, \nup to 2 tablespoons for a mor e sweet than sour sauce\n1 Tablespoon  cornstar ch\nPinch  red pepper ﬂak es, \noptional\n1. In a bowl or mason jar with a lid, combine all of the ingr edients and whisk or shak e well until\ncombined.\n2. Use immediately in a stir fr y recipe, or st ore in an air tight container in the fridge for up t o 1\nweek. Recipe yields appr oximately 1 1/4 cup of sauce.\n4/6/23, 3:48 PM 5-Minute Stir F ry Sauce (so easy!) - F ork in the Kitchen\nhttps://www .forkinthekitchen.com/stir -fry-sauce-r ecipe/ 2/25-Minute Stir Fry Sauce (so easy!) https://www.forkinthekitchen.com/stir-fry-sauce-recipe/ January 25, 2022Notes\nSour:  to mak e it mor e sour , incr ease the rice vinegar t o 1 tablespoon.\nSweet:  to mak e it sweeter , add up t o one additional tablespoon of sugar or hone y.\nSugar:  speaking of, br own sugar or gr anulated sugar work!\nThick er: to mak e the sauce extr a thick, add up t o 1 tablespoon additional corn star ch. \nPlay around with the r atios if y ou ha ve a pr eference for a cer tain taste - it' s super cust omizable!\nNutrition\nServing: 2tablespoons | Calories: 16kcal | Carbohy drates: 3g | Protein: 1g | Fat: 1g | Satur ated F at: 1g |\nPolyunsatur ated F at: 1g | Monounsatur ated F at: 1g | Sodium: 497 mg | Potassium: 22mg | Fiber: 1g |\nSugar: 1g | Vitamin A: 18IU | Vitamin C: 1mg | Calcium: 3mg | Iron: 1mg\nDid you make this recipe?\nPlease lea ve a star r ating and r eview  in the form below . I appr eciate y our f eedback, and it\nhelps others, t oo!\nDisclaimer: The nutritional information pr ovided for this r ecipe is only an estimate. The accur acy of\nthe facts listed is not and cannot be guar anteed.",
    "preview": "4/6/23, 3:48 PM 5-Minute Stir F ry Sauce (so easy!) - F ork in the Kitchen https://www .forkinthekitchen.com/stir -fry-sauce-r ecipe/ 1/25-Minute Stir F ry Sauce (so easy!) Making stir fr y at home...",
    "size": 76353
  },
  {
    "id": 63,
    "filename": "Green Salad with Creamy Mayo Vinaigrette - southern discourse.pdf",
    "file_path": "recipes/063_Green_Salad_with_Creamy_Mayo_Vinaigrette_-_southern_discourse.pdf",
    "type": "pdf",
    "content": "6/18/22, 1:38 PM Green Salad with Cr eamy Mayo V inaigr ette - souther n discourse\nhttps://souther ndiscourse.com/gr een-salad-with-cr eamy -mayo -vinaigr ette/ 1/1www.SouthernDiscourse.comGreen Salad with Creamy Mayo Vinaigrette\n5 from 1 vote\nSalad American classic, southern favorite\n10 minutes 4 people Stacey | SouthernDiscourse.com\nIngredients\nCreamy Mayo Dressing\nInstructions\nCourse: \nCuisine: \nKeyword: \nPrep Time: \nServings: \nAuthor: 4 hearts butter lettuce, \nor small head iceberg lettuce\n3-4 Roma tomatoes,\n1 small green bell pepper, \ndiced\n3-4 green onions, \nsliced\n1/4 cup real mayonnaise\n1 tablespoon red wine vinegar\n1 teaspoon sugar\n1/4 teaspoon salt\n1/4 teaspoon coarse ground black pepper\n1. Chop salad ingredients and place in a large serving bowl.\n2. Add dressing ingredients to a glass jar. Screw lid on tightly and shake until all ingredients\nare mixed.\n3. When ready to serve salad, pour dressing over prepared the lettuce, tomatoes, pepper and\nonions in serving bowl. Toss salad and dressing together until all ingredients are coated\nwell. Serve.",
    "preview": "6/18/22, 1:38 PM Green Salad with Cr eamy Mayo V inaigr ette - souther n discourse https://souther ndiscourse.com/gr een-salad-with-cr eamy -mayo -vinaigr ette/ 1/1www.SouthernDiscourse.comGreen...",
    "size": 165611
  },
  {
    "id": 64,
    "filename": "Mushroom Quesadillas - Recipes for Health - NYTimes.com.pdf",
    "file_path": "recipes/064_Mushroom_Quesadillas_-_Recipes_for_Health_-_NYTimes.com.pdf",
    "type": "pdf",
    "content": "3/17/24, 12:45 PM Mushroom Quesadillas - Recipes for Health - NYTimes.com\nﬁle:///home/jfg/Mount/box 25GB/Recipes/Mushroom Quesadillas - Recipes for Health - NYTimes.com.htm 1/2Search All NYT imes.com\n \nSearch Health 3,000+  Topics\nResearch Fitness & Nutrition Money & Policy Views Health GuideInside Health\nRecipes for\nHealth\nMartha Rose\nShulman\npresents food\nthat is vibrant\nand light, full of nutrients but\nby no means ascetic, fun to\ncook and to eat.\nSee All Recipes for Health »\nVisit Recipes for Health  on\nFacebook.\nRelated\nRecipes for Health: Fast Food\nfor Harried Days  (March 14,\n2011)\nRecipes for Health: Broccoli\nand Red Onion Quesadillas\n(March 15, 2011)\nRecipes for Health: Black\nBean and Goat Cheese\nQuesadillas  (March 16, 2011)\nRecipes for Health: Spinach\nand Goat Cheese Quesadillas\n(March 18, 2011)RECIPES FOR HEAL TH\nMushroom Quesadillas\nAndrew Scrivani for The New York Times\nBy MAR THA ROSE SHULMAN\nPublished: March 14, 201 1\nMushrooms make a meaty quesadilla filling. If you cook them in advance\nand keep them in the refrigerator, you can slap these together in a pinch.\n1 tablespoon extra virgin olive oil\n1 shallot, minced (optional)\n6 ounces regular or wild mushrooms,\ntrimmed and sliced about 1/4 inch thick\n1 to 2 garlic cloves, minced\n1 jalapeño or serrano chili, minced (seeded for a milder flavor)\n1 tablespoon chopped cilantro or epazote\nSalt and freshly ground pepper\n4 corn tortillas\n2 ounces grated Monterey Jack, Cheddar, or mixed cheeses (1/2\ncup)\nSalsa for serving (optional)\n1. Make the mushroom filling. Heat the oil over medium heat in\na large, heavy frying pan. Add the shallot. Cook, stirring, until\ntender, about three minutes. Stir in the mushrooms. Cook,\nstirring, until tender and juicy, about five minutes. Add the\ngarlic, chili, and salt and pepper. Cook, stirring, for another minute. Stir in the cilantro or\nepazote, and remove from the heat. Taste and adjust seasoning.\n2. In a microwave:  Place a corn tortilla on a plate. Top with half the mushrooms, and spread in\nan even layer. Sprinkle on half the cheese , and top with another tortilla. Press down gently, then\nMOST EMAILED RECOMMENDED FOR YO\nLog in to discover more articles\nbased on what you‘ve read.\n \nWhat’ s This?  | Don’t ShowA New Tooth, Made to Order in Under an\nHour\nOctober 8, 2012\nAre You Likely to Respond to Exercise?\nOctober 10, 2012, 12:01 AM\nApps Alert the Doctor When Trouble Looms\nOctober 8, 2012\nTexting the Teenage Patient\nOctober 8, 2012\nThe Doctor's Bag for the New Millennium\nOctober 8, 2012\nCannot GET /regilite\nHealth & Fitness T ools\nBMI Calculator\nWhat’ s your score? »\nWe don’t have any personalized\nrecommendations for you at this time.\nPlease try again later .\nClassic Arnold in his own\nscript\nALSO IN STYLE »\nIllusion meets inspirationHOME P AGE TODA Y'S P APER VIDEO MOST  POPULAR TIMES TOPICS\nFitness & Nutrition\nWORLD U.S. N.Y. / REGION BUSINESS TECHNOLOGY SCIENCE HEALTH SPORTS OPINION ARTS STYLE TRAVEL JOBS REAL  EST ATEAUTOS\nLINKEDIN\nPRINT\nREPRINTS\nSHARE\nSubscribe: Digital  / Home Delivery  Log In  Register Now  Help\n3/17/24, 12:45 PM Mushroom Quesadillas - Recipes for Health - NYTimes.com\nﬁle:///home/jfg/Mount/box 25GB/Recipes/Mushroom Quesadillas - Recipes for Health - NYTimes.com.htm 2/2microwave for 1 to 1 1/2 minutes, until the cheese has melted. Remove from the microwave, cut\ninto quarters or sixths and serve. Repeat with the remaining ingredients.\nIn a pan:  Place a corn tortilla in a pan. Top with half the mushrooms, and spread in an even\nlayer. Sprinkle on half the cheese. Turn the heat to medium-high, and heat until the cheese\nbegins to melt. Place another tortilla on top of the cheese, and press down lightly. Flip the\nquesadilla over in the pan, and heat for about 30 seconds or until the cheese has melted. Flip\nback over, and remove to a plate. Cut into quarters or sixths, and serve. Repeat with the\nremaining ingredients.\nYield: Two quesadillas.\nAdvance preparation: The cooked mushrooms will keep for three or four days in the\nrefrigerator. Reheat gently before assembling the quesadillas.\nNutritional information (per quesadilla):  256 calories ; 6 grams saturated fat ; 1 gram\npolyunsaturated fat; 5 grams monounsaturated fat; 30 milligrams cholesterol ; 18 grams\ncarbohydrates ; 3 grams dietary fiber ; 232 milligrams sodium (does not include salt to taste); 11\ngrams protein\nMartha Rose Shulman is the author of \"The Very Best of Recipes for Health.\"\nGet Home Delivery  Get 50% Off The New York T imes & Free All Digital Access.\nGet Free E-mail Alerts on These T opics\nCheese\nMushrooms\nCooking and Cookbooks\nDiet and Nutrition\nnytimes.com\n Style\nElection 2012 - Definitive CoverageGee, she looks familiar\nADVER TISEMENTS\nHome  World U.S. N.Y. / Region  Business  Technology  Science  Health  Sports  Opinion  Arts Style  Travel  Jobs  Real Estate\nAutos  Back to Top\n© 201 1 The New York Times Company  Privacy  Your Ad Choices  Terms of Service  Corrections  RSS  First Look  Help  Contact Us\nWork for Us  Advertise  Site MapPRINT\nREPRINTS",
    "preview": "3/17/24, 12:45 PM Mushroom Quesadillas - Recipes for Health - NYTimes.com ﬁle:///home/jfg/Mount/box 25GB/Recipes/Mushroom Quesadillas - Recipes for Health - NYTimes.com.htm 1/2Search All NYT imes.com...",
    "size": 363109
  },
  {
    "id": 65,
    "filename": "Steam Broccoli w_ Bragg _ Online Cooking School.pdf",
    "file_path": "recipes/065_Steam_Broccoli_w__Bragg___Online_Cooking_School.pdf",
    "type": "pdf",
    "content": "4/8/2020 Cooking Course: Plant- Based Cooking: An Intr oduction > T ask: Steam Br occoli w/ Bragg | Online Cooking School\nhttps://lms.r ouxbe.com/cooking-courses/plant-based-cooking-level-1/task/1363/activity/2097 1/1Task Activity: Steamed Broccolini w/ Bragg Liquid Aminos\nPlant-Based Cooking: An Introduction  > Task 82  > Task Activity\n \n Steamed Broccolini w/ Bragg Liquid Aminos by Dawn T\nSteamed broccolini is misted with Bragg Liquid Aminos and tossed with chili \u0000akes and sesame oil for a healthy side\ndish.\nServes: 2 Active Time: 10 mins Total Time: 10 mins \nViews: 20937 Success 100% \nStep 1: Steaming the Broccolini\nIngredients\n• 1 bunch broccolini \n• pinch sea salt Description\nSet up a steamer. Fill with one inch of water and place over medium-high\nheat. Refer to the lessons on Steaming for more information, if necessary.\nWash the broccolini and trim o\u0000 the stem ends. Transfer the broccolini to\nthe steaming basket and sprinkle with a pinch of salt. Place over the\nsimmering water. Steam for approximately 3 to 5 minutes or until tender\nand cooked to your liking.\nStep 2: Dressing the Broccolini\nIngredients\n• 1/8 tsp red chili \u0000akes \n• 1/4 tsp sesame oil \n• Bragg Liquid Aminos (to taste) Description\nOnce the broccolini is cooked, transfer to a large bowl and spray with the\nBragg. Sprinkle the chili \u0000akes over top and drizzle with the sesame oil. Toss\ngently to combine.\nTransfer to a serving bowl and serve immediately.\nNote: If desired, substitute soy sauce in place of Braggs aminos.",
    "preview": "4/8/2020 Cooking Course: Plant- Based Cooking: An Intr oduction > T ask: Steam Br occoli w/ Bragg | Online Cooking School https://lms.r...",
    "size": 60096
  },
  {
    "id": 66,
    "filename": "Salisbury Steak - Simple Joy.pdf",
    "file_path": "recipes/066_Salisbury_Steak_-_Simple_Joy.pdf",
    "type": "pdf",
    "content": "3/6/24, 4:01 PM Salisbury Steak - Simple Joy\nhttps://www.simplejoy.com/salisbury-steak/ 1/2Salisbury Steak\nSalisbur y Steak is a comfor ting classic that is easy t o mak e and e ven\neasier t o love. Made fr om scr atch with the per fect mushr oom gr avy,\neveryone will be begging for seconds.\n5 mins 35 mins 40 mins\nMain Course American comfor t food\n4 servings  474kcal  Lisa Longle y\nIngredients\nSalisbur y Steak\nGravy\nInstructions\nPrep Time\nCook Time\nTotal Time\nCourse: \nCuisine: \nKeywor d: \nServings: \nCalories: \nAuthor: 1 pound  ground beef  \n(85/15)\n1/2 small y ellow onion  \ngrated ﬁne\n1/2 cup Italian seasoned br eadcrumbs  \n(read how t o mak e this r ecipe low carb or gluten fr ee\nhere: Low Carb Salisbur y steak )\n1 large egg  \nwhisk ed\n2 cloves garlic  \nminced\n2 tablespoons  ketchup\n1 tablespoon  Worcestershir e sauce\n1 teaspoon  kosher salt\n1/2 teaspoon  ground mustar d\n1/2 teaspoon  ground black pepper\n1 tablespoon  olive oil\n1 tablespoon  unsalted butter\n1/2 small y ellow onion  \ndiced\n2 cloves garlic  \nminced\n1/2 teaspoon  kosher salt\ndash  ground black pepper\n4 ounces  white butt on mushr ooms  \nsliced\n2 tablespoons  all purpose ﬂour\n3 cups  beef br oth\n2 tablespoons  ketchup\n1 tablespoon  Worcestershir e sauce\n1. In a lar ge bowl, combine the beef, gr ated onion, br eadcrumbs, egg, garlic, k etchup,\nWorcestershir e sauce, kosher salt, gr ound mustar d, and black pepper .\n2. Divide the meat mixtur e int o four equal patties that o val shaped and appr oximately 1/2 an inch\nthick. Set aside.\n3. Heat 1 tablespoon oliv e oil in a lar ge skillet o ver medium heat. Add the steaks and br own each\nside, about 2 minutes per side. No need t o cook them all the wa y thr ough. Remo ve from the\nskillet and set aside.\n4. Melt the butter in the skillet. Add in the onion and garlic, season with salt and pepper , and sauté\nfor about 3 minutes. Add in the mushr ooms and cook until tender , about 5 minutes.\n5 from 3 votes\n3/6/24, 4:01 PM Salisbury Steak - Simple Joy\nhttps://www.simplejoy.com/salisbury-steak/ 2/2Nutrition\nServing: 1steak with gr avy | Calories: 474kcal | Carbohy drates: 20g | Protein: 27g | Fat: 32g | Satur ated\nFat: 12g | Polyunsatur ated F at: 2g | Monounsatur ated F at: 14g | Trans F at: 2g | Cholester ol: 129mg |\nSodium: 1657 mg | Potassium: 674mg | Fiber: 2g | Sugar: 4g | Vitamin A: 185IU | Vitamin C: 5mg |\nCalcium: 90mg | Iron: 4mg5. Add the ﬂour t o the pan and t oss the mushr ooms in it. Slowly add in the beef st ock, scr aping up\nthe br owned bits as y ou slowly whisk it in t o the skillet. Stir in the k etchup and W orcestershir e\nsauce. Turn up the heat. Bring t o a simmer , bring the heat back down, and cook for 10 minutes,\nstirring occasionally .\n\u0000. Add the br owned steaks (plus any liquid that has accumulated on the plate), and cook for 5\nmore minutes, or until the steaks ar e cook ed thr ough and the gr avy has thick ened.",
    "preview": "3/6/24, 4:01 PM Salisbury Steak - Simple Joy https://www.simplejoy.com/salisbury-steak/ 1/2Salisbury Steak Salisbur y Steak is a comfor ting classic that is easy t o mak e and e ven easier t o love....",
    "size": 116123
  }
]